title: Juniper BGP MD5 missing
id: a7c0ae48-8df8-42bf-91bd-2ea57e2f9d43
status: experimental
description: Find BGP failures which may be indicative of brute force attacks to manipulate routing: https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
author: Tim Brown
date: 2023/01/09
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.T1078
    - attack.credential_access
    - attack.T1110
    - attack.collection
    - attack.T1557
logsource:
    product: juniper
    service: bgp
detection:
    protocol:
        - ':179'
    keywords:
        - 'missing MD5 digest'
    condition: protocol and keywords
fields:
    - host
level: low
falsepositives:
    - Uncommon except due to misconfigurations
