title: Potential Linux Splice Syscall by Non-Root User From Unusual Binary - DirtyFrag Page Cache Corruption
id: 474b415a-9a1d-4b7e-c824-3f5e7d9a0b62
status: experimental
description: |
    Detects invocation of the splice() syscall by a non-root user from binaries outside of
    standard system paths. splice transfers data between file descriptors without copying to
    userspace and is used legitimately by web servers and databases for zero-copy I/O.
    However, in the Dirty Frag exploit and related page cache corruption attacks, splice is the
    critical syscall that moves pipe contents into the page cache of a read-only SUID binary,
    mutating it in place. The Dirty Frag exploit manipulates the Linux XFRM (IPsec) subsystem
    to trigger ESP decryption into a splice pipe, corrupting the page cache of SUID binaries.
    The exploit produces ~96 splice calls in rapid succession from a single non-root PID
    executing from a non-standard path.
    Validated against live Dirty Frag exploit execution on Ubuntu 24.04 kernel 6.5.
references:
    - https://man7.org/linux/man-pages/man2/splice.2.html
    - https://github.com/V4bel/dirtyfrag
    - https://www.openwall.com/lists/oss-security/2026/05/07/8
    - https://chromium.googlesource.com/chromiumos/docs/+/master/constants/syscalls.md
author: Gene Kazimiarovich
date: 2026-05-08
tags:
    - attack.privilege-escalation
    - attack.t1068
logsource:
    product: linux
    service: auditd
    definition: |
        Required auditd configuration:
        auditctl -a always,exit -F arch=b64 -S splice -F uid!=0 -k splice_nonroot
detection:
    selection:
        type: 'SYSCALL'
        SYSCALL: 'splice'
    filter_main_root:
        uid: 0
    filter_main_standard_paths:
        exe|startswith:
            - '/usr/bin/'
            - '/usr/sbin/'
            - '/usr/lib/'
            - '/usr/libexec/'
    filter_main_services:
        exe|endswith:
            - '/nginx'
            - '/haproxy'
            - '/apache2'
            - '/httpd'
            - '/caddy'
            - '/envoy'
            - '/mysqld'
            - '/mariadbd'
            - '/postgres'
            - '/mongod'
            - '/redis-server'
            - '/cp'
            - '/rsync'
            - '/cat'
            - '/dd'
            - '/tar'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Custom application binaries installed outside standard paths using splice for zero-copy file transfers
    - Container processes with non-standard binary paths performing legitimate I/O
level: medium
