title: Certificate-Based Authenication Enabled
id: c2496b41-16a9-4016-a776-b23f8910dc58
status: test
description: Certificate based authentication enabled in Azure Active Directory.
references:
    - https://posts.specterops.io/passwordless-persistence-and-privilege-escalation-in-azure-98a01310be3f
    - https://goodworkaround.com/2022/02/15/digging-into-azure-ad-certificate-based-authentication/
author: Harjot Shah Singh, '@cyb3rjy0t'
date: 2024/02/15
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1556
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        OperationName: 'Authenication Methods Policy Update'
        TargetResources|contains: 'AuthenicationMethodsPolicy'
    condition: selection
falsepositives:
    - Unknown
level: high
