title: Change to Authentication Method
id: 4d78a000-ab52-4564-88a5-7ab5242b20c7
status: test
description: Change to authentication method could be an indicator of an attacker adding an auth method to the account so they can have continued access.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#authentication-methods
author: AlertIQ
date: 2021-10-10
modified: 2026-05-09
tags:
    - attack.privilege-escalation
    - attack.credential-access
    - attack.defense-impairment
    - attack.t1556
    - attack.persistence
    - attack.t1098
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        properties.loggedByService: 'Authentication Methods'
        category: 'UserManagement'
        operationName: 'User registered security info'
    condition: selection
falsepositives:
    - Unknown
level: medium
