title: Bitlocker Key Retrieval
id: a0413867-daf3-43dd-9245-734b3a787942
status: test
description: Monitor and alert for Bitlocker key retrieval.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#bitlocker-key-retrieval
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#b2c
    - https://cyberdom.blog/monitor-and-hunting-bitlocker-with-azure-sentinel-2/
author: Michael Epping, '@mepples21'
date: 2022-06-28
modified: 2026-05-09
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.initial-access
    - attack.stealth
    - attack.t1078.004
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        category: KeyManagement
        operationName: Read BitLocker key
    condition: selection
falsepositives:
    - Unknown
level: medium
