title: Changes to Device Registration Policy
id: 9494bff8-959f-4440-bbce-fb87a208d517
status: test
description: Monitor and alert for changes to the device registration policy.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#device-registrations-and-joins-outside-policy
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#device-registration-service
author: Michael Epping, '@mepples21'
date: 2022-06-28
modified: 2026-05-09
tags:
    - attack.privilege-escalation
    - attack.defense-impairment
    - attack.t1484
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        category: 'Policy'
        operationName: 'Set device registration policies'
    condition: selection
falsepositives:
    - Unknown
level: high
