title: User Disable MFA.
id: b18454c8-0be3-41f7-86bc-9c614611b839
status: test
description: Threat Actor reset the password to maintain or achieve access to the account. Common indicator seen in SIM Swap attacks.
references:
    - 'https://www.sans.org/blog/defending-against-scattered-spider-and-the-com-with-cybercrime-intelligence/'
author: Harjot Singh 'cyb3rjy0t'
date: 2024-08-13
tags:
    - attack.credential-access
    - attack.persistence
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        LoggedByService: 'Core Directory'
        Category: 'UserManagement'
        OperationName: 'Update user'
        TargetResources.ModifiedProperties.DisplayName: 'StrongAuthenticationRequirement'
        TargetResources.ModifiedProperties.NewValue|contains: "State\":0"
    condition: selection
falsepositives:
    - Known activity.
level: medium
