title: User State Changed From Guest To Member
id: 8dee7a0d-43fd-4b3c-8cd1-605e189d195e
status: test
description: Detects the change of user type from "Guest" to "Member" for potential elevation of privilege.
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts#monitoring-external-user-sign-ins
    - https://analyticsrules.exchange/analyticrules/a09a0b8e-30fe-4ebf-94a0-cffe50f579cd/
author: MikeDuddington, '@dudders1'
date: 2022-06-30
modified: 2026-05-09
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.initial-access
    - attack.stealth
    - attack.t1078.004
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        category: 'UserManagement'
        operationName: 'Update user'
        properties.targetResources|contains|all:
            - 'UserType'
            - 'Guest',
            - 'Member'
    condition: selection
falsepositives:
    - If this was approved by System Administrator.
level: medium
