title: End User Consent Blocked
id: 7091372f-623c-4293-bc37-20c32b3492be
status: test
description: Detects when end user consent is blocked due to risk-based consent.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#end-user-stopped-due-to-risk-based-consent
    - https://research.splunk.com/cloud/10ec9031-015b-4617-b453-c0c1ab729007/
    - https://mashtitle.com/2025/06/23/husky-corp/
    - https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/
author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: 2022-07-10
modified: 2026-05-09
tags:
    - attack.credential-access
    - attack.t1528
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        operationName : 'Consent to application'
        properties.resultReason: 'Microsoft.Online.Security.UserConsentBlockedForRiskyAppsException'
    condition: selection
falsepositives:
    - Unknown
level: medium
