title: Password Reset By User Account
id: 340ee172-4b67-4fb4-832f-f961bdc1f3aa
status: test
description: Detect when a user has reset their password in Azure AD
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities
author: YochanaHenderson, '@Yochana-H'
date: 2022-08-03
modified: 2026-05-09
tags:
    - attack.privilege-escalation
    - attack.initial-access
    - attack.persistence
    - attack.credential-access
    - attack.stealth
    - attack.t1078.004
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        category: 'UserManagement'
        properties.result: 'success'
        properties.initiatedby|contains: 'UPN'
    filter:
        properties.TargetResources|contains: 'UPN'
        operationName|contains: 'Password reset'
    condition: selection and filter
falsepositives:
    - If this was approved by System Administrator or confirmed user action.
level: medium
