title: Local System Accounts Discovery
id: ddf36b67-e872-4507-ab2e-46bda21b842c
status: experimental
description: Detects enumeration of local systeam accounts on MacOS
author: Alejandro Ortuno, oscd.community
date: 2020/10/08
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1087.001/T1087.001.md
logsource:
  category: process_creation
  product: macos
detection:
  selection_1:
    Image|endswith:
      - '/dscl'
    CommandLine|contains|all:
      - 'list'
      - '/users'
  selection_2:
    Image|endswith:
      - '/dscacheutil'
    CommandLine|contains|all:
      - '-q'
      - 'user'
  selection_3:
    CommandLine|contains:
      - "'x:0:'"
  selection_4:
    Image|endswith:
      - '/cat'
    CommandLine|contains:
      - '/etc/passwd'
      - '/etc/sudoers'
  selection_5:
    Image|endswith:
      - '/id'
  selection_6:
    Image|endswith:
      - '/lsof'
    CommandLine|contains:
      - '-u'
  condition: 1 of them
falsepositives:
  - Legitimate administration activities
level: low
tags:
  - attack.discovery
  - attack.t1087.001
