title: Suspicious Kubernetes Enumeration or Attack
id: 597a7e84-187d-458b-9e4f-2f5a0e676711
status: experimental
description: |
    Detects suspicious network artifacts related to Kubernetes enumeration or attacks.
    This includes the execution of common shells, utilities, or specialized tools like 'Rakkess' (access_matrix) and 'TruffleHog' via Kubernetes API requests.
    Attackers use these methods to perform reconnaissance (enumeration), secret harvesting, or execute code (exec) within a cluster.
references:
    - https://www.nccgroup.com/research/detection-engineering-for-kubernetes-clusters/
    - https://github.com/trufflesecurity/trufflehog
    - https://github.com/corneliusweig/rakkess
author: Lars Ostmann
date: 2026/03/19
tags:
    - attack.execution
    - attack.discovery
    - attack.t1609
    - attack.t1613
logsource:
    product: kubernetes
    service: audit
detection:
    selection_request_uri:
        requestURI|re: '%2f(bin%2f(ash|bash|busybox|dash|sh|zsh)|usr%2fbin%2f(curl|kubectl|perl|python|wget))|%20-[icl]'
    selection_user_agent:
        userAgent|contains:
            - 'access_matrix'  # Rakkess
            - 'trufflehog'     # Secret scanning tool
            - 'azurehound'     # Azure/Cloud discovery
            - 'micro-scanner'  # Vulnerability scanning
    selection_status:
        responseStatus.code: 'ALLOW'
    condition: (selection_request_uri or selection_user_agent) and selection_status
falsepositives:
    - Authorized administrative maintenance via kubectl
    - Automated internal infrastructure monitoring and certificate rotation
    - Security-approved vulnerability or secret scanning in DevSecOps pipelines
level: medium
