title: bcdedit off
status: experimental
description: Detects usage of bcdedit off
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'bcdedit.exe'
          CommandLine:
            - '*off'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
