title: Net IPC Share
status: experimental
description: Detects mshta with javascript in command line
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'mshta.exe'
        CommandLine:
            - '*javascript:*'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Some admins use it, mostly bad things.
level: medium
