title: Net IPC Share
status: experimental
description: Detects net usage accessing IPC$
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'net.exe'
        CommandLine:
            - '*ipc$*'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Some admins use it, mostly bad things.
level: medium
