title: Powershell Encoded Command
status: experimental
description: Detects usage of Powershell Encoded Commands
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'powershell.exe'
        CommandLine:
            - 'base64'
            - '-enc'
            - '-enco'
            - '-encod'
            - '-encode'
            - '-encoded'
            - '-ec'
            - '-en'
            - '-encodedC'
            - '-encodedCo'
            - '-encodedCom'
            - '-encodedComm'
            - '-encodedComma'
            - '-encodedComman'
            - '-encodedCommand'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
