title: Powershell Download
status: experimental
description: Detects usage of Powershell Download commands
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'powershell.exe'
        CommandLine:
            - '*DownloadFile*'
            - '*invoke-webrequest*'
            - '*iwr'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
