title: Detect Squiblydoo
status: experimental
description: Detection of squiblydoo technique - scrobj.dll
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'rundll32.exe'
        CommandLine:
            - '*scrobj.dll'
            - '*scrobj'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
