title: Schtask from User Profile
status: experimental
description: Detects usage of Powershell Download commands
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'schtask.exe'
        CommandLine:
            - '*\appdata\*'
    condition: selection
fields:
    - CommandLine
    - FileName
falsepositives:
    - Should be limited in legitimate use
level: medium
