title: Schtask Creation
status: experimental
description: Detects usage of schtask
references:
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        FileName:
            - 'schtask.exe'
    condition: selection
fields:
    - FileName
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
