title: WatchdogProc usage
status: experimental
description: Detects watchdogproc on the command line.
references: https://www.endgame.com/blog/technical-blog/malware-personal-touch
author: Michael Haag
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        CommandLine:
            - 'watchdogproc*'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Not very common, but occurs.
level: medium
