title: Microsoft Binary Github Communication
status: experimental
description: Detects an executable in the Windows folder accessing github.com
references:
    - https://twitter.com/M_haggis/status/900741347035889665
author: Michael Haag (idea), Florian Roth (rule)
logsource:
    product: crowdstrike:falconhost:json
    service: cs
detection:
    selection:
        DomainName: '.githubusercontent.com'
        DomainName: 'dl.dropboxusercontent.com'
        ImageFileName: 'C:\Windows\*'
    condition: selection
falsepositives:
    - 'Unknown'
    - '@subTee in your network'
level: high
