title: Sliver Service Installations
id: 31c51af6-e7aa-4da7-84d4-8f32cc580af2
description: Detects known malicious service installs that appear in cases in which a Sliver implants execute the PsExec commands
status: experimental
author: Florian Roth
references:
    - https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
date: 2022/08/25
tags:
    - attack.execution
    - attack.privilege_escalation
    - attack.lateral_movement
    - attack.t1021.002
    - attack.t1543.003
    - attack.t1569.002
logsource:
    product: windows
    service: system
detection:
    selection_id:
        Provider_Name: 'Service Control Manager'
        EventID: 7045
    selection1:
        ImagePath|re: '^[a-zA-Z]:\\windows\\temp\\[a-zA-Z0-9]{10}\.exe'
    selection2:
        ServiceName:
            - 'Sliver'
            - 'Sliver implant'
    condition: 1 of selection*
falsepositives:
    - Unknown
level: critical