title: KrbRelayUp Service Installation
id: e97d9903-53b2-41fc-8cb9-889ed4093e80
status: experimental
description: Detects service creation from KrbRelayUp tool used for privilege escalation in windows domain environments where LDAP signing is not enforced (the default settings)
author: Sittikorn S, Tim Shelton
date: 2022/05/11
updated: 2022/05/16
references:
  - https://github.com/Dec0ne/KrbRelayUp
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: '7045'
    ServiceName: 'KrbSCM'
  condition: selection
falsepositives:
  - Unknown
level: high
tags:
  - attack.privilege_escalation
  - attack.t1543
