title: Anydesk Remote Access Software Service Installation
id: 530a6faa-ff3d-4022-b315-50828e77eef5
status: experimental
description: Detects the installation of the anydesk software service. Which could be an indication of anydesk abuse if you the software isn't already used.
author: Nasreddine Bencherchali
references:
    - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
date: 2022/08/11
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: 'Service Control Manager'
        EventID: 7045
        ServiceName: 'AnyDesk Service'
    condition: selection
falsepositives:
    - Legitimate usage of the anydesk tool
level: medium
tags:
  - attack.persistence
