title: Windows Defender Threat Detection Disabled
id: 6c0a7755-6d31-44fa-80e1-133e57752680
related:
    - id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
      type: derived
description: Detects disabling Windows Defender threat protection
date: 2020/07/28
modified: 2021/11/22
author: Ján Trenčanský, frack113
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
status: stable
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    product: windows
    service: system
detection:
    Selection:
        EventID: 7036
        Provider_Name: 'Service Control Manager'
        param1: 
            - 'Windows Defender Antivirus Service'
            - 'Service antivirus Microsoft Defender' #French OS
        param2: 'stopped'
    condition: Selection
falsepositives:
    - Administrator actions
level: high