title: Suspicious Usage of CVE_2021_34484 or CVE 2022_21919
id: 52a85084-6989-40c3-8f32-091e12e17692
status: experimental
description: During exploitation of this vuln, two logs (providername:Microsoft-Windows-User Profiles Service) with eventid 1511 and 1515 (maybe lot of false positives with this event) are created. Moreover, it appears the directory \Users\TEMP is created may be created during the exploitation.Viewed on 2008 Server
author: Cybex
references:
  - https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html
date: 2022/08/16
logsource:
  product: windows
  service: application
detection:    
  selection:
      EventID: 1511                      
      ProviderName: 'Microsoft-Windows-User Profiles Service'
  condition: selection
falsepositives:
  - Unknown
level: high
tags:  
  - attack.execution
