title: Local Privilege Escalation Indicator TabTip
status: experimental
id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG is used on a system in brute force mode
author: Florian Roth
date: 2022/10/07
references:
    - https://github.com/antonioCoco/JuicyPotatoNG
tags:
    - attack.execution
    - attack.t1557.001
logsource:
    product: windows
    service: system
detection:
    keywords:
        - '{054AAE20-4BEA-4347-8A35-64A533254A9D}'
        - '2147943140'
        - 'C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe'
    condition: all of keywords
falsepositives:
    - Unknown
level: high
