title: Hide Internal Tools or Fonction for User by Registry Policies
id: 5a93eb65-dffa-4543-b761-94aa60098fb6
status: experimental
description: Hide internal tools or fonction to interfere with the user's remediation. Malware like Agent Tesla, hermeticwiper uses this technique
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md
author: frack113
date: 2022/03/18
logsource:
    category: registry_event
    product: windows
detection:
    selection_set_1: 
        EventType: SetValue
        TargetObject|endswith: 
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideClock'
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAHealth'
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCANetwork'
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAPower'
            - 'Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAVolume'
        Details: 'DWORD (0x00000001)'
    selection_set_0: 
        EventType: SetValue
        TargetObject|endswith: 
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowInfoTip'
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowCompColor'
        Details: 'DWORD (0x00000000)'    
    condition: 1 of selection_set_*
falsepositives:
    - Legitim admin script
level: medium
tags:
    - attack.defense_evasion
    - attack.t1112