title: Blue Mockingbird
id: 92b0b372-a939-44ed-a11b-5136cf680e27
related:
    - id: c3198a27-23a0-4c2c-af19-e5328d49680e
      type: derived
date: 2020/05/14
modified: 2021/09/11
status: experimental
description: Attempts to detect system changes made by Blue Mockingbird
references:
    - https://redcanary.com/blog/blue-mockingbird-cryptominer/
tags:
    - attack.execution
    - attack.t1112
    - attack.t1047
author: Trent Liffick (@tliffick)
logsource:
  product: windows
  category: registry_event
detection:
  mod_reg:
    TargetObject|endswith: '\CurrentControlSet\Services\wercplsupport\Parameters\ServiceDll'
  condition: mod_reg
falsepositives:
    - unknown
level: high