title: RDP Sensitive Settings Changed
id: 171b67e1-74b4-460e-8d55-b331f3e32d67
description: Detects changes to RDP terminal service sensitive settings
references:
    - https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html
date: 2019/04/03
modified: 2020/09/06
author: Samir Bousseaden
logsource:
    category: registry_event
    product: windows
detection:
    selection_reg:
        RegistryKey|contains: '\services\TermService\Parameters'
        RegistryValue: 'ServiceDll'
    selection_reg2:
        RegistryKey|endswith: '\Control\Terminal Server'
        RegistryValue:
            - 'fSingleSessionPerUser'
            - 'fDenyTSConnections'
    condition: 1 of them
tags:
    - attack.defense_evasion
    - attack.t1112
falsepositives:
    - unknown
level: high
