title: Windows Credential Editor
id: 7aa7009a-28b9-4344-8c1f-159489a390df
description: Detects the use of Windows Credential Editor (WCE)
author: Florian Roth
references:
    - https://www.ampliasecurity.com/research/windows-credentials-editor/
date: 2019/12/31
tags:
    - attack.credential_access
    - attack.t1003
    - attack.s0005
logsource:
    category: registry_event
    product: windows
detection:
    selection:       
        TargetObject|contains: Services\WCESERVICE\Start
    condition: selection
falsepositives:
    - 'Another service that uses a single -s command line switch'
level: critical