title: Suspicious Printer Driver Empty Manufacturer
id: e0813366-0407-449a-9869-a2db1119dc41
status: test
description: Detects a suspicious printer driver installation with an empty Manufacturer value
author: Florian Roth
references:
  - https://twitter.com/SBousseaden/status/1410545674773467140
date: 2020/07/01
modified: 2021/11/27
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    TargetObject|contains|all:
      - '\Control\Print\Environments\Windows x64\Drivers'
      - '\Manufacturer'
    Details: '(Empty)'
  condition: selection
falsepositives:
  - Alerts on legitimate printer drivers that do not set any more details in the Manufacturer value
level: high
tags:
  - attack.privilege_escalation
  - attack.t1574
  - cve.2021.1675
