title: New TaskCache Entry
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled task is registered
tags:
  - attack.persistence
  - attack.t1053
  - attack.t1053.005
date: 2021/06/18
modified: 2021/07/27
references:
  - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
author: Syed Hasan (@syedhasan009)
falsepositives:
  - Unknown
level: medium
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    EventType: SetValue
    TargetObject|contains: 'SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\'
  condition: selection
