title: Wdigest Enable UseLogonCredential
id: 2dbd9d3d-9e27-42a8-b8df-f13825c6c3d5
description: Detects potential malicious modification of the property value of UseLogonCredential from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable clear-text credentials
status: experimental
date: 2019/09/12
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.defense_evasion
    - attack.t1112
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|endswith: 'WDigest\UseLogonCredential'
    condition: selection
falsepositives:
    - Unknown
level: high
