title: Modification of HKLM\Software\Microsoft\WAB\DLLPath
id: fc014922-5def-4da9-a0fc-28c973f41bfb
description: Detects modification of HKLM\Software\Microsoft\WAB\DLLPath Registry Key that may indicate an attempt to execute a malicious library through WAB.exe
status: experimental
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Wab.yml
    - https://twitter.com/Hexacorn/status/991447379864932352
    - http://www.hexacorn.com/blog/2018/05/01/wab-exe-as-a-lolbin/
tags:
    - attack.defense_evasion
    - attack.t1218
date: 2020/10/13
author: oscd.community, Natalia Shornikova
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|endswith: '\Software\Microsoft\WAB\DLLPath'
    filter:
        Details: '%CommonProgramFiles%\System\wab32.dll'
    condition: selection and not filter
falsepositives: Unknown
level: high
