title: Windows Registry Persistence COM Search Order Hijacking
id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
status: experimental
description: Detects potential COM object hijacking leveraging the COM Search Order
references:
    - https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/
    - https://attack.mitre.org/techniques/T1546/015/
author: Maxime Thiebaut (@0xThiebaut), oscd.community, Cédric Hien
date: 2020/04/14
modified: 2021/12/21
tags:
    - attack.persistence
    - attack.t1546.015
logsource:
    category: registry_event
    product: windows
detection:
    selection: # Detect new COM servers in the user hive
        TargetObject|startswith: 
            - 'HKCR\CLSID\'
            - 'HKCU\Software\Classes\CLSID\'
        TargetObject|endswith: '\InprocServer32\(Default)'
    filter1:
        Details|contains: # Exclude privileged directories and observed FPs
            - '%%systemroot%%\system32\'
            - '%%systemroot%%\SysWow64\'
    filterOneDrive:
        Details|contains: 
            - '\AppData\Local\Microsoft\OneDrive\'
            - '\FileCoAuthLib64.dll'
            - '\FileSyncShell64.dll'
            - '\FileSyncApi64.dll'
    filter2:
        Details|contains|all:
            - '\AppData\Local\Microsoft\TeamsMeetingAddin\'
            - '\Microsoft.Teams.AddinLoader.dll'
    filter3:
        Details|contains|all:
            - '\AppData\Roaming\Dropbox\'
            - '\DropboxExt64.*.dll'
    filter4:
        Details|endswith: TmopIEPlg.dll #TrendMicro osce
    filter5:
        Image:
            - C:\WINDOWS\system32\wuauclt.exe
            - C:\WINDOWS\system32\svchost.exe
    filter_defender:
        Image|contains|all:
            - 'C:\ProgramData\Microsoft\Windows Defender\Platform\'
            - '\MsMpEng.exe'
    filter_nvidia:
        Details|contains:
            - '\FileRepository\nvmdi.inf'
    filter_edge:
        Image|contains|all:
            - 'C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{'
            - '\setup.exe'
    condition: selection and not 1 of filter*
falsepositives:
    - Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level
level: medium
