title: COM Hijack via Sdclt
id: 07743f65-7ec9-404a-a519-913db7118a8d
status: test
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
author: Omkar Gudhate
references:
  - http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
  - https://www.exploit-db.com/exploits/47696
date: 2020/09/27
modified: 2021/11/27
logsource:
  category: registry_event
  product: windows
detection:
  selection:
    TargetObject:
      - 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
  condition: selection
falsepositives:
  - unknown
level: high
tags:
  - attack.privilege_escalation
  - attack.t1546
  - attack.t1548
