title: UAC Bypass via Sdclt
id: 5b872a46-3b90-45c1-8419-f675db8053aa
status: experimental
description: Detects the pattern of UAC Bypass using registry key manipulation of sdclt.exe (e.g. UACMe 53)
references:
    - https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
    - https://github.com/hfiref0x/UACME
author: Omer Yampel, Christian Burkard
date: 2017/03/17
modified: 2021/08/31
logsource:
    category: registry_event
    product: windows
detection:
    selection1:
        # usrclass.dat is mounted on HKU\USERSID_Classes\...
        TargetObject|startswith: 'HKU\'
        TargetObject|endswith: '_Classes\exefile\shell\runas\command\isolatedCommand'
    selection2:
        TargetObject|endswith: '-1???_Classes\Folder\shell\open\command\SymbolicLinkValue'
        Details|contains: '-1???\Software\Classes\'
    condition: 1 of selection*
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1088 # an old one
    - attack.t1548.002
    - car.2019-04-001
falsepositives:
    - unknown
level: high
