title: Office Application Startup - Office Test
id: 3d27f6dd-1c74-4687-b4fa-ca849d128d1c
status: experimental
description: Detects the addition of office test registry that allows a user to specify an arbitrary DLL that will be executed everytime an Office application is started
references:
    - https://attack.mitre.org/techniques/T1137/002/
author: omkar72
tags:
    - attack.persistence
    - attack.t1137.002
date: 2020/10/25
logsource:
    category: registry_event
    product: windows
detection:
    selection_registry:
        TargetObject:
            - 'HKEY_CURRENT_USER\Software\Microsoft\Office test\Special\Perf'
            - 'HKEY_LOCAL_MACHINE\Software\Microsoft\Office test\Special\Perf'
    condition: selection_registry
falsepositives:
    - Unlikely
level: medium
