action: global
title: Usage of Sysinternals Tools
status: experimental
description: Detects the usage of Sysinternals Tools due to accepteula key being added to Registry
references:
    - https://twitter.com/Moti_B/status/1008587936735035392
date: 2017/08/28
author: Markus Neis
falsepositives:
    - Legitimate use of SysInternals tools
    - Programs that use the same Registry Key
level: low
---
id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
logsource:
    product: windows
    category: registry_event
detection:
    selection1:
        TargetObject|endswith: '\EulaAccepted'
    condition: 1 of them
---
id: 7cccd811-7ae9-4ebe-9afd-cb5c406b824b
logsource:
    category: process_creation
    product: windows
detection:
    selection2:
        CommandLine|contains: ' -accepteula'
    condition: 1 of them
