title: VBScript Payload Stored in Registry
id: 46490193-1b22-4c29-bdd6-5bf63907216f
description: Detects VBScript content stored into registry keys as seen being used by UNC2452 group
status: experimental
date: 2021/03/05
author: Florian Roth
references:
    - https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: 'Software\Microsoft\Windows\CurrentVersion'
        Details|contains: 
            - 'vbscript'
            - 'jscript'
            - 'mshtml'
            - 'mshtml,'
            - 'mshtml '
            - 'RunHTMLApplication'
            - 'Execute('
            - 'CreateObject'
            - 'RegRead'
            - 'window.close'
    filter: 
        TargetObject|contains: 'Software\Microsoft\Windows\CurrentVersion\Run'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
tags:
    - attack.persistence
    - attack.t1547.001