title: Wdigest CredGuard Registry Modification
id: 1a2d6c47-75b0-45bd-b133-2c0be75349fd
description: Detects potential malicious modification of the property value of IsCredGuardEnabled from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to disable Cred Guard on a system. This is usually used with UseLogonCredential to manipulate the caching credentials.
status: experimental
date: 2019/08/25
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.defense_evasion
    - attack.t1112
references:
    - https://teamhydra.blog/2020/08/25/bypassing-credential-guard/
logsource:
    category: registry_event
    product: windows
detection:
    selection: 
        TargetObject|endswith: '\IsCredGuardEnabled'
    condition: selection
falsepositives:
    - Unknown
level: critical
