title: COM hijack via Sdclt
id: 07743f65-7ec9-404a-a519-913db7118a8d
status: experimental
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
references:
    - http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
    - https://www.exploit-db.com/exploits/47696
tags:
    - attack.privilege_escalation
    - attack.t1546
    - attack.t1548
author: Omkar Gudhate
date: 2020/09/27
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject:
            - 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
            - 'HKCU\Software\Classes\Folder\shell\open\command'
    condition: selection
falsepositives:
    - unknown
level: high
