title: Printnightmare Mimimkatz Driver Name 
id: ba6b9e43-1d45-4d3c-a504-1043a64c8469
status: experimental
description: Detects static QMS 810 driver name used by Mimikatz 
references:
  - https://github.com/gentilkiwi/mimikatz/commit/c21276072b3f2a47a21e215a46962a17d54b3760
author: Markus Neis, @markus_neis
tags:
  - attack.execution
  - cve.2021-1675
  - cve.2021-34527
date: 2021/06/07
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    EventID:
      - 12 # key create
      - 13 # value set
  selection_qms:
      - TargetObject|startswith: 'HKLM\System\CurrentControlSet\Control\Print\Environments\Windows x64\Drivers\Version-3\QMS 810\'
  condition: selection and selection_qms
falsepositives:
  - Unknown 
level: critical 