title: Persistent Outlook Landing Pages
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
description: Detects the manipulation of persistant URLs which could execute malicious code
status: experimental
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
author: Tobias Michalski
date: 2021/06/10
tags:
  - attack.persistence
  - attack.t1112
logsource:
  product: windows
  category: registry_event
detection:
  selection1:
    RegistryKey|contains:
      - 'Software\Microsoft\Office\'
      - '\Outlook\Today\'
  selectionStamp:
    RegistryValue: 'Stamp'
    RegistryData|contains: 1
  selectionUserDefined:
    RegistryValue: 'UserDefinedUrl'
  condition: selection1 and (selectionStamp or selectionUserDefined)
fields:
  - Details
falsepositives:
  - unknown
level: high
