title: Remote Access Tool - ScreenConnect Remote Tool Execution
id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
status: experimental
description: ScreenConnect RMM has feature to remotely execute binaries on a target machine.
related:
    - id: b1f73849-6329-4069-bc8f-78a604bb8b23
      type: similar
author: Ali Alwashali
date: 2023/10/10
modified: 2023/10/10
tags:
    - attack.execution
    - attack.t1059.003
logsource:
    service: application
    product: windows
detection:
    selection_1:
        Provider_Name: 'ScreenConnect'
        EventID: 200
        Data|contains: 'Executed command of length'
    condition: selection_1
falsepositives:
    - Legitimate use of screenconnect
level: low
