title: Remote Access Tool - Remote Binary Execution
id: 5d19eb78-5b5b-4ef2-a9f0-4bfa94d58a13
status: experimental
description: ScreenConnect RMM has feature to remotely execute binaries on a target machine.
related:
    - id: b1f73849-6329-4069-bc8f-78a604bb8b23
      type: similar
author: Ali Alwashali
date: 2023/10/10
modified: 2023/10/10
tags:
    - attack.execution
    - attack.t1059.003
logsource:
    service: application
    product: windows
detection:
    selection_1:
        Provider_Name: 'ScreenConnect'
        EventID: 201
        Data|contains: 'Transferred files with action'
    condition: selection_1
falsepositives:
    - Legitimate use of screenconnect
level: low
