title: Request to phishing domain
id: 49ddf926-209d-47c6-974f-5ebec6108fcb
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
references:
    - https://virustotal.com
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        cs-host:
            - 'nabassisthelp.com' # bank phishing
            - 'rexawin.com' # online casino
            - 'merowin.com' # online casino
            - 'weartheshield.com' # indonesian scam casino
            - 'maxgetcontact.com' # impersonation of a legitimate messenger
    condition: selection
level: medium