title: Request to phishing domain
id: 49ddf926-209d-47c6-974f-5ebec6108fcb
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
references:
    - https://virustotal.com
    - https://images.google.com
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        cs-host:
            - 'nabassisthelp.com' # bank phishing
            - 'weartheshield.com' # indonesian scam casino
            - 'maxgetcontact.com' # impersonation of a legitimate messenger
            - 'payme-paypal.com' # paypal login phishing
            - 'checkout-tws.org'
            - 'onetrade.ltd'
            - 'bitnotex.com'
            - 'factura-acueducto.com.co'
            - 'messebau-stangier.top'
            - 'semfila.viapass.sbs'
            - 'spectrum-email-update.weeblysite.com'
            - 'formularioseuseguroauto.online'
            - '252329coinbase.com' # coinbase phishing

    condition: selection
level: medium
---
title: Request to scam casino domain
id: ae762c17-31b8-40a9-821d-46394525a98d
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
references:
    - https://virustotal.com
    - https://images.google.com
logsource:
    category: proxy
detection:
    selection_a:
        c-uri|contains:
            # lv88 casino chain
            - 'vi-vn'
            - '/vi-vn'

            - 'lobby'

    selection_b:
        page_title|contains:
            - "The Leading Blockchain Casino"
            - "casino"
            - "lv88"
            - "dp88"
            - "u88"
            - "uu88"
            - "lv77"
    selection_c:
        cs-method: 'GET'
        cs-host:
            # sites connected to rexawin chain
            - 'rexawin.com'
            - 'merowin.com'
            - 'rezowin156.pro'
            - 'maxspin.pro'

            # sites connected to LV88 online casino
            - 'cordalas.sa.com'
            - 'picsmashplugin.com'
            - 'ahilab.co'
            - 'vueloshorizonte.com.co'
            - 'idn88bet.com'
            - 'dolphinblower.in'
            - 'clicknce.com.co'
            - 'scooterhouse.nl'
            - 'doga-mori.info'
            - 'moreloadsdprmns.za.com'
            - 'news7today.in'
            - 'codenity.my'
            - 'dpmigwalior.in'
            - 'absenth.me'
            - 'repelis.in'
            - 'digital-circle.co'
            - 'divanis.nl'
            - 'deserene.nl'
            - 's4jobs.in'
            - 'izmirtel.com'
            - 'tstnews.net'
            - 'assistenciatecnica.me'
            - 'izom.in'
            - 'motor-andaluz.net'
            - 'monarcaclub.com.co'
            - 'lv88luck.com'
            - 'hondajakarta.me'

    condition: selection_a or selection_b or selection_c
level: medium