title: Request to phishing domain
id: 49ddf926-209d-47c6-974f-5ebec6108fcb
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
references:
    - https://virustotal.com
    - https://images.google.com
    - https://github.com/Dev2023-Op/CoastGuard-phishing-list
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        cs-host:
            - 'nabassisthelp.com' # bank phishing
            - 'weartheshield.com' # indonesian scam casino
            - 'maxgetcontact.com' # impersonation of a legitimate messenger
            - 'payme-paypal.com' # paypal login phishing
            - 'checkout-tws.org'
            - 'onetrade.ltd'
            - 'bitnotex.com'
            - 'factura-acueducto.com.co'
            - 'messebau-stangier.top'
            - 'semfila.viapass.sbs'
            - 'spectrum-email-update.weeblysite.com'
            - 'formularioseuseguroauto.online'
            - '252329coinbase.com' # coinbase phishing
            - 'liberaagora.top'
            - 'consultaexpressdomi--pamelalorzano.replit.app'
            - 'beneficiosbhdonline.iceiy.com'
            - 'sitesecure2026.wuaze.com'
            - 'zedelivery.food'
            - 'super-clientes-app.online'
            - 'concursopm.org'
            - 'workr.tech'

            # sites connected to Jayant Kumar
            - 'cloudrich777.github.io'
            - 'entregadorparceiro.vercel.app'

    condition: selection
level: medium
---
title: Request to scam casino domain
id: ae762c17-31b8-40a9-821d-46394525a98d
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
references:
    - https://virustotal.com
    - https://images.google.com
    - https://github.com/Dev2023-Op/CoastGuard-phishing-list
logsource:
    category: proxy
detection:
    selection_a:
        c-uri|contains:
            # lv88 casino chain
            - 'vi-vn'
            - '/vi-vn'

            - 'lobby'

    selection_b:
        page_title|contains:
            - "The Leading Blockchain Casino"
            - "casino"
            - "lv88"
            - "dp88"
            - "u88"
            - "uu88"
            - "TP88"
            - "lv77"
    selection_c:
        cs-method: 'GET'
        cs-host:
            # sites connected to rexawin fake crypto casino
            - 'rexawin.com'
            - 'merowin.com'
            - 'rezowin156.pro'
            - 'maxspin.pro'

            # sites connected to bets10 fake online casino
            - 'tr.bets10guncegirisler26.com'
            - 'tr.bets10anlikgirisler.com'
            - '1334bets10.com'

            # sites connected to LV88 fake online casino
            - 'cordalas.sa.com'
            - 'picsmashplugin.com'
            - 'ahilab.co'
            - 'vueloshorizonte.com.co'
            - 'idn88bet.com'
            - 'dolphinblower.in'
            - 'clicknce.com.co'
            - 'scooterhouse.nl'
            - 'doga-mori.info'
            - 'moreloadsdprmns.za.com'
            - 'news7today.in'
            - 'codenity.my'
            - 'dpmigwalior.in'
            - 'absenth.me'
            - 'repelis.in'
            - 'digital-circle.co'
            - 'divanis.nl'
            - 'deserene.nl'
            - 's4jobs.in'
            - 'izmirtel.com'
            - 'tstnews.net'
            - 'assistenciatecnica.me'
            - 'izom.in'
            - 'motor-andaluz.net'
            - 'monarcaclub.com.co'
            - 'lv88luck.com'
            - 'hondajakarta.me'
            - 'nisaya.nl'

    condition: selection_a or selection_b or selection_c
level: medium