title: Possible Phishing on blog site
id: 49ddf926-209d-47c6-974f-5ebec6108fcb
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        cs-host:
            - 'sites.google.com'
            - 'blogspot.com'
            - 'weeblysite.com'

    condition: selection
    falsepositives:
        - Legitimate blog site using theese providers
level: medium