title: CVE-2023-36884 Traffic URL Marker
id: e59f71ff-c042-4f7a-8a82-8f53beea817e
status: experimental
description: Detects unique URL marker seen being used in CVE-2023-36884
references:
    - https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
author: X__Junior
date: 2023/07/12
tags:
    - attack.command_and_control
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        c-uri|contains: '/MSHTML_C7/'
    condition: selection
falsepositives:
    - Unknown
level: high