title: CVE-2023-36884 File Extention and IP Addres pattern Traffic
id: d9365e39-febd-4a4b-8441-3ca91bb9d333
status: experimental
description: Detects file extenstions appended with ip address for comprimised system pattern seen being used in CVE-2023-36884
references:
    - https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
author: X__Junior
date: 2023/07/12
tags:
    - attack.command_and_control
logsource:
    category: proxy
detection:
    # hxxp://74.50.94[.]156/MSHTML_C7/zip_k.asp?d=99.99.99.99.
    # 104.234.239[.]26/share1/MSHTML_C7/1/99.99.99.99_a15fa_file001.htm?d=99.99.99.99_ a15fa_
    selection:
        cs-method: 'GET'
        c-uri|re: '\.(zip|asp|htm|url|xml|chm|mht|vbs|search-ms)\?d=[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}'
    condition: selection
falsepositives:
    - Unknown
level: high