title: Possible Phishing on blog site
id: 49ddf926-209d-47c6-974f-5ebec6108fcb
status: experimental
author: Owen Ross @Dev2023-Op
description: Detects suspicious web requests through proxy
refrences:
    - https://github.com/Dev2023-Op/CoastGuard-phishing-list
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        cs-host:
            - 'sites.google.com'
            - 'blogspot.com'
            - 'weeblysite.com'
            - 'wauze.com'
            - 'page.gd'
            - 'vercel.app'
            - 'github.io'

    condition: selection
    falsepositives:
        - Legitimate blog site using theese providers
        - Legitimate website using theese providers
level: medium