title: Alternate PowerShell Hosts
id: d7326048-328b-4d5e-98af-86e84b17c765
related:
    - id: 64e8e417-c19a-475a-8d19-98ea705394cc
      type: derived
status: test
description: Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe
references:
    - https://threathunterplaybook.com/hunts/windows/190815-RemoteServiceInstallation/notebook.html
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/11
modified: 2023/10/27
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_classic_start
    definition: No need to extract fields from the event
detection:
    selection:
        Data|contains: 'HostApplication='
    # Use the filter list described in 64e8e417-c19a-475a-8d19-98ea705394cc to filter FPs
    filter_ps:
        Data|contains:
            - 'HostApplication=powershell'
            - 'HostApplication=C:\WINDOWS\System32\WindowsPowerShell\v1.0\powershell.exe'
    filter_citrix:
        Data: '*Context Information:*Citrix\ConfigSync\ConfigSync.ps1*'
    condition: selection and not 1 of filter_*
falsepositives:
    - Programs using PowerShell directly without invocation of a dedicated interpreter
    - MSP Detection Searcher
    - Citrix ConfigSync.ps1
level: medium
