title: Tamper Windows Defender - PSClassic
id: ec19ebab-72dc-40e1-9728-4c0b805d722c
related:
    - id: ec19ebab-72dc-40e1-9728-4c0b805d722c
      type: similar
status: experimental
description: Attempting to disable scheduled scanning and other parts of Windows Defender ATP or set default actions to allow.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021/06/07
modified: 2023/06/05
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    product: windows
    category: ps_classic_provider_start
    definition: fields have to be extracted from the event
detection:
    selection_options_disabling_preference:
        HostApplication|contains: 'Set-MpPreference'
    selection_options_disabling_value:
        HostApplication|contains:
            - ' 1 '
            - '$true'
    selection_options_disabling_function:
        HostApplication|contains:
            - 'dbaf'
            - 'dbm'
            - 'dips'
            - 'DisableArchiveScanning'
            - 'DisableBehaviorMonitoring'
            - 'DisableBlockAtFirstSeen'
            - 'DisableIntrusionPreventionSystem'
            - 'DisableIOAVProtection'
            - 'DisableRealtimeMonitoring'
            - 'DisableRemovableDriveScanning'
            - 'DisableScanningMappedNetworkDrivesForFullScan'
            - 'DisableScanningNetworkFiles'
            - 'DisableScriptScanning'
            - 'drdsc'
            - 'drtm'
            - 'dscrptsc'
            - 'dsmndf'
            - 'dsnf'
            - 'dss'
    selection_other_default_actions_allow:
        HostApplication|contains|all:
            - 'Set-MpPreference'
            - 'Allow'
        HostApplication|contains:
            - 'LowThreatDefaultAction'
            - 'ModerateThreatDefaultAction'
            - 'HighThreatDefaultAction'
    selection_other_use_of_alias:
        HostApplication|contains:
            - 'ltdefac '
            - 'mtdefac '
            - 'htdefac '
            - 'stdefac '
    condition: all of selection_options_disabling_* or 1 of selection_other_*
falsepositives:
    - Unknown
level: high
