title: Renamed Powershell Under Powershell Channel
id: 30a8cb77-8eb3-4cfb-8e79-ad457c5a4592
status: test
description: Detects renamed powershell
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
author: Harish Segar, frack113
date: 2020/06/29
modified: 2023/10/27
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_classic_start
    definition: No need to extract fields from the event
detection:
    selection:
        Data|contains: 'HostName=ConsoleHost'
    filter:
        Data|contains:
            - 'HostApplication=powershell.exe'
            - 'HostApplication=C:\WINDOWS\System32\WindowsPowerShell\v1.0\powershell.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: low
