title: Netcat The Powershell Version
id: c5b20776-639a-49bf-94c7-84f912b91c15
related:
   - id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
     type: derived
status: experimental
author: frack113
date: 2021/07/21
modified: 2021/09/07
description: Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network
references:
    - https://nmap.org/ncat/
    - https://github.com/besimorhino/powercat
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
tags:
    - attack.command_and_control
    - attack.t1095
logsource:
    product: windows
    service: powershell-classic
    definition: fields have to be extract from event
detection:
    selection:
        EventID: 400
        HostApplication|contains:
            - 'powercat '
            - 'powercat.ps1'
    condition: selection 
falsepositives:
    - Unknown
level: medium