title: Okta Session Impersonation Grant
id: fe04b26b-0ac4-45d7-9404-4b9f16a440a9
status: test
description: |
    Detects events in Okta where there is the eventType of "user.session.impersonation.grant".
    This grants access in the context of the user. This could be high privilege admin access.
references:
    - https://developer.okta.com/docs/reference/system-log-query/
    - https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
    - https://support.okta.com/help/s/article/What-is-the-systemoktacom-Account-in-Syslog-Used-For
    - https://attack.mitre.org/techniques/T1484/002/
author: zendannyy
date: 2025-12-24
tags:
    - attack.privilege_escalation
logsource:
    service: okta
    product: okta
detection:
    selection:
        debugContext.debugData.requestUri|contains: 'admin'
        eventType: 'user.session.impersonation.grant'
    filter:
        alternateId|contains:
            - 'system@okta.com'
            - '@company_domain.com'
    condition: selection and not filter
falsepositives:
    - The only legitimate use case here is an Okta support engineer actively working with an internal Okta Admin.
    - This access is temporary and should be revoked once done with the support case.
    - Apply additional filters if necessary
level: medium
