title: Delete SES Identity
id: 20f754db-d025-4a8f-9d74-e0037e999a9a
status: experimental
description: Identifies a SES identity is deleted. This may be an indicator of an adversary removing the account that carried out suspicious or malicious activities
references:
    - https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/
author: Janantha Marasinghe
date: 2022/12/13
tags:
    - attack.defense_evasion
    - attack.t1070
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: cloudtrail
        eventName: ses.amazonaws.com
            - delete-identity
    condition: selection
falsepositives:
    - Unknown
level: medium