title: AWS Identity Center Identity Provider Change
id: d3adb3ef-b7e7-4003-9092-1924c797db35
status: experimental
description: |
  Detects a change in the AWS Identity Center (FKA AWS SSO) identity provider.
  A change in identity provider allows an attacker to establish persistent access or escalate privileges via user impersonation.
references:
    - 'https://docs.aws.amazon.com/singlesignon/latest/userguide/app-enablement.html'
author: 'Michael McIntyre @wtfender'
date: 2023/09/27
tags:
    - attack.persistence
    - attack.t1556
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 
            - 'sso.amazonaws.com'
            - 'sso-directory.amazonaws.com'
        eventName:      
            - 'AssociateDirectory'
            - 'DisassociateDirectory'
            - 'EnableExternalIdPConfigurationForDirectory'
            - 'DisableExternalIdPConfigurationForDirectory'
    condition: selection
falsepositives:
    - Authorized changes to the AWS account's identity provider
level: high
