title: AWS IAM S3Browser User or AccessKey Creation
id: db014773-d9d9-4792-91e5-133337c0ffee
status: experimental
description: Detects S3 Browser utility creating IAM User or AccessKey.
references:
    - https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
author: daniel.bohannon@permiso.io (@danielhbohannon)
date: 2023/05/17
modified: 2023/05/17
tags:
    - attack.execution
    - attack.t1059.009
    - attack.persistence
    - attack.t1078.004
logsource:
    product: aws
    service: cloudtrail
detection:
    selection_source:
        eventSource: iam.amazonaws.com
        eventName:
            - CreateUser
            - CreateAccessKey
    filter_tooling:
        userAgent|contains: 'S3 Browser'
    condition: selection_source and filter_tooling
falsepositives:
    - Valid usage of S3 Browser for IAM User and/or AccessKey creation
level: high
