title: Added Rule in Windows Firewall with Advanced Security
id: cde0a575-7d3d-4a49-9817-b8004a7bf105
status: experimental
description: A rule has been modified in the Windows Firewall exception list
author: frack113
date: 2022/02/19
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
logsource:
    product: windows
    service: firewall-as
# EventID 49xx and 50xx are not used in the rule, please don't use Windows Server 2008 R2
detection:
    selection:
        EventID: 2004
    block:
        Action: 2
    condition: selection and not block
level: high
