title: All Rules Have Been Deleted From The Windows Firewall Configuration
id: 79609c82-a488-426e-abcf-9f341a39365d
status: experimental
description: Detects when a all the rules have been deleted from the Windows Defender Firewall configuration
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
author: frack113, Nasreddine Bencherchali
date: 2023/01/17
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID: 2033 # All rules have been deleted from the Windows Defender Firewall configuration on this computer
    condition: selection
level: high
