title: Modified Rule in Windows Firewall with Advanced Security
id: 5570c4d9-8fdd-4622-965b-403a5a101aa0
status: experimental
description: A rule has been modified in the Windows Firewall exception list
author: frack113
date: 2022/02/19
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
logsource:
    product: windows
    service: firewall-as
# EventID 49xx and 50xx are not used in the rule, please don't use Windows Server 2008 R2
detection:
    selection:
        EventID: 2005
    filter:
        ModifyingApplication|startswith:
            - 'C:\Program Files (x86)\'
            - 'C:\Program Files\'
    condition: selection and not 1 of filter*
level: low
