title: New Firewall Exception Rule Added For A Suspicious Folder
id: 9e2575e7-2cb9-4da1-adc8-ed94221dca5e
related:
    - id: cde0a575-7d3d-4a49-9817-b8004a7bf105
      type: derived
status: experimental
description: Detects the addition of a rule to the Windows Firewall exception list where the application resides in a suspicious folder
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
    - https://app.any.run/tasks/7123e948-c91e-49e0-a813-00e8d72ab393/#
author: frack113
date: 2023/02/26
modified: 2023/05/30
tags:
    - attack.defense_evasion
    - attack.t1562.004
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID:
            - 2004 # A rule has been added to the Windows Defender Firewall exception list. (Windows 10)
            - 2071 # A rule has been added to the Windows Defender Firewall exception list. (Windows 11)
        ApplicationPath|contains:
            - '\AppData\'
            - '\Temp\'
    filter_main_block:
        Action: 2
    filter_optional_teams:
        ApplicationPath|endswith: '\AppData\local\microsoft\teams\current\teams.exe'
    filter_optional_keybase:
        ApplicationPath|endswith: '\AppData\Local\Keybase\keybase.exe'
    filter_optional_messenger:
        ApplicationPath|endswith: '\AppData\Local\Programs\Messenger\Messenger.exe'
    filter_optional_opera:
        ApplicationPath|startswith: 'C:\Users\'
        ApplicationPath|contains: '\AppData\Local\Programs\Opera\'
        ApplicationPath|endswith: '\opera.exe'
    condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
    - Any legitimate application that runs from the AppData user directory
level: high
