title: Added Rule in Windows Firewall with Advanced Security
id: cde0a575-7d3d-4a49-9817-b8004a7bf105
status: experimental
description: A rule has been modified in the Windows Firewall exception list
author: frack113
date: 2022/02/19
modified: 2022/04/07
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
logsource:
    product: windows
    service: firewall-as
# EventID 49xx and 50xx are not used in the rule, please don't use Windows Server 2008 R2
detection:
    selection:
        EventID: 2004
    filter_block:
        Action: 2
    filter_installations:
        - ApplicationPath|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
        - ModifyingApplication: 'C:\Windows\System32\oobe\Setup.exe'
        - ModifyingApplication|startswith: 'C:\Windows\WinSxS\'  # TiWorker.exe
        - ModifyingApplication:
            - 'C:\Windows\SysWOW64\msiexec.exe'
            - 'C:\Windows\System32\svchost.exe'
            - 'C:\Windows\System32\dllhost.exe'
            - 'C:\Program Files\Windows Defender\MsMpEng.exe'
    condition: selection and not 1 of filter_*
level: medium
