title: Delete Rule in Windows Firewall with Advanced Security
id: c187c075-bb3e-4c62-b4fa-beae0ffc211f
status: experimental
description: A rule has been deleted in the Windows Firewall exception list.
author: frack113
date: 2022/02/19
modified: 2022/02/22
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
logsource:
    product: windows
    service: firewall-as
# EventID 49xx and 50xx are not used in the rule, please don't use Windows Server 2008 R2
detection:
    selection:
        EventID:
            - 2006
            - 2033 #All rules
    filter:
        - ModifyingApplication: 'C:\Windows\System32\svchost.exe'
        - ModifyingApplication|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
    condition: selection and not filter
level: medium
