title: Add New Windows Firewall Rule via WmiPrvSE
id: eca81e8d-09e1-4d04-8614-c91f44fd0519
status: experimental
description: Detects when a rule has been added to the Windows Firewall by WmiPrvSE
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md#atomic-test-24---set-a-firewall-rule-using-new-netfirewallrule
    - https://malware.news/t/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/72170
    - https://cybersecuritynews.com/rhysida-ransomware-attacking-windows/
author: frack113
date: 2024/05/03
tags:
    - attack.defense_evasion
    - attack.t1562.004
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID: 2097
        Action: 3
        ModifyingApplication: 'C:\Windows\System32\wbem\WmiPrvSE.exe'
    condition: selection
falsepositives:
    - Administrator script
level: medium
