title: Firewall Rule Modified In The Windows Firewall Exception List
id: 5570c4d9-8fdd-4622-965b-403a5a101aa0
status: experimental
description: Detects when a rule has been modified in the windows firewall exception list
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
author: frack113
date: 2022/02/19
modified: 2023/01/17
logsource:
    product: windows
    service: firewall-as
detection:
    selection:
        EventID: 2005 # A rule has been modified in the Windows Defender Firewall exception list
    filter_generic:
        ModifyingApplication|startswith:
            - 'C:\Program Files (x86)\'
            - 'C:\Program Files\'
    condition: selection and not 1 of filter_*
level: low
