title: Suspicious Security Scheduled Tasks Deleted
id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
related:
    - id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
      type: similar
    - id: 9ac94dc8-9042-493c-ba45-3b5e7c86b980
      type: similar
    - id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
      type: similar
status: experimental
description: Detects the deletion of Security Scheduled Tasks
author: frack113
date: 2023/01/13
tags:
    - attack.impact
    - attack.t1489
logsource:
    product: windows
    service: taskscheduler
    definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is disabled by default and needs to be enabled in order for this detection to trigger'
detection:
    selection:
        EventID: 141
        TaskName|contains:
            - '\Windows\SystemRestore\SR'
            - '\Windows\Windows Defender\'
            - '\Windows\BitLocker'
            - '\Windows\WindowsBackup\'
            - '\Windows\WindowsUpdate\'
            - '\Windows\UpdateOrchestrator\'
            - '\Windows\ExploitGuard'
    filter:
        UserName|contains:
            - 'AUTHORI'
            - 'AUTORI'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
