title: Suspicious Scheduled Tasks Locations
id: 424273ea-7cf8-43a6-b712-375f925e481f
status: experimental
description: Detects the execution of Scheduled Tasks where the Program being run is located in a suspicious location or it's an unusale program to be run from a Scheduled Task
author: Nasreddine Bencherchali
date: 2022/12/05
tags:
    - attack.persistence
    - attack.t1053.005
logsource:
    product: windows
    service: taskscheduler
    definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is disabled by default and needs to be enabled in order for this detection to trigger'
detection:
    selection:
        EventID: 129 # Created Task Process
        Path|contains:
            - 'C:\Windows\Temp\'
            - '\AppData\Local\Temp\'
            - '\Desktop\'
            - '\Downloads\'
            - '\Users\Public\'
            - 'C:\Temp\'
            # Add more suspicious LOLBINs below
            - 'C:\Windows\System32\calc.exe'
            - 'C:\Windows\System32\regsvr32.exe'
            - 'C:\Windows\System32\rundll32.exe'
    # If you experience FP. Uncomment the filter below and add the specific TaskName with the Program to it
    #filter:
    #    TaskName: '\Exact\Task\Name'
    #    Path: 'Exact\Path'
    condition: selection
falsepositives:
    - Unknown
level: medium
