title: VMMap Signed Dbghelp.DLL Potential Sideloading
id: 98ffaed4-aec2-4e04-9b07-31492fe68b3d
status: test
description: Detects potential DLL sideloading of a signed dbghelp.dll by the Sysinternals VMMap.
references:
    - https://techcommunity.microsoft.com/t5/sysinternals-blog/zoomit-v7-1-procdump-2-0-for-linux-process-explorer-v17-05/ba-p/3884766
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-05
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|contains: 'C:\Debuggers\dbghelp.dll'
        Image|endswith:
            - '\vmmap.exe'
            - '\vmmap64.exe'
        Signed: 'true'
    condition: selection
falsepositives:
    - Unknown
level: medium
