title: CPL File Loaded From Non Default Location
id: bb34b9c1-f71e-481f-8569-158ac9bfeece
status: experimental
description: Detects CPL File loaded by fondue.exe and hdwwiz.exe from non-default locations.
references:
    - https://www.hexacorn.com/blog/2024/01/06/1-little-known-secret-of-fondue-exe/
    - https://www.hexacorn.com/blog/2024/01/01/1-little-known-secret-of-hdwwiz-exe/
author: Anish Bogati
date: 2024/01/07
modified:
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    product: windows
    category: image_load
detection:
    selection_1:
        Image|endswith: '\fondue.exe'
        ImageLoaded|endswith: 'appwiz.cpl'
    selection_2:
        Image|endswith: '\hdwwiz.exe'
        ImageLoaded|endswith: 'hdwwiz.cpl'
    filter:
        Image|startswith: 
            - ':\Windows\System32\'
            - ':\Windows\SysWOW64\'
        ImageLoaded|contains:
            - ':\Windows\System32\'
            - ':\Windows\SysWOW64\'
        ImageLoaded|endswith: '.cpl'
    condition: 1 of selection_* and not filter
falsepositives:
    - Unknown
level: high
