title: Image Load of VSS_PS.dll by Uncommon Executable
id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
status: experimental
description: Detects the image load of vss_ps.dll by uncommon executables
references:
    - https://www.virustotal.com/gui/file/ba88ca45589fae0139a40ca27738a8fc2dfbe1be5a64a9558f4e0f52b35c5add
    - https://twitter.com/am0nsec/status/1412232114980982787
author: Markus Neis, @markus_neis
date: 2021/07/07
modified: 2022/10/31
tags:
    - attack.defense_evasion
    - attack.impact
    - attack.t1490
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: '\vss_ps.dll'
    filter_legit:
        Image|endswith:
            - '\svchost.exe'
            - '\msiexec.exe'
            - '\vssvc.exe'
            - '\srtasks.exe'
            - '\tiworker.exe'
            - '\dllhost.exe'
            - '\searchindexer.exe'
            - '\dismhost.exe'
            - '\taskhostw.exe'
            - '\clussvc.exe'
            - '\thor64.exe'
            - '\thor.exe'
            - '\rundll32.exe'
            - '\inetsrv\iissetup.exe'
            - '\inetsrv\appcmd.exe'
            - '\WmiPrvSE.exe'
        Image|startswith: 'C:\Windows\'
    filter_programfiles:
        Image|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
    filter_update:
        CommandLine|startswith: 'C:\$WinREAgent\Scratch\'
        CommandLine|contains: '\dismhost.exe {'
    condition: selection and not 1 of filter_*
falsepositives:
    - Unknown
level: high
