title: Potential DLL Sideloading Via comctl32.dll
id: 6360757a-d460-456c-8b13-74cf0e60cceb
status: experimental
description: Detects potential DLL sideloading using comctl32.dll via "wermgr.exe" to obtain system privileges
references:
    - https://github.com/binderlabs/DirCreate2System
author: Nasreddine Bencherchali
date: 2022/12/16
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1574.001
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|startswith: 'C:\windows\system32\wermgr.exe.local\'
        ImageLoaded|endswith: '\comctl32.dll'
    condition: selection
falsepositives:
    - Unlikely
level: high
