title: Suspicious WSMAN Provider Image Loads
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
description: Detects signs of potential use of the WSMAN provider from uncommon processes locally and remote execution.
status: experimental
date: 2020/06/24
modified: 2021/12/16
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1059.001
    - attack.lateral_movement
    - attack.t1021.003
references:
    - https://twitter.com/chadtilbury/status/1275851297770610688
    - https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
    - https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture
    - https://github.com/bohops/WSMan-WinRM
logsource:
    category: image_load
    product: windows
detection:
    request_client:
        - ImageLoaded|endswith:
            - '\WsmSvc.dll'
            - '\WsmAuto.dll'
            - '\Microsoft.WSMan.Management.ni.dll'
        - OriginalFileName:
            - WsmSvc.dll
            - WSMANAUTOMATION.DLL
            - Microsoft.WSMan.Management.dll
    respond_server:
        Image|endswith: '\svchost.exe'
        OriginalFileName: 'WsmWmiPl.dll'
    filter_general:
        Image|endswith: 
            - '\powershell.exe'
            - 'C:\Windows\System32\sdiagnhost.exe'
    filter_svchost: # not available in Sysmon data, but Aurora logs
        CommandLine|contains: 
            - 'svchost.exe -k netsvcs -p -s BITS'
            - 'svchost.exe -k GraphicsPerfSvcGroup -s GraphicsPerfSvc'
            - 'svchost.exe -k NetworkService -p -s Wecsvc'
    filter_mscorsvw: #Image: C:\Windows\Microsoft.NET\Framework64\v4.0.30319\mscorsvw.exe
        Image|startswith: 
            - C:\Windows\Microsoft.NET\Framework64\v
            - C:\Windows\Microsoft.NET\Framework\v
        Image|endswith: \mscorsvw.exe
    filter_svr_2019:
        Image: 
            - 'C:\Windows\System32\Configure-SMRemoting.exe'
            - 'C:\Windows\System32\ServerManager.exe'
    condition: ( request_client or respond_server ) and not 1 of filter*
falsepositives:
    - Unknown
level: medium
