title: SCM DLL Sideload
id: 70e8e9b4-6a93-4cb7-8cde-da69502e7aff
status: experimental
description: Detects DLL sideloading of DLLs that are loaded by the SCM for some services (IKE, IKEEXT, SessionEnv) which do not exists on a typical modern system
references:
    - https://decoded.avast.io/martinchlumecky/png-steganography/
author: Nasreddine Bencherchali
date: 2022/12/01
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1574.001
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|contains:
            - '\VMware\VMware Tools\vmStatsProvider\win32'
            - '\vmGuestLib.dll'
        Image|endswith: '\Windows\System32\wbem\WmiApSrv.exe'
    filter:
        Signed: 'true'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
