title: Potential DLL Sideloading Of Iernonce.DLL
id: f53714ec-5077-420e-ad20-907ff9bb2958
status: experimental
description: Detects potential DLL sideloading of "iernonce.dll"
references:
    - https://www.hexacorn.com/blog/2023/12/26/1-little-known-secret-of-runonce-exe-32-bit/
author: Anish Bogati
date: 2024/01/04
tags:
    - attack.defense_evasion
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: '\iernonce.dll'
    filter_main_legit_locations:
        ImageLoaded|contains:
            - ':\Windows\System32\'
            - ':\Windows\SysWOW64\'
            - ':\Windows\WinSxS\'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: medium
