title: Suspicious Load of Advapi31.dll
id: d813d662-785b-42ca-8b4a-f7457d78d5a9
status: experimental
description: Use Advapi31.dll from a uncommun folder
author: frack113
references:
  - https://github.com/hlldz/Phant0m
date: 2022/02/03
logsource:
  product: windows
  category: image_load
detection:
  selection:
    ImageLoaded|endswith: '\advapi32.dll'
  filter_commun:
    Image|startswith:
        - 'C:\Windows\'
        - 'C:\Program Files (x86)\'
        - 'C:\Program Files\'
  filter_defender:
    Image|startswith: 'C:\ProgramData\Microsoft\Windows Defender\platform\'
    Image|endswith: '\MpCmdRun.exe'
  condition: selection and not 1 of filter_*
falsepositives:
  - unknown
level: critical
tags:
  - attack.defense_evasion
  - attack.t1070
