title:  Renamed or Portable Vmnat.exe
id: 7c92840f-3d4e-4cd7-ae44-e321e9281ab1
status: experimental
description: Detects renamed vmnat.exe or portable version that can be use for DLL side-loading
author: elhoim
date: 2022/09/09
references:
    - https://twitter.com/malmoeb/status/1525901219247845376
tags:
    - attack.defense_evasion
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Product: 'Vmware Workstation'
        filter_rename:
            Image|endswith: 'vmnat.exe'
        filter_portable:
            Image:
                - 'C:\Program Files (x86)\VMware\VMware Workstation\vmnat.exe'
                - 'C:\Windows\SysWOW64\vmnat.exe'
        # TODO check @work if need to add System32 too (and/pr others)
    condition: selection and not 1 of filter_*
falsepositives:
     - VMware workstation installed in another path
level: critical
