title: Possible DLL Hijacking of dbgmodel.dll
id: 1149381b-2811-48a3-1599-5b9ff8991076
status: experimental
description: Detects possible DLL hijacking of dbgmodel.dll by looking for suspicious image loads, loading this DLL from unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/dbgmodel.html
author: "Gary Lobermier"
date: 2023-05-22
tags:
    - attack.defense_evasion
    - attack.T1574.002
logsource:
    product: windows
    category: image_load
detection:
    selection:
        ImageLoaded|endswith: '\dbgmodel.dll'
    filter:
        ImageLoaded|startswith:
            - 'c:\windows\system32\'
            - 'c:\windows\syswow64\'
            - 'c:\program files\Windows Kits\'
            - 'c:\program files (x86)\Windows Kits\'

    condition: selection and not filter
falsepositives:
    - Unknown
