title: Lolbin Coregen.exe DLL Sideload
id: 0fa66f66-e3f6-4a9c-93f8-4f2610b00171
status: experimental
description: |
  Detect DLL sideload Binary coregen.exe (Microsoft CoreCLR Native Image Generator).
  Coregen is signed by Microsoft and bundled with Microsoft Silverligh
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Coregen/
author: frack113
date: 2022/12/31
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.t1055
logsource:
    category: image_load
    product: windows
detection:
    selection_dll:
        Image|endswith: '\coregen.exe'
    filter_legit:
        ImageLoaded|startswith: 
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
    condition: selection_dll and not filter_legit
falsepositives:
    - Unknown
level: medium
