title: Potential RjvPlatform.DLL Sideloading
id: 259dda31-b7a3-444f-b7d8-17f96e8a7d0d
status: experimental
description: Detects potential DLL sideloading of "RjvPlatform.dll"
references:
    - https://twitter.com/0gtweet/status/1666716511988330499
author: X__Junior (Nextron Systems)
date: 2023/06/09
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1574.001
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded: 'C:\$SysReset\Framework\Stack\RjvPlatform.dll'
        Image: 'C:\Windows\System32\SystemResetPlatform\SystemResetPlatform.exe'
    condition: selection
falsepositives:
    - Unlikely
level: medium