title: Potential Wazuh Security Platform DLL Sideloading
id: db77ce78-7e28-4188-9337-cf30e2b3ba9f
status: experimental
description: Detects potential DLL sideloading of DLLs that are part of the Wazuh security platform
references:
    - https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
author: X__Junior
date: 2023/03/13
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1574.001
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith:
            - '\libwazuhshared.dll'
            - '\libwinpthread-1.dll'
    filter:
        ImageLoaded|startswith:
            - 'C:\Program Files (x86)\ossec-agent\'
            - 'C:\Program Files\Inkscape\bin\'
            - 'C:\Program Files (x86)\Pidgin\'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
