title: Vulnerable GIGABYTE Driver Load
id: 7bcfeece-e5ed-4ff3-a5fb-2640d8cc8647
status: experimental
description: Detects the loading of a signed and vulnerable GIGABYTE driver often used by threat actors or malware for privilege escalation
author: Florian Roth
references:
    - https://medium.com/@fsx30/weaponizing-vulnerable-driver-for-privilege-escalation-gigabyte-edition-e73ee523598b
    - https://twitter.com/malmoeb/status/1551449425842786306
    - https://github.com/fengjixuchui/gdrv-loader
date: 2022/07/25
logsource:
    product: windows
    category: image_load
detection:
    selection_sysmon:
        Hashes|contains: 
            - 'MD5=9AB9F3B75A2EB87FAFB1B7361BE9DFB3'
            - 'SHA1=FE10018AF723986DB50701C8532DF5ED98B17C39'
            - 'SHA256=31F4CFB4C71DA44120752721103A16512444C13C2AC2D857A7E6F13CB679B427'
    selection_other:
        - MD5: '9ab9f3b75a2eb87fafb1b7361be9dfb3'
        - SHA1: 'fe10018af723986db50701c8532df5ed98b17c39'
        - SHA256: '31f4cfb4c71da44120752721103a16512444c13c2ac2d857a7e6f13cb679b427'
    condition: 1 of selection*
falsepositives:
    - Unknown
level: high
tags:
    - attack.privilege_escalation
    - attack.t1543.003
