title: Suspicious unsigned DLL Loaded by RunDLL32/RegSvr32
id: b5de0c9a-6f19-43e0-af4e-55ad01f550af
status: experimental
description: Detects RunDLL32/RegSvr32 loading a suspicious unsigned/untrusted dlls. Adversaries often abuse those
programs to proxy execution of malicious code.
references:
    - https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion
    - https://akhere.hashnode.dev/hunting-unsigned-dlls-using-kql
    - https://unit42.paloaltonetworks.com/unsigned-dlls/?web_view=true
author: Swachchhanda Shrawan Poudel
date: 2024/01/16
tags:
    - attack.t1218.011
    - attack.t1218.010
    - attack.defense_evasion
logsource:
    product: windows
    category: image_load
detection:
    selection:
        Image|endswith:
            - '\rundll32.exe'
            - '\regsvr32.exe'
    filter:
        - Signed: 'true'
        - SignatureStatus:
            - 'trusted'
            - 'errorExpired'
            - 'errorCode_endpoint'
            - 'errorChaining'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
