title: DLL Sideloading Of DBGCORE.DLL
id: 9ca2bf31-0570-44d8-a543-534c47c33ed7
status: experimental
description: Detects DLL sideloading of "dbgcore.dll"
references:
    - https://hijacklibs.net/ # For list of DLLs that could be sideloaded (search for dlls mentioned here in there)
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/10/25
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1574.001
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: '\dbgcore.dll'
    filter_generic:
        ImageLoaded|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
            - 'C:\Windows\WinSxS\'
            - 'C:\Windows\SoftwareDistribution\'
            - 'C:\Windows\SystemTemp\'
    filter_visual_studio:
        ImageLoaded|startswith:
            - 'C:\Program Files (x86)\Microsoft Visual Studio\'
            - 'C:\Program Files\Microsoft Visual Studio\'
    filter_windows_kits:
        ImageLoaded|startswith: 'C:\Program Files (x86)\Windows Kits\10\Debuggers\'
    filter_windbg:
        ImageLoaded|startswith: 'C:\Program Files\WindowsApps\Microsoft.WinDbg_'
    filter_steam:
        ImageLoaded|endswith: '\Steam\bin\cef\cef.win7x64\dbgcore.dll'
    filter_dell:
        ImageLoaded: 'C:\Program Files\Dell\DTP\InstrumentationSubAgent\dbgcore.dll'
    filter_office:
        ImageLoaded|startswith:
            - 'C:\Program Files\Microsoft Office\Office'
            - 'C:\Program Files\Microsoft Office\Root\Office'
            - 'C:\Program Files (x86)\Microsoft Office\Office'
            - 'C:\Program Files (x86)\Microsoft Office\Root\Office'
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate applications loading their own versions of the DLL mentioned in this rule
level: medium
