title: Phantom DLL Hijacking via MSDTC Service
id: a3a8042a-5a91-46c0-ba14-c36c77ff529c
status: experimental
description: |
    Detects phantom DLL hijacking technique where non-existent DLL 'oci.dll' is loaded by 'msdtc.exe' service.
    Threat actors may place a malicious 'oci.dll' in a location where 'msdtc.exe' looks for it, leading to execution of the malicious DLL with elevated privileges of the MSDTC service.
author: Swachchhanda Shrawan Poudel (Nextron Systems)
references:
    - https://securelist.com/passiveneuron-campaign-with-apt-implants-and-cobalt-strike/117745/
    - https://www.crowdstrike.com/en-us/blog/4-ways-adversaries-hijack-dlls/
date: 2025-11-10
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1574.001
logsource:
    product: windows
    category: image_load
detection:
    selection:
        Image: 'C:\Windows\System32\msdtc.exe'
        ImageLoaded: 'C:\Windows\System32\oci.dll'
    condition: selection
falsepositives:
    - Unlikely
level: high
