title: DLL Sideloading Of DBGHELP.DLL
id: 9ca2bf31-0570-44d8-a543-534c47c33ed7
status: experimental
description: Detects DLL sideloading of "dbghelp.dll"
references:
    - https://hijacklibs.net/ # For list of DLLs that could be sideloaded (search for dlls mentioned here in there)
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/10/25
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1574.001
    - attack.t1574.002
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|endswith: '\dbghelp.dll'
    filter_generic:
        ImageLoaded:
            - 'C:\Program Files (x86)\Microsoft Analysis Services\AS OLEDB\110\dbghelp.dll'
            - 'C:\Program Files\Microsoft Analysis Services\AS OLEDB\110\dbghelp.dll'
            - 'C:\Program Files\Common Files\microsoft shared\DW\DBGHELP.DLL'
            - 'C:\Program Files\Dell\DTP\InstrumentationSubAgent\dbghelp.dll'
            - 'C:\Program Files\DTrace\dbghelp.dll'
        ImageLoaded|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
            - 'C:\Windows\WinSxS\'
            - 'C:\Windows\SoftwareDistribution\'
            - 'C:\Windows\SystemTemp\'
            - 'C:\Program Files (x86)\Microsoft Visual Studio\'
            - 'C:\Program Files\Microsoft Visual Studio\'
            - 'C:\Program Files (x86)\Windows Kits\10\'
            - 'C:\Program Files\dotnet\sdk\'
            - 'C:\Program Files\Microsoft Office\Office'
            - 'C:\Program Files\Microsoft Office\Root\Office'
            - 'C:\Program Files\WindowsApps\Microsoft.WinDbg_'
        ImageLoaded|endswith:
            - '\Epic Games\Launcher\Engine\Binaries\ThirdParty\DbgHelp\dbghelp.dll'
            - '\Epic Games\MagicLegends\x86\dbghelp.dll'
            - '\Anaconda3\Lib\site-packages\vtrace\platforms\windll\amd64\dbghelp.dll'
            - '\Anaconda3\Lib\site-packages\vtrace\platforms\windll\i386\dbghelp.dll'
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate applications loading their own versions of the DLL mentioned in this rule
level: medium
