title: Python Py2Exe Image Load
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
status: experimental
description: Detects the image load of Python Core indicative of a Python script bundled with Py2Exe.
references:
    - https://www.py2exe.org/
    - https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
author: Patrick St. John, OTR (Open Threat Research)
date: 2020/05/03
modified: 2022/11/08
tags:
    - attack.defense_evasion
    - attack.t1027.002
logsource:
    product: windows
    category: image_load
detection:
    selection:
        Description: 'Python Core'
    filter_generic:
        - Image|contains: 'Python'  # FPs with python38.dll, python.exe etc.
        - Image|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
            - 'C:\ProgramData\Anaconda3\' # Comment out if you don't use Anaconda in your environment
    filter_aurora:
        Image: null
    condition: selection and not 1 of filter_*
fields:
    - Description
falsepositives:
    - Legitimate Py2Exe Binaries
    - Known false positive caused with Python Anaconda
level: medium
