title: CLR DLL Loaded Via scripting applications
id: 4508a70e-97ef-4300-b62b-ff27992990ea
status: experimental
description: Detects CLR DLL being loaded by an scripting applications
references:
    - https://github.com/tyranid/DotNetToJScript
    - https://thewover.github.io/Introducing-Donut/
author: omkar72
date: 2020/10/10
tags:
    - attack.execution
    - attack.privelege_escalation
    - attack.t1055
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image:
            - '*\wscript.exe'
            - '*\cscript.exe'
            - '*\mshta.exe'
        ImageLoaded:
            - '*\clr.dll'
            - '*\mscoree.dll'
    condition: selection
falsepositives:
    - unknown
level: high
