title: Sysmon Process Hollowing Detection
id: c4b890e5-8d8c-4496-8c66-c805753817cd
status: experimental
description: Detects when a memory process image does not match the disk image, indicative of process hollowing.
author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2022/01/25
tags:
    - attack.process_injection
    - attack.t1055.012
logsource:
    category: process_tampering
    product: windows
detection:
    selection:
        Type: Image is replaced
    condition: selection 
falsepositives:
    - There are no known false positives at this time.
level: high
