title: Cisco Collect Data
id: cd072b25-a418-4f98-8ebc-5093fb38fe1a
status: experimental
description: Collect pertinent data from the configuration files
references:
    - https://attack.mitre.org/techniques/T1087/
    - https://attack.mitre.org/techniques/T1003/
    - https://attack.mitre.org/techniques/T1081/
    - https://attack.mitre.org/techniques/T1005/
author: Austin Clark
date: 2019/08/11
tags:
    - attack.discovery
    - attack.credential_access
    - attack.collection
    - attack.t1087
    - attack.t1003
    - attack.t1081
    - attack.t1005
    - attack.t1552.001
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - src
    - CmdSet
    - User
    - Privilege_Level
    - Remote_Address
detection:
    keywords:
        - 'show running-config'
        - 'show startup-config'
        - 'show archive config'
        - 'more'
    condition: keywords
falsepositives:
    - Commonly run by administrators.
level: low
