title: Cisco ASA LINE RUNNER webcontent Hash File 1515480F4B538B669648B17C02337098
id: 3c8d4d70-7007-afd7-09bc-rayv1pr0007
status: experimental
description: |
    Detects the LINE RUNNER (2024 ArcaneDoor) specific webcontent filename
    1515480F4B538B669648B17C02337098 disclosed by Cisco Talos. Located at
    disk0:/csco_config/97/webcontent/ on compromised ASA devices. Unique
    artifact that should never appear on a clean device.
references:
    - https://blog.talosintelligence.com/arcanedoor-new-espionage-focused-campaign-found-targeting-perimeter-network-devices/
author: defender-pack-arcanedoor (CC0)
date: 2026-05-19
tags:
    - attack.persistence
    - attack.t1542.003
logsource:
    product: cisco
    service: aaa
detection:
    keywords:
        - '1515480F4B538B669648B17C02337098'
    condition: keywords
falsepositives:
    - None. Unique artifact filename.
level: critical
