title: Cisco Show Commands Input
id: 71d65515-c436-43c0-841b-236b1f32c21e
status: experimental
description: See what files are being deleted from flash file systems
references:
  - https://attack.mitre.org/beta/techniques/T1551/004/
  - https://attack.mitre.org/beta/techniques/T1561/002/
  - https://attack.mitre.org/beta/techniques/T1561/001/
author: Austin Clark
date: 2019/08/12
tags:
  - attack.defense_evasion
  - attack.impact
  - attack.t1551.004
  - attack.t1561.002
  - attack.t1561.001
logsource:
  product: cisco
  service: aaa
  category: accounting
fields:
  - CmdSet
detection:
  keywords:
    - erase
    - delete
    - format
  condition: keywords
falsepositives:
  - Will be used sometimes by admins to clean up local flash space.
level: medium
