title: Exploitation Indicators Of CVE-2022-42475
id: 739588ec-a0a6-4851-b3f9-b24c610950b0
status: experimental
description: Detecting a heap-based buffer overflow vulnerability [CWE-122] in FortiOS
SSL-VPN.
references:
    - https://www.fortiguard.com/psirt/FG-IR-22-398
    - https://www.bleepingcomputer.com/news/security/fortinet-says-ssl-vpn-pre-auth-rce-bug-is-exploited-in-attacks/
    - https://nvd.nist.gov/vuln/detail/CVE-2022-42475
    - https://community.fortinet.com/t5/FortiGate/Technical-Tip-Critical-vulnerability-Protect-against-heap-based/ta-p/239420
author: Douglasasrose75 
date: 2024/02/07
tags:
    - attack.initial_access
    - detection.emerging_threats
logsource:
    product: FortiOS
    service: syslog
   
detection:
    keyword_event:
        - 'Logdesc="Application crashed" and msg="[...] application: sslvpnd,[...], Signal 11 received, Backtrace: [...]“'

    keyword_file:
        - 'libips.bak'
        - 'libgif.so'
        - 'libiptcp.so'
        - 'libipudp.so'
        - 'libjepg.so'
        - '.sslvpnconfigbk'
        - 'wxd.conf'

    condition: keyword_event or keyword_file

falsepositives:
    - unknown
level: high
