title: OS Credential Dumping - /etc/Passwd & /etc/Shadow - Linux
id: 3723ab77-c546-403c-8fb4-bb577033b235
status: test
description: Adversaries might try to access these files to obtain sensitive information. If they can read /etc/passwd, they can see usernames and, if they can also access /etc/shadow, they can attempt to crack the hashed passwords offline.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.008/T1003.008.md
author: Milad Cheraghi
date: 2024-10-10
tags:
    - attack.os_credential_dumping
    - attack.t1003.008
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
          - '/cp'
          - '/mv'
          - '/cat'
          - '/tail'
          - '/more'
          - '/head'
          - '/less'
          - '/tac'
          - '/grep'
    selection_file:
        CommandLine|contains:
          - 'passwd'
          - 'shadow'
          - 'master.passwd'
    condition: selection_img and selection_file
falsepositives:
    - Legitimate administration activities
level: low
