title: UAC Bypass via sdclt.exe
id: 4a67fdc1-keys-uac-sdclt
description: Detects sdclt.exe being abused to perform UAC bypass using system32 binary hijack technique
status: experimental
author: Skyler “Keys” Piatiak (@vVv-Keys)
date: 2025/06/19
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\sdclt.exe'
    CommandLine|contains:
      - '/EXP'
      - 'SystemRoot\\System32\\'
  condition: selection
falsepositives:
  - Rare administrative scripts
level: high
tags:
  - attack.defense_evasion
  - attack.privilege_escalation
  - attack.t1548.002
  - sigma-contrib
