title: Sign-ins by Unknown Devices
id: 4d136857-6a1a-432a-82fc-5dd497ee5e7c
status: test
description: Monitor and alert for Sign-ins by unknown devices from non-Trusted locations.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-devices#non-compliant-device-sign-in
author: Michael Epping, '@mepples21'
date: 2022-06-28
modified: 2022-10-05
tags:
    - attack.defense-evasion
    - attack.t1078.004
    - vigilant.alerting.identity_risk
    - vigilant.exception.item.tenant
    - vigilant.disabled
    - vigilant.review
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        AuthenticationRequirement: singleFactorAuthentication
        ResultType: 0
        NetworkLocationDetailsLength: 0
        DeviceDetail.deviceId: null
    condition: selection
falsepositives:
    - Unknown
level: low
