title: Azure Unusual Authentication Interruption
id: 8366030e-7216-476b-9927-271d79f13cf3
status: test
description: Detects when there is a interruption in the authentication process.
references:
    - https://learn.microsoft.com/en-us/entra/architecture/security-operations-privileged-accounts
    - https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes
author: Austin Songer @austinsonger
date: 2021-11-26
modified: 2026-05-08
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.initial-access
    - attack.stealth
    - attack.t1078
logsource:
    product: azure
    service: signinlogs
detection:
    selection_50097:
        resultType: 50097
        resultDescription: 'Device authentication is required'
    selection_50155:
        resultType: 50155
        resultDescription: 'DeviceAuthenticationFailed'
    selection_50158:
        resultType: 50158
        resultDescription: 'ExternalSecurityChallenge - External security challenge was not satisfied'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: medium
