title: Adding of a registry key for LSASS Shtinkering
id: 33efc23c-6ea2-4503-8cfe-bdf82ce8f718
status: experimental
description: Detects when an attacker adds a registry key that's required to perform LSASS Shtinkering attack.
references:
    - https://github.com/deepinstinct/Lsass-Shtinkering
author: '@pbssubhash'
date: 2022/12/08
modified: 2022/12/08
tags:
    - attack.credential_access
logsource:
    category: registry_add
    product: windows
detection:
    selection:
        EventType: CreateKey
        TargetObject|contains:
            - '\SOFTWARE\Microsoft\Windows\Windows Error Reporting\LocalDumps'
    condition: selection
falsepositives:
    - Legitimate usage of enabling user mode dumping (Not seen in the wild)
level: high
