title: WMI Persistence
status: experimental
description: Detects suspicious WMI event filter and command line event consumer based on event id 5861 (Windows 10)
author: Florian Roth
reference: https://twitter.com/mattifestation/status/899646620148539397
logsource:
    product: windows
    service: wmi
detection:
    selection:
        EventID: 5861
    keywords:
        - 'CommandLineEventConsumer'
        - 'CommandLineTemplate'
        - 'Binding EventFilter'
    condition: selection and 1 of keywords
falsepositives:
    - Unknown (data set is too small; further testing needed)
level: high
