title: Mailbox Export to Exchange Webserver
id: 60685ef9-ad8b-4dba-af27-841a2a25489c
status: experimental
description: Detects a successful export of an Exchange mailbox to untypical directory or with aspx name suffix which can be used to place a webshell or the needed role assignment for it
references:
    - https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
author: Christian Burkard
date: 2021/08/10  
logsource:        
    service: msexchange-management
    product: windows
detection:
    export_command: 
        - 'New-MailboxExportRequest'
        - ' -Mailbox '
    export_params:
        - '-FilePath "\\localhost\C$'
        - '-FilePath "\\127.0.0.1\C$'
        - '.aspx'
    role_assignment:
        - 'New-ManagementRoleAssignment'
        - ' -Role "Mailbox Import Export"'
        - ' -User '
    condition: (all of export_command and export_params) or role_assignment
falsepositives:
    - unlikely
level: critical
tags:
    - attack.persistence  
    - attack.t1505.003  
