title: Rare Scheduled Task Creations
status: experimental
description:  
author: Florian Roth
logsource:
    product: windows
    service: microsoft-windows-taskscheduler
detection:
    selection:
        EventID: 106
    timeframe: 7d
    condition: selection | count() by TaskName < 5 
falsepositives:
    - Software installation
level: low
