title: Bypass Windows Defender
description: 'Detects scenarios where an windows defender exclusion was added in registry
    where an entity would want to bypass antivirus scanning from windows defender
references:
    - https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
tags:
    - attack.defense_evasion
    - attack.t1089
author: '@BarryShooshooga'
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Security Settings/Local Policies/Audit Policy, Registry System Access Control (SACL): Auditing/User'
detection:
    selection:
        EventID: 4657
        EventID: 4656
        EventID: 4660
        EventID: 4663
        ObjectName: 'HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender\Exclusions\*'
    condition: selection
falsepositives: 
    - intended inclusions by administrator
level: high
