title: Installation of MSExchange Transport Agent
id: 83809e84-4475-4b69-bc3e-4aad8568612f
status: experimental
description: Detects the Installation of a Exchange Transport Agent
references:
    - https://twitter.com/blueteamsec1/status/1401290874202382336?s=20
tags:
    - attack.persistance  
    - attack.T1505.002    
author: Tobias Michalski  
date: 2021/06/08  
logsource:        
    service: msexchange-management
    product: windows
detection:
    selection:
        Message|contains: 'Install-TransportAgent'
        EventID: 1
    condition: selection
fields:
    - AssemblyPath
falsepositives:
    - legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator for this.
level: medium
