action: global
title: PsExec Tool Execution
status: experimental
description: Detects PsExec service installation and execution events (service and Sysmon)
author: Thomas Patzke
date: 2017/06/12
modified: 2021/08/26
references:
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://jpcertcc.github.io/ToolAnalysisResultSheet
tags:
    - attack.execution
    - attack.t1035           # an old one
    - attack.t1569.002
    - attack.s0029
detection:
    condition: 1 of them
fields:
    - EventID
    - CommandLine
    - ParentCommandLine
    - ServiceName
    - ServiceFileName
    - TargetFilename
    - PipeName
falsepositives:
    - unknown
level: low
---
id: 42c575ea-e41e-41f1-b248-8093c3e82a28
logsource:
    product: windows
    service: system
detection:
    service_installation:
        EventID: 7045
        ServiceName: 'PSEXESVC'
        ServiceFileName|endswith: '\PSEXESVC.exe'
    service_execution:
        EventID: 7036
        ServiceName: 'PSEXESVC'
---
id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
logsource:
    category: process_creation
    product: windows
detection:
    sysmon_processcreation:
        Image|endswith: '\PSEXESVC.exe'
        User|startswith: 
            - 'NT AUTHORITY\SYSTEM'
            - 'AUTORITE NT\Sys' # French language settings
---
id: f3f3a972-f982-40ad-b63c-bca6afdfad7c
logsource:
     category: pipe_created
     product: windows
detection:
     sysmon_pipecreated:
         PipeName: '\PSEXESVC'
---
id: 259e5a6a-b8d2-4c38-86e2-26c5e651361d
logsource:
     category: file_event
     product: windows
detection:
     sysmon_filecreation:
        TargetFilename|endswith: '\PSEXESVC.exe'
