title: Failed MSExchange Transport Agent Installation
id: c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa
status: experimental
description: Detects a failed installation of a Exchange Transport Agent
references:
    - https://twitter.com/blueteamsec1/status/1401290874202382336?s=20
tags:
    - attack.persistence  
    - attack.t1505.002    
author: Tobias Michalski  
date: 2021/06/08  
logsource:        
    service: msexchange-management
    product: windows
detection:
    selection:
        EventID: 6 
    keywords:
        - 'Install-TransportAgent'
    condition: selection and keywords
fields:
    - AssemblyPath
falsepositives:
    - legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator for this.
level: high
