title: Download from Suspicious TLD
status: experimental
description: Detects executable downloads from suspicious remote systems
author: Florian Roth
logsource:
    category: proxy
detection:
    selection:
        c-uri-extension: 
            - 'exe'
            - 'vbs'
            - 'bat'
            - 'rar'
            - 'ps1'
            - 'docx'
    filter:
        r-dns: 
            - '*.com'
            - '*.org'
            - '*.net'
            - '*.edu'
            - '*.gov'
            - '*.uk'
            - '*.ca'
            - '*.de'
            - '*.jp'
            - '*.fr'
            - '*.au'
            - '*.us'
            - '*.ch'
            - '*.it'
            - '*.nl'
            - '*.se'
            - '*.no'
            - '*.es'    
    condition: selection and not filter
fields:
    - ClientIP
    - URL
falsepositives:
    - All kind of software downloads
level: low
