title: Windows PowerShell WebDav User Agent
status: experimental
description: Detects Windows PowerShell Web Access
references:
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: Florian Roth
date: 2018/04/06
logsource:
    category: proxy
detection:
    selection:
      UserAgent: 'Microsoft-WebDAV-MiniRedir/*'
    condition: selection
fields:
    - ClientIP
    - URL
    - UserAgent
falsepositives:
    - Administrative scripts that download files from the Internet
    - Administrative scripts that retrieve certain website contents
level: high
