title: Suspicious User Agent
status: experimental
description: Detects suspicious user agent strings in proxy logs
reference:
    - https://github.com/fastly/waf_testbed/blob/master/templates/default/scanners-user-agents.data.erb
    - http://rules.emergingthreats.net/open/snort-2.9.0/rules/emerging-user_agents.rules
    - https://blog.didierstevens.com/2015/03/16/quickpost-metasploit-user-agent-strings/
    - http://www.botopedia.org/search?searchword=scan&searchphrase=all
    - https://twitter.com/Carlos_Perez/status/883455096645931008
    - https://networkraptor.blogspot.com/2015/01/user-agent-strings.html
    - https://perishablepress.com/blacklist/ua-2013.txt
    - https://www.bluecoat.com/en-gb/security-blog/2015-05-05/know-your-agents
author: Florian Roth
logsource:
    type: proxy
detection:
    selection:
      UserAgent:
        # Vulnerbility scanner and brute force tools
        - '*(hydra)*'
        - '* arachni/*'
        - '* BFAC *'
        - '* brutus *'
        - '* cgichk *'
        - '*core-project/1.0*'
        - '* crimscanner/*'
        - '*datacha0s*'
        - '*dirbuster*'
        - '*domino hunter*'
        - '*dotdotpwn*'
        - 'FHScan Core'
        - '*floodgate*'
        - '*get-minimal*'
        - '*gootkit auto-rooter scanner*'
        - '*grendel-scan*'
        - '* inspath *'
        - '*internet ninja*'
        - '*jaascois*'
        - '* zmeu *'
        - '*masscan*'
        - '* metis *'
        - '*morfeus fucking scanner*'
        - '*n-stealth*'
        - '*nsauditor*'
        - '*pmafind*'
        - '*security scan*'
        - '*springenwerk*'
        - '*teh forest lobster*'
        - '*toata dragostea*'
        - '* vega/*'
        - '*voideye*'
        - '*webshag*'
        - '*webvulnscan*'
        - '* whcc/*'

        # SQL Injection
        - '* Havij'
        - '*absinthe*'
        - '*bsqlbf*'
        - '*mysqloit*'
        - '*pangolin*'
        - '*sql power injector*'
        - '*sqlmap*'
        - '*sqlninja*'
        - '*uil2pn*'

        # Exploits
        - '*wordpress hash grabber*'
        - '*exploit*'

        # Badly scripted UA
        - 'user-agent'  # User-Agent: User-Agent:
        - '* (compatible;MSIE *'  # typical typo - missing space
        - '*.0;Windows NT *'  # typical typo - missing space
        - 'Mozilla/3.0 *'
        - 'Mozilla/2.0 *'
        - 'Mozilla/1.0 *'
        - 'Mozilla *'  # missing slash
        - ' Mozilla/*'  # leading space 
        - 'Mozila/*'  # single 'l'

        # RATs
        - 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:53.0) Gecko/20100101 Chrome /53.0'  # DargonOK
        - 'Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1)'  # Used by PlugX - base-lining recommended - https://community.rsa.com/thread/185439
        - 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Trident/4.0)'  # Used by PlugX - base-lining recommended - https://community.rsa.com/thread/185439
        - 'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0; .NET CLR  1.1.4322)'  # Used by PlugX - old - https://goo.gl/Yfjtk5
        - 'HttpBrowser/1.0'  # HTTPBrowser RAT
        - '*<|>*'  # Houdini / Iniduoh / njRAT
        - 'nsis_inetc (mozilla)'  # ZeroAccess
        - 'Wget/1.9+cvs-stable (Red Hat modified)'  # Dyre / Upatre

        # APT Related
        - 'SJZJ (compatible; MSIE 6.0; Win32)'  # APT Backspace
        - 'Mozilla/5.0 (Windows NT 6.; WOW64; rv:20.0) Gecko/20100101 Firefox/20.0'  # APT GrizzlySteppe - ChopStick - US CERT https://goo.gl/1DTHwi
        - 'User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.1; Trident/4.0; SLCC'  # Comment Crew Miniasp
        - 'Mozilla/4.0 (compatible; MSIE 7.4; Win32;32-bit)'  # Comment Crew Miniasp
        - 'webclient'  # Naikon APT
        - 'Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-EN; rv:1.7.12) Gecko/200'  # Naikon APT
        - 'Mozilla/4.0 (compatible; MSI 6.0;'  # SnowGlobe Babar - yes, it is cut
        - 'Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0'  # Sofacy - Xtunnel
        - 'Mozilla/5.0 (Windows NT 6.2; WOW64; rv:20.0) Gecko/20100101 Firefox/'  # Sofacy - Xtunnel
        - 'Mozilla/5.0 (Windows NT 6.; WOW64; rv:20.0) Gecko/20100101 Firefox/2'  # Sofacy - Xtunnel
        - 'Mozilla/4.0'  # Derusbi backdoor ELF https://github.com/fideliscyber/indicators/tree/master/FTA-1021
        - 'Netscape'  # Unit78020 Malware 
        - 'Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-EN; rv:1.7.12) Gecko/20100719 Firefox/1.0.7'  # Unit78020 Malware
        - 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.2.13) Firefox/3.6.13 GTB7.1'  # Winnti related
        - 'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64; Trident/5.0)'  # Winnti related

        # Malware
        - '*zeroup*'  # W32/Renos.Downloader
        - 'Mozilla/5.0 (Windows NT 5.1 ; v.*'  # Kazy
        - '* adlib/*'  # https://goo.gl/gcAHoh
        - '* tiny'  # Trojan Downloader
        - '* BGroom *'  # Trojan Downloader
        - '* changhuatong'
        - '* CholTBAgent'
        - 'Mozilla/5.0 WinInet'
        - 'RookIE/1.0'
        - 'M'  # HkMain
        - 'Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)'  # Egamipload - old UA - probable prone to false positives
        - 'Mozilla/4.0 (compatible;MSIE 7.0;Windows NT 6.0)'  # Yakes
        - 'backdoorbot'
        - 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.2.3) Gecko/20100401 Firefox/3.6.1 (.NET CLR 3.5.30731)'  # Sality
        - 'Opera/8.81 (Windows NT 6.0; U; en)'  # Sality
        - 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.9.2.3) Gecko/20100401 Firefox/3.6.1 (.NET CLR 3.5.30729)'  # Sality
        - 'Opera'  # Trojan Keragany
        - 'Mozilla/4.0 (compatible; MSIE 5.0; Windows 98)'  # Fareit
        - 'Mozilla/4.0 (compatible; MSIE 5.01; Windows NT 5.0)'  # Webshell's back connect
        - 'MSIE'  # Toby web shell

        # Others 
        - '* pxyscand*'
        - '* asd'
        - '* mdms'
        - 'sample'
        - 'nocase'
        - 'Moxilla'
        - 'Win32 *'
        - '_'
        - '*Microsoft Internet Explorer*'
        - 'agent *'
        - 'AutoIt'  # Suspicious - base-lining recommended
        - 'IczelionDownLoad'

        # Cobalt Strike https://www.cobaltstrike.com/help-malleable-c2
        - 'Internet Explorer *'
        - 'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; InfoPath.2)'  # https://goo.gl/f4H5Ez

        # Metasploit Framework - Analysis by Didier Stevens https://blog.didierstevens.com/2015/03/16/quickpost-metasploit-user-agent-strings/
        - 'Mozilla/4.0 (compatible; Metasploit RSPEC)'
        - 'Mozilla/4.0 (compatible; MSIE 6.1; Windows NT)'
        - 'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1)'  # old browser, rare, base-lining needed
        - 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0)'  # old browser, rare, base-lining needed
        - 'Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.0; Trident/4.0)'  # old browser, rare, base-lining needed
        - 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0; Trident/4.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; .N'
        - 
        - 'Mozilla/5.0 (compatible; Googlebot/2.1; +http://www.google.com/bot.html)'  # only use in proxy logs - not for detection in web server logs
        - 'Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US) AppleWebKit/525.13 (KHTML, like Gecko) Chrome/4.0.221.6 Safari/525.13'
        # Metasploit Update by Florian Roth 08.07.2017
        - 'Mozilla/5.0'
        - 'Mozilla/4.0 (compatible; SPIPE/1.0'
        # - 'Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.1; Trident/6.0)'  # too many false positives expected
        # - 'Mozilla/5.0 (Windows NT 6.1; Trident/7.0; rv:11.0) like Gecko'  # too many false positives expected
        - 'Mozilla/5.0 (Windows NT 6.3; rv:39.0) Gecko/20100101 Firefox/35.0'
        - 'Sametime Community Agent'  # Unknown if prone to false positives - used in https://goo.gl/gHZkeR
        - '#{suser}'
        - 'X-FORWARDED-FOR'
        - 'DotDotPwn v2.1'
        - 'SIPDROID'
    condition: selection
falsepositives:
    - Unknown
level: high
