title: Windows PowerShell User Agent
status: experimental
description: Detects Windows PowerShell Web Access
reference: https://msdn.microsoft.com/powershell/reference/5.1/microsoft.powershell.utility/Invoke-WebRequest
author: Florian Roth
logsource:
    type: proxy
detection:
    selection:
      UserAgent: '* WindowsPowerShell/*'
    condition: selection
falsepositives:
    - Administrative scripts that download files from the Internet
    - Administrative scripts that retrieve certain website contents
level: medium
