title: Windows WebDAV User Agent
id: e09aed7a-09e0-4c9a-90dd-f0d52507347e
status: experimental
description: Detects WebDav DownloadCradle
references:
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: Florian Roth
date: 2018/04/06
logsource:
    category: proxy
detection:
    selection:
      c-useragent: 'Microsoft-WebDAV-MiniRedir/*'
      cs-method: 'GET'
    condition: selection
fields:
    - ClientIP
    - c-uri
    - c-useragent
    - cs-method
falsepositives:
    - Administrative scripts that download files from the Internet
    - Administrative scripts that retrieve certain website contents
    - Legitimate WebDAV administration
level: high
