title: CobaltStrike Malleable (OCSP) Profile
id: 37325383-740a-403d-b1a2-b2b4ab7992e7
status: experimental
description: Detects Malleable (OCSP) Profile with Typo (OSCP) in URL
references:
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/ocsp.profile
author: Markus Neis
date: 2019/11/12
tags:
    - attack.t1102
logsource:
    category: proxy
detection:
    selection:
      c-uri: '*/oscp/*'
      cs-host: 'ocsp.verisign.com'

    condition: selection
falsepositives:
    - Unknown
level: high
