title: Suspicious Request Directly to IP
id: 6727a9d6-0962-44c0-8662-c87acf24efb3
status: experimental
description: Detects suspicious requests directly to IPs
author: NVISO
date: 2020/03/26
logsource:
  category: proxy
detection:
  selection:
    cs-host|re: (25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|[01]?[0-9]?[0-9])
  condition: selection
fields:
  - c-ip
  - c-uri
  - c-useragent
falsepositives:
  - Microsoft Azure Linux Guest Agent
level: medium
