title: Suspicious Request Directly to IP
id: 6727a9d6-0962-44c0-8662-c87acf24efb3
status: experimental
description: Detects suspicious requests directly to IPs
author: NVISO
date: 2020/03/26
logsource:
  category: proxy
detection:
  ipv4:
    cs-host|re: '^[0-9.]+$'
  ipv6:
    cs-host|re: '^\[[0-9a-fA-F:]+\]$'
  condition: 1 of them
fields:
  - c-ip
  - c-uri
  - c-useragent
falsepositives:
  - Microsoft Azure Linux Guest Agent
level: medium
