title: Empty User Agent
status: experimental
description: Detects an empty User-Agent string that is suspicious and used by PowerShell web requests under certain conditions
reference: https://twitter.com/Carlos_Perez/status/883455096645931008
author: Florian Roth
logsource:
    type: proxy
detection:
    selection:
      UserAgent: ''
    condition: selection
falsepositives:
    - Administrative scripts that download files from the Internet
    - Administrative scripts that retrieve certain website contents
level: medium
