title: Vulnerable Driver Load By Name
id: c316eac1-f3d8-42da-ad1c-66dcec5ca787
related:
    - id: 7aaaf4b8-e47c-4295-92ee-6ed40a6f60c8
      type: derived
status: experimental
description: Detects the load of known vulnerable drivers via their names only
author: Nasreddine Bencherchali
references:
    - https://github.com/eclypsium/Screwed-Drivers/blob/master/DRIVERS.md
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules
    - https://www.rapid7.com/blog/post/2021/12/13/driver-based-attacks-past-and-present/
    - https://github.com/jbaines-r7/dellicious
    - https://github.com/MicrosoftDocs/windows-itpro-docs/blob/public/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules.md
date: 2022/10/03
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImageLoaded|endswith:
            - '\ASIO32.sys'
            - '\fiddrv.sys'
            - '\WinRing0.sys'
            - '\winring00x64.sys'
            - '\ASIO64.sys'
            - '\bandai.sys'
            - '\capcom.sys'
            - '\32-bit dell dbutil.sys'
            - '\64-bit dell dbutil.sys'
            - '\fiddrv64.sys'
            - '\fidpcidrv.sys'
            - '\fidpcidrv64.sys'
            - '\PassMark DirectIo.sys'
            - '\MsIo.sys'
            - '\piddrv.sys'
            - '\phymemx64'
            - '\semav6msr64.sys'
            - '\80.sys'
            - '\full.sys'
            - '\nstrwsk.sys'
            - '\nt2.sys'
            - '\nt3.sys'
            - '\nt5.sys'
            - '\81.sys'
            - '\b4.sys'
            - '\bw.sys'
            - '\bwrs.sys'
            - '\bwrsh.sys'
            - '\TGSafe.sys'
            - '\BlackBoneDrv10.sys'
            - '\windows-xp-64.sys'
            - '\windows8-10-32.sys'
            - '\kbdcap64.sys'
            - '\netfilterdrv.sys'
            - '\d.sys'
            - '\b3.sys'
            - '\2.sys'
            - '\b1.sys'
            - '\My.sys'
            - '\Black.sys'
            - '\WYProxy32.sys'
            - '\WYProxy64.sys'
            - '\Proxy64.sys'
            - '\LgDCatcher.sys'
            - '\ni.sys'
            - '\d4.sys'
            - '\d2.sys'
            - '\t.sys'
            - '\1.sys'
            - '\cpupress.sys'
            - '\gameink.sys'
            - '\NetFlt.sys'
            - '\ProtectS.sys'
            - '\GameTerSafe.sys'
            - '\Lurker.sys'
            - '\TestBone.sys'
            - '\Proxy32.sys'
            - '\t7.sys'
            - '\t8.sys'
            - '\nstr.sys'
            - '\nt6.sys'
            - '\t3.sys'
            - '\windows7-32.sys'
            - '\NetProxyDriver.sys'
            - '\c.sys'
            - '\b.sys'
            - '\nt4.sys'
            - '\d3.sys'
            - '\AsUpIO64.sys'
            - '\AsrDrv10.sys'
            - '\AsrDrv101.sys'
            - '\AsrDrv102.sys'
            - '\AsrDrv103.sys'
            - '\BSMEMx64.sys'
            - '\BSMIXP64.sys'
            - '\BSMIx64.sys'
            - '\BS_Flash64.sys'
            - '\BS_HWMIO64_W10.sys'
            - '\BS_HWMIo64.sys'
            - '\BS_I2c64.sys'
            - '\GLCKIO2.sys'
            - '\GVCIDrv64.sys'
            - '\HwOs2Ec10x64.sys'
            - '\HwOs2Ec7x64.sys'
            - '\MsIo64.sys'
            - '\NBIOLib_X64.sys'
            - '\NCHGBIOS2x64.sys'
            - '\NTIOLib_X64.sys'
            - '\PhlashNT.sys'
            - '\Phymemx64.sys'
            - '\UCOREW64.sys'
            - '\WinFlash64.sys'
            - '\amifldrv64.sys'
            - '\atillk64.sys'
            - '\dbk64.sys'
            - '\mtcBSv64.sys'
            - '\nvflash.sys'
            - '\nvflsh64.sys'
            - '\phymem64.sys'
            - '\rtkio64.sys'
            - '\rtkiow10x64.sys'
            - '\rtkiow8x64.sys'
            - '\segwindrvx64.sys'
            - '\superbmc.sys'
            - '\semav6msr.sys'
            - '\piddrv64.sys'
            - '\mhyprot2.sys'
            - '\netfilter.sys'
            - '\RTCore64.sys'
            - '\DBUtils_2_3.sys'
            - '\physmem.sys'
            - '\procexp152.sys'
            - '\cpuz141.sys'
            - '\viraglt64.sys'
            - '\vboxdrv.sys'
            - '\gdrv.sys'
            - '\rwdrv.sys'
            - '\speedfan.sys'
            - '\kprocesshacker.sys'
            - '\sandra.sys'
            - '\elbycdio.sys'
            - '\goad.sys'
            - '\aswsnx.sys'
            - '\sandbox.sys'
            - '\nicm.sys' # All before 3.1.11.0
            - '\nscm.sys' # All before 3.1.11.0
            - '\ncpl.sys' # All before 3.1.11.0
            - '\elrawdsk.sys'
            - '\aswArPot.sys'
            - '\DBUtil_2_3.sys'
            - '\HEVD.sys'
            - '\WinRing0x64.sys'
            - '\WinRing0.dll'
            - '\WinRing0x64.dll'
            - '\DBUtilDrv2.sys'
            - '\BS_RCIO64.sys'
            - '\mhyprot.sys'
    condition: selection
falsepositives:
    - Some false positives may occure if one of the vulnerable driver names mentioned above didn't change it's name between versions. So always make sure that the driver being loaded is the legitimate one and the non vulnerable version.
    - If you experience a lot of FP you could comment the driver name in question as it's covered by the related rule via it's hash
level: medium
tags:
    - attack.privilege_escalation
    - attack.t1543.003
