title: PowerShell Scripts Run by a Services
id: 46deb5e1-28c9-4905-b2df-51cdcc9e6073
related:
    - id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
      type: derived
description: Detects powershell script installed as a Service
status: experimental
author: oscd.community, Natalia Shornikova
date: 2020/10/06
modified: 2021/09/21
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
tags:
    - attack.execution
    - attack.t1569.002
logsource:
    product: windows
    category: driver_load
detection:
    powershell_as_service:
        ImageLoaded|contains: 
          - 'powershell'
          - 'pwsh'
    condition: powershell_as_service
falsepositives:
    - Unknown
level: high