title: HackTool - Potential Doppelganger Execution Pattern
id: 309cd74d-6cb1-42f9-b048-eee01a527aa5
status: experimental
description: |
    Detects the loading of RTCore64.sys driver from C:\Users\Public directory, which may indicate Doppelganger execution technique.
    In order to use Doppelganger, attackers must place RTCore64.sys in C:\Users\Public directory.
references:
    - https://labs.yarix.com/2025/06/doppelganger-an-advanced-lsass-dumper-with-process-cloning/
    - https://github.com/vari-sh/RedTeamGrimoire/tree/668e0357072546065729ad623f8c02f7be21bb08/Doppelganger
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-07-01
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    category: driver_load
    product: windows
detection:
    selection:
        ImageLoaded|contains|all:
            - ':\Users\Public'
            - 'RTCore64.sys'
    condition: selection
falsepositives:
    - Unknown
level: high
