title: Vulnerable Driver Load By Name
id: c316eac1-f3d8-42da-ad1c-66dcec5ca787
related:
    - id: 7aaaf4b8-e47c-4295-92ee-6ed40a6f60c8
      type: derived
status: experimental
description: Detects the load of known vulnerable drivers via their names only.
references:
    - https://loldrivers.io/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/03
modified: 2023/04/06
tags:
    - attack.privilege_escalation
    - attack.t1543.003
    - attack.t1068
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImageLoaded|endswith:
            - '\mtcbsv64.sys'
            - '\bs_def64.sys'
            - '\gameink.sys'
            - '\81.sys'
            - '\bs_rcio.sys'
            - '\sense5ext.sys'
            - '\asrdrv10.sys'
            - '\gvcidrv64.sys'
            - '\wantd_5.sys'
            - '\driver7-x86-withoutdbg.sys'
            - '\atillk64.sys'
            - '\lurker.sys'
            - '\segwindrvx64.sys'
            - '\nt3.sys'
            - '\enetechio64.sys'
            - '\asio64.sys'
            - '\inpoutx64.sys'
            - '\windows8-10-32.sys'
            - '\directio.sys'
            - '\rtkio.sys'
            - '\corsairllaccess64.sys'
            - '\nt6.sys'
            - '\winflash64.sys'
            - '\paniox64.sys'
            - '\blackbonedrv10.sys'
            - '\msio32.sys'
            - '\fiddrv.sys'
            - '\asio.sys'
            - '\dbutildrv2.sys'
            - '\my.sys'
            - '\wantd_3.sys'
            - '\winio32a.sys'
            - '\wyproxy64.sys'
            - '\ni.sys'
            - '\bs_i2cio.sys'
            - '\kprocesshacker.sys'
            - '\protects.sys'
            - '\phymem64.sys'
            - '\proxy32.sys'
            - '\b.sys'
            - '\netproxydriver.sys'
            - '\bs_hwmio64_w10.sys'
            - '\physmem.sys'
            - '\asrsmartconnectdrv.sys'
            - '\b3.sys'
            - '\monitor_win10_x64.sys'
            - '\poortry2.sys'
            - '\amdryzenmasterdriver.sys'
            - '\t.sys'
            - '\sandra.sys'
            - '\bsmix64.sys'
            - '\bs_i2c64.sys'
            - '\wantd_6.sys'
            - '\bs_rcio64.sys'
            - '\zam64.sys'
            - '\viragt64.sys'
            - '\winio32b.sys'
            - '\poortry1.sys'
            - '\msio64.sys'
            - '\winio32.sys'
            - '\ncpl.sys'
            - '\nchgbios2x64.sys'
            - '\bwrsh.sys'
            - '\panio.sys'
            - '\lha.sys'
            - '\ntbios.sys'
            - '\blacklotus_driver.sys'
            - '\fidpcidrv.sys'
            - '\b4.sys'
            - '\mhyprot3.sys'
            - '\ucorew64.sys'
            - '\hwos2ec7x64.sys'
            - '\bsmemx64.sys'
            - '\windows7-32.sys'
            - '\asrdrv106.sys'
            - '\elbycdio.sys'
            - '\iomem64.sys'
            - '\asupio.sys'
            - '\otipcibus.sys'
            - '\windows-xp-64.sys'
            - '\aswarpot.sys'
            - '\amdpowerprofiler.sys'
            - '\d.sys'
            - '\2.sys'
            - '\tgsafe.sys'
            - '\ntiolib_x64.sys'
            - '\asrrapidstartdrv.sys'
            - '\1.sys'
            - '\hwos2ec10x64.sys'
            - '\daxin_blank5.sys'
            - '\viraglt64.sys'
            - '\iomap64.sys'
            - '\lv561av.sys'
            - '\nscm.sys'
            - '\c.sys'
            - '\asribdrv.sys'
            - '\b1.sys'
            - '\eneio64.sys'
            - '\capcom.sys'
            - '\80.sys'
            - '\asio32.sys'
            - '\iobitunlocker.sys'
            - '\zamguard64.sys'
            - '\nstrwsk.sys'
            - '\wiseunlo.sys'
            - '\t7.sys'
            - '\bs_hwmio64.sys'
            - '\hostnt.sys'
            - '\glckio2.sys'
            - '\hpportiox64.sys'
            - '\citmdrv_amd64.sys'
            - '\kevp64.sys'
            - '\bsmixp64.sys'
            - '\nbiolib_x64.sys'
            - '\d3.sys'
            - '\full.sys'
            - '\nvflash.sys'
            - '\rtcore64.sys'
            - '\speedfan.sys'
            - '\fidpcidrv64.sys'
            - '\hwrwdrv.sys'
            - '\msrhook.sys'
            - '\proxy64.sys'
            - '\7.sys'
            - '\winring0.sys'
            - '\hw_sys'
            - '\winio64b.sys'
            - '\semav6msr64.sys'
            - '\bandai.sys'
            - '\piddrv.sys'
            - '\t8.sys'
            - '\asrdrv103.sys'
            - '\adv64drv.sys'
            - '\asrsetupdrv103.sys'
            - '\bwrs.sys'
            - '\d4.sys'
            - '\dbk64.sys'
            - '\fiddrv64.sys'
            - '\goad.sys'
            - '\gametersafe.sys'
            - '\mhyprot2.sys'
            - '\lenovodiagnosticsdriver.sys'
            - '\netflt.sys'
            - '\bw.sys'
            - '\ntbios_2.sys'
            - '\dbutil.sys'
            - '\dh_kernel.sys'
            - '\rtkiow8x64.sys'
            - '\daxin_blank.sys'
            - '\superbmc.sys'
            - '\nodedriver.sys'
            - '\cpuz141.sys'
            - '\gftkyj64.sys'
            - '\d2.sys'
            - '\4.sys'
            - '\dh_kernel_10.sys'
            - '\naldrv.sys'
            - '\winiodrv.sys'
            - '\asmmap64.sys'
            - '\smep_namco.sys'
            - '\mhyprot.sys'
            - '\iqvw64e.sys'
            - '\nstr.sys'
            - '\ntiolib.sys'
            - '\pciecubed.sys'
            - '\vmdrv.sys'
            - '\daxin_blank2.sys'
            - '\atszio.sys'
            - '\agent64.sys'
            - '\cpupress.sys'
            - '\driver7-x86.sys'
            - '\krpocesshacker.sys'
            - '\asrdrv102.sys'
            - '\aswvmm.sys'
            - '\tmcomm.sys'
            - '\bs_def.sys'
            - '\bsmi.sys'
            - '\alsysio64.sys'
            - '\cpuz.sys'
            - '\daxin_blank1.sys'
            - '\amifldrv64.sys'
            - '\rwdrv.sys'
            - '\testbone.sys'
            - '\winio64c.sys'
            - '\winring0x64.sys'
            - '\nt4.sys'
            - '\procexp.sys'
            - '\winio64.sys'
            - '\se64a.sys'
            - '\air_system10.sys'
            - '\wantd.sys'
            - '\wcpu.sys'
            - '\nicm.sys'
            - '\daxin_blank6.sys'
            - '\kbdcap64.sys'
            - '\lctka.sys'
            - '\nvflsh64.sys'
            - '\phlashnt.sys'
            - '\viragt.sys'
            - '\atszio64.sys'
            - '\dbutil_2_3.sys'
            - '\phymemx64.sys'
            - '\wantd_4.sys'
            - '\ndislan.sys'
            - '\panmonfltx64.sys'
            - '\t3.sys'
            - '\panmonflt.sys'
            - '\daxin_blank3.sys'
            - '\gdrv.sys'
            - '\smep_capcom.sys'
            - '\wyproxy32.sys'
            - '\black.sys'
            - '\vboxdrv.sys'
            - '\cpuz_x64.sys'
            - '\poortry.sys'
            - '\mydrivers.sys'
            - '\winio64a.sys'
            - '\openlibsys.sys'
            - '\bs_flash64.sys'
            - '\vproeventmonitor.sys'
            - '\piddrv64.sys'
            - '\wantd_2.sys'
            - '\sysinfo.sys'
            - '\asrdrv104.sys'
            - '\netfilterdrv.sys'
            - '\libnicm.sys'
            - '\driver7-x64.sys'
            - '\semav6msr.sys'
            - '\pchunter.sys'
            - '\asupio64.sys'
            - '\rtkio64.sys'
            - '\rzpnk.sys'
            - '\magdrvamd64.sys'
            - '\elrawdsk.sys'
            - '\amp.sys'
            - '\asrautochkupddrv.sys'
            - '\lgdcatcher.sys'
            - '\fairplaykd.sys'
            - '\daxin_blank4.sys'
            - '\rtkiow10x64.sys'
            - '\citmdrv_ia64.sys'
            - '\nt5.sys'
            - '\asromgdrv.sys'
            - '\nt2.sys'
            - '\asrdrv101.sys'
    condition: selection
falsepositives:
    - False positives may occur if one of the vulnerable driver names mentioned above didn't change its name between versions. So always make sure that the driver being loaded is the legitimate one and the non vulnerable version.
    - If you experience a lot of FP you could comment the driver name or its exact known legitimate location (when possible)
level: medium
