title: Potential Persistence via New Admin User Creation - Fortinet Fortigate Firewall
id: cd0a4943-0edd-42cf-b50c-06f77a10d4c1
status: experimental
description: Detects the creation of an administrator on Fortinet Fortigate Firewall.
references: https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025-02-14
tags:
    - attack.persistence
    - attack.1136.001
logsource:
  category: firewall
detection:
    selection:
        action: "Add"
        cfgpath: "system.admin"
    condition: selection
falsepositives:
    - An administrator account can be created for legitimate purposes
level: medium
