title: Potential Persistence via New Local User Creation - Fortinet Fortigate Firewall
id: ddbbe845-1d74-43a8-8231-2156d180234d
status: experimental
description: |
  Detects the creation of a new local user on Fortinet Fortigate Firewall.
  The new local user could be used for VPN connections.
references: https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025/02/14
tags:
  - attack.persistence
  - attack.1136.001
logsource:
  category: firewall
detection:
  selection_action:
    fortinet.firewall.action: "Add"
  selection_path:
    fortinet.firewall.cfgpath: "user.local"
  condition: all of selection*
falsepositives: A local user can be created for legitimate purposes
level: medium