title: Potential Defense Evasion via Addition of Firewall Address Object - Fortinet Fortigate Firewall
id: 5c8d7b41-3812-432f-a0bb-4cfb7c31827e
status: experimental
description: Detects the addition of firewall address objects on Fortinet Fortigate Firewall.
references: https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025-02-14
tags:
    - attack.defense-evasion
    - attack.1562
logsource:
    category: firewall
detection:
    selection_action:
        fortinet.firewall.action: "Add"
    selection_path:
        fortinet.firewall.cfgpath: "firewall.address"
    condition: all of selection*
falsepositives:
    - An address could be added or deleted for legitimate purposes
level: medium
