title: Potential Persistence via User Group Modification - Fortinet Fortigate Firewall
id: 69ffc84e-8b1a-4024-8351-e018f66b8275
status: experimental
description: Detects the modification of a user group on Fortinet Fortigate Firewall. The group could be used to grant VPN access to a network.
references: https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025/02/14
tags:
  - atttack.persistence
  - attack.1098.007
logsource:
    category: firewall
detection:
    selection_action:
        fortinet.firewall.action: "Edit"
    selection_path:
        fortinet.firewall.cfgpath: "user.group"
    condition: all of selection*
falsepositives: A group can be modified for legitimate purposes
level: medium