title: Github Repo Compromise Domain MyJino RU
id: 242e0911-294a-44ea-a54e-7eea97aa2622
status: test
description: Detects connections to the host used in a big repository compromise discovered in August 2022
references:
   - https://twitter.com/stephenlacy/status/1554697077430505473
date: 2022/08/03
author: Florian Roth
logsource:
    product: linux
    category: network_connection
detection:
    selection:
        DestinationHostname: 'ovz1.j19544519.pr46m.vps.myjino.ru'
    condition: selection
falsepositives:
    - Users looking up that domain after reading the report (unlikely)
level: high
