title: Detecting Reverse Shell on Linux System
id: 6104e693-a7d6-4891-86cb-49a258523559
status: experimental
description: Detects reverse shell actions on Linux systems using different languages.
references:
      - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
      - https://www.revshells.com/
author: '@d4ns4n_'
date: 2023/04/07
tags:
   - attack.initial_access
   - attack.t1133      
logsource:
   category: network_connection
   product: linux
detection:
    selection_bs:
        Image|endswith: 'bin/bash'
        ProcessArgs: '-i'
    selection_py:
        Image|contains: 'python'
        ProcessArgs: '-c'
        ProcessArgs|contains: 'connect'
    selection_php:
        Image|contains: 'php'
        ProcessArgs: '-r'
        ProcessArgs|contains: 'fsockopen'
    selection_nc:
        Image|contains: 'nc'
        ProcessArgs: 
            - '-r'
            - '-e'
        ProcessArgs|contains: '/bin/sh'
    selection_pl:
        Image|contains: 'perl'
        ProcessArgs: '-e'
        ProcessArgs|contains|all: 
            - 'Socket'
            - '$p='
        ProcessArgs|contains:
            - '$i='
            - 'PeerAddr'
    selection_rb:
        Image|contains: 'ruby'
        ProcessArgs|startswith: '-rsocket -e'
        ProcessArgs|contains:
            - 'TCPSocket.new'
            - 'TCPSocket.open'
    selection_xt:
        Image|contains: 'xterm'
        ProcessArgs|contains: '-display'
        ProcessArgs|endswith: ':1'
    condition: 1 of selection*
falsepositives:
    - Legitimate use of these patterns
level: high