title: RedTail Cryptominer User-Agent
id: 6fd25dd1-527b-47c8-baa4-2a0e77279c6f
status: experimental
description: Detects inbound web requests using the "libredtail-http" User-Agent associated with RedTail cryptominer activity.
references:
    - https://isc.sans.edu/diary/Danger+of+Libredtail+Guest+Diary/32936/
author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-04-30
tags:
    - attack.initial-access
    - attack.t1190
logsource:
    category: webserver
detection:
    selection:
        cs-user-agent: 'libredtail-http'
    condition: selection
falsepositives:
    - Unknown
level: medium
