title: Antivirus Ransomware Detection
id: 4c6ca276-d4d0-4a8c-9e4c-d69832f8671f
status: experimental
description: Detects a highly relevant Antivirus alert that reports ransomware
references:
    - https://www.nextron-systems.com/?s=antivirus
author: Florian Roth
date: 2022/05/12
modified: 2022/10/24
tags:
    - attack.t1486
logsource:
    category: antivirus
detection:
    selection:
        Signature|contains:
            - 'Ransom'
            - 'Filecoder'
    condition: selection
falsepositives:
    - Unlikely
level: critical
