title: Data Compression for Exfiltration
description: This rule detects potential exfiltration by looking for a few compression extensions in the uri and signs of compression in the mime type, file type, and http body
id: 49336e86-c371-4884-a8db-dfed58e487c0
date: 2020/04/05
author: Greg Howell, OTR (Open Threat Research)
tags:
    - attack.exfiltration
    - attack.t1560.001
    - attack.t1005
references:
    - https://github.com/OTRF/detection-hackathon-apt29/issues/17
logsource:
    product: zeek
    service:
        - files
        - http
detection:
    selection1:
        uri:
         - '*.7z'
         - '*.zip'
         - '*.rar'
    selection2:
        mime_types: '*compressed'
    selection3:
        filetype: '*compressed'
    selection4:
        http.bodyMagic: '*compressed'
    selection5:
        id_resp_h: 
        - 192.168.0.0/16
        - 172.16.0.0/12
        - 10.0.0.0/8
    condition: selection1 and selection2 or selection3 or selection4 and not selection5
falsepositives:
    - nothing observed so far
level: high
