title: DNS Events Related To Mining Pools
id: bf74135c-18e8-4a72-a926-0e4f47888c19
description: Identifies IPs that may be performing DNS lookups associated with common currency mining pools.
references:
  - Azure Sentinel
date: 2021/08/15
author: Saw Winn Naung
level: medium
logsource:                     
    service: dns  
    product: zeek 
tags:
  - attack.t1035
  - attack.t1496
detection:
    selection:
        query:
            - 'monerohash.com' 
            - 'do-dear.com'
            - 'xmrminerpro.com'
            - 'secumine.net'
            - 'xmrpool.com'
            - 'minexmr.org'
            - 'hashanywhere.com'
            - 'xmrget.com'
            - 'mininglottery.eu'
            - 'minergate.com'
            - 'moriaxmr.com'
            - 'multipooler.com'
            - 'moneropools.com'
            - 'xmrpool.eu'
            - 'coolmining.club'
            - 'supportxmr.com'
            - 'minexmr.com'
            - 'coinfoundry.org'
            - 'cryptoknight.cc'
            - 'fairhash.org'
            - 'baikalmine.com'
            - 'tubepool.xyz'
            - 'fairpool.xyz'
            - 'asiapool.io'
    condition: selection
fields:
    - clientip
