title: Bloodhound RPC Connections
id: 87b4483e-ee3a-47d9-a9d0-81bacdc60486
description: Detects NetrWkstaUserEnum RPC commands from Blookhound
status: experimental
author: Michael Wade @savvyspoon
references:
    - https://github.com/BloodHoundAD/BloodHound
    - https://github.com/BloodHoundAD/SharpHound
date: 2020/09/01
tags:
    - attack.discovery
    - attack.t1087.002
logsource:
    product: zeek
    service: dce_rpc
detection:
    selection: 
        operation: NetrWkstaUserEnum 
    timeframe: 1h
    condition: selection | count() by src_ip > 100
falsepositives:
    - High traffic AD Controllers
level: high

