title: Potential Active Directory Reconnaissance/Enumeration Via LDAP - Zeek
id: 2aad82b0-edd0-4d32-8c63-c168b86823b2
related:
    - id: 31d68132-4038-47c7-8f8e-635a39a7c174
      type: similar
status: experimental
description: Detects LDAP queries that contain suspicious filters, which may indicate potential Active Directory enumeration.
author: AAtashGar
date: 2025-07-28
logsource:
    product: zeek
detection:
    selection:
        filter|contains:
            - '(groupType:1.2.840.113556.1.4.803:=2147483648)'
            - '(groupType:1.2.840.113556.1.4.803:=2147483656)'
            - '(groupType:1.2.840.113556.1.4.803:=2147483652)'
            - '(groupType:1.2.840.113556.1.4.803:=2147483650)'
            - '(sAMAccountType=805306369)'
            - '(sAMAccountType=805306368)'
            - '(sAMAccountType=536870913)'
            - '(sAMAccountType=536870912)'
            - '(sAMAccountType=268435457)'
            - '(sAMAccountType=268435456)'
            - '(objectCategory=groupPolicyContainer)'
            - '(objectCategory=organizationalUnit)'
            - '(objectCategory=nTDSDSA)'
            - '(objectCategory=server)'
            - '(objectCategory=domain)'
            - '(objectCategory=person)'
            - '(objectClass=trustedDomain)'
            - '(primaryGroupID=521)'
            - '(primaryGroupID=516)'
            - '(primaryGroupID=515)'
            - '(primaryGroupID=512)'
            - 'Domain Admins'
            - 'admincount=1'
            - 'objectGUID=\*'
            - '(schemaIDGUID=\*)'
    condition: selection
falsepositives:
    - Legitimate administrative activity
level: low
