title: DNS Events Related To Mining Pools
id: bf74135c-18e8-4a72-a926-0e4f47888c19
description: Identifies IPs that may be performing DNS lookups associated with common currency mining pools.
references:
  - https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDNS_Miners.yaml
date: 2021/08/19
author: Saw Winn Naung , Azure-Sentinel
level: medium
logsource:                     
    service: dns  
    product: zeek 
tags:
  - attack.t1035
  - attack.t1496
detection:
    selection:
        query:
            - "monerohash.com"
            - "do-dear.com"
            - "xmrminerpro.com"
            - "secumine.net"
            - "xmrpool.com"
            - "minexmr.org"
            - "hashanywhere.com"
            - "xmrget.com"
            - "mininglottery.eu"
            - "minergate.com"
            - "moriaxmr.com"
            - "multipooler.com"
            - "moneropools.com"
            - "xmrpool.eu"
            - "coolmining.club"
            - "supportxmr.com"
            - "minexmr.com"
            - "hashvault.pro"
            - "xmrpool.net"
            - "crypto-pool.fr"
            - "xmr.pt"
            - "miner.rocks"
            - "walpool.com"
            - "herominers.com"
            - "gntl.co.uk"
            - "semipool.com"
            - "coinfoundry.org"
            - "cryptoknight.cc"
            - "fairhash.org"
            - "baikalmine.com"
            - "tubepool.xyz"
            - "fairpool.xyz"
            - "asiapool.io"
            - "coinpoolit.webhop.me"
            - "nanopool.org"
            - "moneropool.com"
            - "miner.center"
            - "prohash.net"
            - "poolto.be"
            - "cryptoescrow.eu"
            - "monerominers.net"
            - "cryptonotepool.org"
            - "extrmepool.org"
            - "webcoin.me"
            - "kippo.eu"
            - "hashinvest.ws"
            - "monero.farm"
            - "supportxmr.com"
            - "xmrpool.eu"
            - "linux-repository-updates.com"
            - "1gh.com"
            - "dwarfpool.com"
            - "hash-to-coins.com"
            - "hashvault.pro"
            - "pool-proxy.com"
            - "hashfor.cash"
            - "fairpool.cloud"
            - "litecoinpool.org"
            - "mineshaft.ml"
            - "abcxyz.stream"
            - "moneropool.ru"
            - "cryptonotepool.org.uk"
            - "extremepool.org"
            - "extremehash.com"
            - "hashinvest.net"
            - "unipool.pro"
            - "crypto-pools.org"
            - "monero.net"
            - "backup-pool.com"
            - "mooo.com"
            - "freeyy.me"
            - "cryptonight.net"
            - "shscrypto.net"
    condition: selection
fields:
    - clientip
