title: DNS TOR Proxies
id: a8322756-015c-42e7-afb1-436e85ed3ff5
description: Identifies IPs performing DNS lookups associated with common Tor proxies.
references:
  - Azure Sentinel
date: 2021/08/15
author: Saw Winn Naung
level: medium
logsource: 
    service: dns  
    product: zeek 
tags:
  - attack.t1048
detection:
    selection:
        query:
            - 'tor2web.*' 
            - 'onion.*'
            - '*tor-gateways*'
    condition: selection
fields:
    - clientip
