title: Suspicious Mail Forwarding
id: c726e007-2cd0-4a55-abfb-79730fbedee5
status: experimental
description: Detects suspicious email forwarding or redirecting in O365 Audit logs.
references:
    - https://redcanary.com/blog/email-forwarding-rules/
author: Harjot Singh @cyb3rjy0t
date: 2023/04/13
tags:
    - attack.exfiltration
    - attack.t1020
logsource:
    service: audit
    product: m365
detection:
    selection_1:
        Operation|contains: 'UpdateInboxRules'
        OperationProperties.Value|contains:
            - 'Forward'
            - 'Recipients'
    selection_2:
        Operation|contains: 'Set-Mailbox'
        Parameters|contains:
            - 'ForwardingSmtpAddress'
            - 'ForwardingAddress'
    selection_3:
        Operation|contains:
            - 'New-InboxRule'
            - 'Set-InboxRule'
        Parameters|contains:
            - 'ForwardTo'
            - 'ForwardAsAttachmentTo'
            - 'RedirectTo'
    condition: 1 of selection_*
falsepositives:
    - Legit Mail Forwarding rules
level: high
