title: Suspicious Inbox Forwarding
id: 6c220477-0b5b-4b25-bb90-66183b4089e8
status: experimental
description: Detects when a Microsoft Cloud App Security reported suspicious email forwarding rules, for example, if a user created an inbox rule that forwards a copy of all emails to an external address.
author: Austin Songer @austinsonger
date: 2021/08/22
references:
    - https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
    - https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
logsource:
    category: ThreatManagement
    service: m365
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: "Suspicious inbox forwarding"
        status: success
    condition: selection
falsepositives:
    - Unknown
level: low
tags:
    - attack.exfiltration
    - attack.t1020
