title: Microsoft 365 - Unusual Volume of File Deletion
id: 78a34b67-3c39-4886-8fb4-61c46dc18ecd
status: experimental
description: Detects when a Microsoft Cloud App Security reported a user has deleted a unusual a large volume of files.
author: austinsonger
date: 2021/08/19
references:
    - https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
    - https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
logsource:
    category: ThreatManagement
    service: Microsoft365
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: "Unusual volume of file deletion"
        status: success
    condition: selection
falsepositives:
    - 
level: medium
tags:
    - attack.impact
    - attack.t1485
