title: Microsoft 365 - Activity performed by terminated user
id: 2e669ed8-742e-4fe5-b3c4-5a59b486c2ee
status: experimental
description: Detects when a Microsoft Cloud App Security reported 
author: Austin Songer @austinsonger
date: 2021/08/23
references:
    - https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
    - https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
logsource:
    category: ThreatManagement
    service: m365
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: "Activity performed by terminated user"
        status: success
    condition: selection
falsepositives:
    - 
level: medium
tags:
    - attack.exfiltration
    - attack.t1537