title: Microsoft 365 - Suspicious OAuth app file download activities
id: ee111937-1fe7-40f0-962a-0eb44d57d174
status: experimental
description: Detects when a Microsoft Cloud App Security reported 
author: Austin Songer @austinsonger
date: 2021/08/22
references:
    - https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
    - https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
logsource:
    category: 
    service: m365
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: "Suspicious OAuth app file download activities"
        status: success
    condition: selection
falsepositives:
    - 
level: medium
tags:
    - attack.initial_access
    - 