title: PST Export Alert
id: 18b88d08-d73e-4f21-bc25-4b9892a4fdd0
status: experimental
description: Alert on when a user has performed an eDiscovery search or exported a PST file from the search. This PST file usually has sensitive information including email body content
references:
    - https://attack.mitre.org/techniques/T1114/
author: 'Sorina Ionescu'
date: 2022/02/08
tags:
    - attack.collection
    - attack.t1114
logsource:
    service: threat_management
    product: m365
detection:
    selection:
        eventSource: SecurityComplianceCenter
        eventName: 'eDiscovery search started or exported'
        status: success
    condition: selection
falsepositives:
    - PST export can be done for legitimate purposes but due to the sensitive nature of its content it must be monitored.
level: medium
