title: Disabling Multi Factor Authenication
id: 60de9b57-dc4d-48b9-a6a0-b39e0469f876
status: experimental
description: Detects disabling of Multi Factor Authencation in O365 Audit logs.
references:
    - https://research.splunk.com/cloud/c783dd98-c703-4252-9e8a-f19d9f5c949e/
    - https://attack.mitre.org/techniques/T1556/
author: Harjot Singh @cyb3rjy0t
date: 2023/08/28
tags:
    - attack.persistence
    - attack.t1556
logsource:
    service: audit
    product: m365
detection:
    selection:
        Operation|contains: 'Disable Strong Authenication.'
    condition: selection
falsepositives:
    - Legit MFA disabling
level: high
