title: Suspicious Use of /dev/tcp
id: 6cc5fceb-9a71-4c23-aeeb-963abe0b279c
status: experimental
description: Detects suspicious command with /dev/tcp
author: frack113
references:
  - https://www.andreafortuna.org/2021/03/06/some-useful-tips-about-dev-tcp/
date: 2021/12/10
logsource:
  product: linux
detection:
  keyword:
    - 'cat </dev/tcp/'
    - 'exec 3<>/dev/tcp/'
    - 'echo >/dev/tcp/'
  condition: 1 of keyword
falsepositives:
  - Unknown
level: low
tags:
  - attack.reconnaissance
