title: Clear Command History
id: fdc88d25-96fb-4b7c-9633-c0e417fdbd4e
status: experimental
description: Clear command history in linux which is used for defense evasion.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.003/T1070.003.md
    - https://attack.mitre.org/techniques/T1070/003/
    - https://www.hackers-arise.com/single-post/2016/06/20/Covering-your-BASH-Shell-Tracks-AntiForensics
author: Patrick Bareiss
date: 2019/03/24
modified: 2021/11/24
tags:
    - attack.defense_evasion
    - attack.t1070.003
logsource:
    product: linux
detection:
    keywords:
        - 'rm *bash_history'
        - 'echo "" > *bash_history'
        - 'cat /dev/null > *bash_history'
        - 'cat /dev/zero > *bash_history'
        - 'ln -sf /dev/null *bash_history'
        - 'ln -sf /dev/zero *bash_history'
        - 'truncate -s0 *bash_history'
        # - 'unset HISTFILE'  # prone to false positives
        - 'export HISTFILESIZE=0'
        - 'history -c'
        - 'history -w'
        - 'shred *bash_history'
        - 'empty_bash_history'
        - 'chattr +i *bash_history'
    condition: keywords
falsepositives:
    - Unknown
level: high
