title: Moriya Rootkit
id: a1507d71-0b60-44f6-b17c-bf53220fdd88
related:
    - id: 25b9c01c-350d-4b95-bed1-836d04a4f324
      type: derived
description: Detects the use of Moriya rootkit as described in the securelist's Operation TunnelSnake report
status: experimental
author: Bhabesh Raj
date: 2021/05/06
modified: 2021/09/21
references:
    - https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1543.003
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename: 'C:\Windows\System32\drivers\MoriyaStreamWatchmen.sys'
    condition: selection
level: critical
falsepositives:
    - None