title: ISO or Image Mount Indicator in Recent Files
id: 4358e5a5-7542-4dcb-b9f3-87667371839b
description: Detects the creation of recent element file that points to an .ISO or .IMG file as often used in phishing attacks. This can be a false positive on server systems but on workstations users should rarely mount .iso or .img files.
status: experimental
author: Florian Roth
references:
    - https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
    - https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
    - https://blog.emsisoft.com/en/32373/beware-new-wave-of-malware-spreads-via-iso-file-email-attachments/
date: 2022/02/11
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: 
            - '.iso.lnk'
            - '.img.lnk'
        TargetFilename|contains:
            - '\Microsoft\Windows\Recent\'
    condition: selection
falsepositives:
    - Cases in which a user mounts an image file for legitimate reasons
level: medium
