title: Persistence Via Notepad++ Plugins
id: 54127bd4-f541-4ac3-afdb-ea073f63f692
description: Detects creation of new ".dll" files inside the plugins directory of a notepad++ installation by a process other than "gup.exe". Which could indicates possible persistence
status: experimental
author: Nasreddine Bencherchali
references:
    - https://pentestlab.blog/2022/02/14/persistence-notepad-plugins/
date: 2022/06/10
modified: 2022/06/21
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|contains: '\Notepad++\plugins\'
        TargetFilename|endswith: '.dll'
    filter_gup:
        Image|endswith: '\Notepad++\updater\gup.exe'
    filter_install:
        # This filter is for Sigma dataset you could remove it or change when using the rule in your own env
        Image|startswith: 'C:\Users\'
        Image|contains: '\AppData\Local\Temp\'
        Image|endswith: '\target.exe'
    condition: selection and not 1 of filter*
falsepositives:
    - Possible FPs during first installation of Notepad++
    - Legitimate use of custom plugins to enhance notepad++ functionality by users
level: medium
tags:
    - attack.persistence
