title: Copying Suspicious Files To Default GPO Folder
id: 5f87308a-0a5b-4623-ae15-d8fa1809bc60
status: experimental
level: medium
description: Copying suspicious files (EXE/DLL) to the default GPO storage folder
references:
    - https://redcanary.com/blog/intelligence-insights-november-2021/
author: elhoim
date: 2022/04/28
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|contains: '\Policies\{31B2F340-016D-11D2-945F-00C04FB984F9}\'
        TargetFilename|endswith:
            - '.dll'
            - '.exe'
    condition: selection
falsepositives:
    - Unknown
tags:
    - attack.t1036.005
    - attack.defense_evasion
