title: Creation In User Word Statup Folder
id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
status: experimental
description: Detects the creation of an file in user Word Startup
author: frack113
references:
  - Malware Sandbox https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
date: 2022/06/05
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: '\AppData\Roaming\Microsoft\Word\STARTUP\'
  condition: selection
falsepositives:
  - Addition of legitimate plugins
level: medium
tags:
  - attack.resource_development
  - attack.t1587.001
