title: Sideloading Path with Space
id: b6f91281-20aa-446a-b986-38a92813a18f
status: experimental
description: Drop a ddl in 'C:\Windows \' to sideloading it 
references:
    - https://twitter.com/cyb3rops/status/1552932770464292864
author: frack113
date: 2022/07/30
logsource:
     category: file_event
     product: windows
detection:
    selection:
        TargetFilename|startswith: 'C:\Windows \'
        TargetFilename|endswith: '.dll'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1574.002 
