title: Create Suspicious EVTX
id: 65236EC7-ACE0-4F0C-82FD-737B04FD4DCB
status: experimental
description: Detects create new suspicious evtx files.
references:
    - not found
author: D3F7A5105
date: 2022/12/31
logsource:
    category: file_event
    product: windows
    definition: Check your sysmon configuration for monitoring Eventid 11. Added <TargetFilename condition="end with">.evtx<TargetFilename>
detection:
    selection:
        TargetFilename|endswith: '.evtx'
    filter1:
        Details|contains: 'Windows\System32\WinEVT\Logs\'
    filter2:
        Image: "C:\\Windows\\Explorer.EXE"
    filter3:
        Image: "C:\\Windows\\system32\\DllHost.exe"
    condition: selection and not filter1 and not filter2 and not filter3
falsepositives: Admin activity
level: high
tags:
    - attack.defense_evasion
    - attack.t1562.002