title: Suspicious RTLO executable
id: FEEC2601-DE02-4E76-984A-EFF48A8A452F
description: Detects an executable being written to disk or executed where a right-to-left-override character in the file name is written in a way that can mislead users to believe it has a different extension
status: experimental
author: ag-michael
references:
    - https://attack.mitre.org/techniques/T1036/002/
date: 2022/02/06
tags:
    - attack.defense_evasion
    - attack.t1036.002
logsource:
    product: windows
    category: file_event,process_creation
detection:
    selection1:
        TargetFilename|re: '.*‮[\w\d]{2,5}\.(exe|bat|js|vbs|hta|vbe|jse|sct|wsf|xsl|cpl|xll)'
    selection2:
        CommandLine|re: '.*‮[\w\d]{2,5}\.(exe|bat|js|vbs|hta|vbe|jse|sct|wsf|xsl|cpl|xll)'
    condition: selection1 or selection2
falsepositives:
    - Unknown
level: low
tags: 
    - attack.t1036.002

