title: Unusual File Creation by dns.exe
id: e805f059-82ad-4720-86a0-7ab947771f41
status: experimental
author: Tim Rauch
date: 2022/09/27
description: Detects an unexpected file being created by dns.exe which my indicate activity related to remote code execution or other forms of exploitation
references:
    - https://www.elastic.co/guide/en/security/current/unusual-file-modification-by-dns.exe.html
tags:
    - attack.initial_access
    - attack.t1133
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: '\dns.exe'
    selection_not:
        TargetFilename|endswith: '\dns.log'
    condition: selection and not selection_not
falsepositives:
    - Unknown
level: high
