title: PowerShell Writing Startup Shortcuts
id: 92fa78e7-4d39-45f1-91a3-8b23f3f1088d
description: Attempts to detect PowerShell writing startup shortcuts.
status: experimental
references: 
    - https://redcanary.com/blog/intelligence-insights-october-2021/
    # We frequently observe adversaries using PowerShell to write malicious .lnk files into the startup directory to establish persistence. 
    # Accordingly, this detection opportunity is likely to identify persistence mechanisms in multiple threats. 
    # In the context of Yellow Cockatoo, this persistence mechanism eventually launches the command-line script that leads to the installation of a malicious DLL"
notes: 
    - Atomic Test is avaiable. Copy and Paste the command into an elevated PowerShell to generate logs, then run the cleanup step.
        https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1547.001/T1547.001.md#atomic-test-7---add-executable-shortcut-link-to-user-startup-folder

    - Current SIGMA rule "Startup folder File Write" does not cover this activity, as it looks in the \ProgramData\ file path and not \AppData\.
        https://github.com/SigmaHQ/sigma/blob/master/rules/windows/file_event/sysmon_startup_folder_file_write.yml
tags:
    - attack.registry_run_keys_/_startup_folder
    - attack.t1547.001
date: 2021/10/24
author: Christopher Peacock '@securepeacock', SCYTHE
level: high
logsource:
    product: windows
    category: file_event
detection:
    selection:
        Image|endswith: '\powershell.exe'
        TargetFilename|contains: '\start menu\programs\startup\'
        TargetFilename|endswith: '.lnk'
    condition: selection
falsepositives:
    - Unknown
    - Depending on your environment accepted applications may leverage this at times. It is recomended to search for anomolies inidicative of malware.
