title: Typical HiveNightmare SAM File Export
id: 6ea858a8-ba71-4a12-b2cc-5d83312404c7
status: experimental
description: Detects files written by the different tools that exploit HiveNightmare
author: Florian Roth
date: 2020/07/23
references:
    - https://github.com/GossiTheDog/HiveNightmare
    - https://github.com/FireFart/hivenightmare/
logsource:
    product: windows
    category: file_event
tags:
    - cve.2021-36934
    - attack.credential_access
    - attack.t1552.001
detection:
    selection:
        TargetFilename|contains: 
            - '\hive_sam_'  # Go version
            - '\SAM-2021-'  # C++ version
            - '\Sam.save'   # PowerShell version
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Files that accidentally contain these strings 
level: high
