title: Unusual File Download from File Sharing Domain
id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
status: experimental
description: Detects the download of suspicious file type from URLs with IP
author: Nasreddine Bencherchali
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
date: 2022/09/07
logsource:
    product: windows
    category: create_stream_hash
detection:
    selection_domain:
        Contents|contains:
            - '1.'
            - '2.'
            - '3.'
            - '4.'
            - '5.'
            - '6.'
            - '7.'
            - '8.'
            - '9.'
    selection_extension:
        TargetFilename|contains:
            - '.ps1:Zone'
            - '.bat:Zone'
            - '.exe:Zone'
            - '.vbe:Zone'
            - '.vbs:Zone'
            - '.dll:Zone'
            - ':Zone' # No extension
    condition: all of selection*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1564.004
