title: Unusual File Download From File ZIP Domain
id: 0bb4bbeb-fe52-4044-b40c-430a04577ebe
status: experimental
description: Detects the download of a relevant file type from a .zip domain 
references:
    - https://twitter.com/cyb3rops/status/1659175181695287297
    - https://fabian-voith.de/2020/06/25/sysmon-v11-1-reads-alternate-data-streams/
author: Florian Roth (Nextron Systems)
date: 2023/05/18
tags:
    - attack.defense_evasion
    - attack.s0139
    - attack.t1564.004
logsource:
    product: windows
    category: create_stream_hash
    definition: 'Requirements: Sysmon config - FileCreateStreamHash events have to be included'
detection:
    selection_domain:
        Contents|contains: '.zip/'
    selection_extension:
        TargetFilename|contains:
            - '.exe:Zone'
            - '.vbs:Zone'
            - '.bat:Zone'
            - '.rar:Zone'
            - '.ps1:Zone'
            - '.doc:Zone'
            - '.docm:Zone'
            - '.xls:Zone'
            - '.xlsm:Zone'
            - '.pptm:Zone'
            - '.rtf:Zone'
            - '.hta:Zone'
            - '.dll:Zone'
            - '.ws:Zone'
            - '.wsf:Zone'
            - '.sct:Zone'
            - '.zip:Zone'
    condition: all of selection*
fields:
    - TargetFilename
    - Image
falsepositives:
    - Legitimate file downloads from a web service that uses the new .zip domain 
level: high
