title: Reddit API Request
id: c64c5175-5189-431b-a55e-6d9882158251
status: test
description: Detects suspicious DNS queries to reddit.com and oauth.reddit.com used by Reddit Bots of any kind and also the Reddit C2 framework.
references:
    - https://core.telegram.org/bots/faq
    - https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/
    - https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/
    - https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/
author: Gavin Knapp (Bridewell Consulting)
date: 2018/06/05
modified: 2022/10/09
tags:
    - attack.command_and_control
    - attack.t1102.002
logsource:
    category: dns
detection:
    selection:
        query:
            - 'oauth.reddit.com'   # Reddit oauth request for API
            - 'reddit.com' #If Reddit is not allowed or expected this may be viable. If widely used it may introduce too much noise.
    condition: selection
falsepositives:
    - Legitimate use of Reddit in the company
level: low
