title: DNS Lookup Github Repo Compromise Domain MyJino RU
id: 6b0dd2e4-13ff-4eff-b79b-4444fad43644
status: test
description: Detects connections to the host used in a big repository compromise discovered in August 2022
references:
   - https://twitter.com/stephenlacy/status/1554697077430505473
date: 2022/08/03
author: Florian Roth
logsource:
    category: dns
detection:
    selection:
        query: 'ovz1.j19544519.pr46m.vps.myjino.ru'
    condition: selection
falsepositives:
    - Users looking up that domain after reading the report (unlikely)
    - Web proxy or other security device DNS lookups of the domain
level: high
