title: Potential Wildcard DNS Service Usage
id: 139ddcb3-ba90-4407-b0b1-1838131ce8e7
status: experimental
description: Detects DNS queries to public wildcard DNS services that resolve subdomains to IP addresses. These services can be abused by attackers for command and control, tunneling, phishing.
references:
    - https://nip.io/
    - https://sslip.io/
    - https://traefik.me/
    - https://businessinsights.bitdefender.com/deep-dive-into-a-fin8-attack-a-forensic-investigation
author: MahirAli Khan (in/mahiralikhan)
date: 2026/03/24
tags:
    - attack.command_and_control
    - attack.t1071.004
    - attack.command_and_control
    - attack.T1102
logsource:
    category: dns
detection:
    selection:
        QueryName|endswith:
            - '.nip.io'
            - '.sslip.io'
            - '.traefik.me'
            - '.backname.io'
            - '.xip.io'
    condition: selection
falsepositives:
    - Legitimate development and testing environments
    - Developers using these services for local development
    - Authorized penetration testing activities
    - CI/CD pipelines using dynamic DNS services
level: medium
