title: Suspicious Get Local Groups Information - PowerShell
id: fa6a5a45-3ee2-4529-aa14-ee5edc9e29cb
status: test
description: |
    Adversaries may attempt to find local system groups and permission settings.
    The knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.
    Adversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
author: frack113
date: 2021-12-12
modified: 2025-08-13
tags:
    - attack.discovery
    - attack.t1069.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    test_localgroup:
        ScriptBlockText|contains:
            - 'get-localgroup'
            - 'get-localgroupmember'
    test_wmi_win32_group:
        ScriptBlockText|contains|all:
            - 'get-wmiobject'
            - 'win32_group'
    test_wmi_win32_group_alias:
        ScriptBlockText|contains|all:
            - 'gwmi'
            - 'win32_group'
    test_cim_win32_group:
        ScriptBlockText|contains|all:
            - 'get-ciminstance'
            - 'win32_group'
    test_cim_win32_group_alias:
        ScriptBlockText|contains|all:
            - 'gcim'
            - 'win32_group'
    test_wmi_groupuser:
        ScriptBlockText|contains|all:
            - 'get-wmiobject'
            - 'win32_groupuser'
    test_wmi_groupuser_alias:
        ScriptBlockText|contains|all:
            - 'gwmi'
            - 'win32_groupuser'
    test_cim_groupuser:
        ScriptBlockText|contains|all:
            - 'get-ciminstance'
            - 'win32_groupuser'
    test_cim_groupuser_alias:
        ScriptBlockText|contains|all:
            - 'gcim'
            - 'win32_groupuser'
    condition: 1 of test_*
falsepositives:
    - Inventory scripts or admin tasks
level: low
