title: Powershell Trigger Profiles by Add_Content
id: 05b3e303-faf0-4f4a-9b30-46cc13e69152
status: experimental
author: frack113
date: 2021/08/18
modified: 2021/10/16
description: Adversaries may gain persistence and elevate privileges by executing malicious content triggered by PowerShell profiles.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.013/T1546.013.md
tags:
    - attack.privilege_escalation
    - attack.t1546.013
logsource:
    product: windows
    category: ps_script
    definition: Script block logging must be enabled
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'Add-Content'
            - '$profile'
            - '-Value'
        ScriptBlockText|contains:
            - 'Start-Process'
            - '""'  #cleanup action
    condition: selection
falsepositives:
    - Unknown
level: medium
