title: Suspicious Get Information for SMB Share
id: 95f0643a-ed40-467c-806b-aac9542ec5ab
description: |
  Adversaries may look for folders and drives shared on remote systems as a means of identifying sources of information to gather as a precursor for Collection and
  to identify potential systems of interest for Lateral Movement.
  Networks often contain shared network drives and folders that enable users to access file directories on various systems across a network. 
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.002/T1069.002.md
status: experimental
author: frack113
date: 2021/12/15
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        ScriptBlockText|contains: get-smbshare
    condition: selection
falsepositives:
    - unknown
level: low
tags:
    - attack.discovery
    - attack.t1069.001