title: Clear PowerShell History - PowerShell
id: 26b692dc-1722-49b2-b496-a8258aa6371d
related:
    - id: dfba4ce1-e0ea-495f-986e-97140f31af2d
      type: derived
status: experimental
description: Detects keywords that could indicate clearing PowerShell history
references:
    - https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2022/01/25
modified: 2023/05/19
tags:
    - attack.defense_evasion
    - attack.t1070.003
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_1a:
        ScriptBlockText|contains:
            - 'del'
            - 'Remove-Item'
            - 'rm'
    selection_1b:
        ScriptBlockText|contains: '(Get-PSReadlineOption).HistorySavePath'
    selection_2a:
        ScriptBlockText|contains|all:
            - 'Set-PSReadlineOption'
            - 'SaveNothing'
    selection_2b:
        ScriptBlockText|contains: # not sure if the homoglyph –/- is intended, just checking for both
            - '-HistorySaveStyle'
            - '–HistorySaveStyle'
    condition: all of selection_1* or all of selection_2*
falsepositives:
    - Legitimate PowerShell scripts
level: medium
