title: PowerShell Reverse-Shell Using Hoaxshell 
id: 34949d3a-0684-4300-9ab1-2a50daf920fb
status: experimental
description: Detects Hoaxshell Windows PowerShell reverse-shell (HTTPS Payload) which uses self-signed X509 certificate.
references:
    - https://github.com/t3l3machus/hoaxshell/blob/09b134379388712887de41bda5e41b12e6a56fd5/https_payload.ps1
author: Isa AlMannaei
date: 2022/08/11
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enable
detection:
    selection:
        ScriptBlockText|contains|all:
            - 'System.Security.Cryptography.X509Certificates'
            - 'TrustAllCertsPolicy'
            - '-Headers'
            - 'System.Text.Encoding'
            - 'Invoke-WebRequest'
            - 'iwr'
            - 'POST'
    condition: selection
falsepositives:
    - Unknown
level: high
