title: Windows Firewall Disabled via PowerShell
id: dd37cc20-c8bb-451d-ac69-5889d73bbb1b
related:
    - id: 12f6b752-042d-483e-bf9c-915a6d06ad75
      type: similar
status: experimental
description: Detects that the Windows Firewall is disabled using PowerShell
references:
    - https://www.elastic.co/guide/en/security/current/windows-firewall-disabled-via-powershell.html
author: Tim Rauch
date: 2022/09/14
logsource:
    category: ps_script
    product: windows
tags:
    - attack.defense_evasion
    - attack.t1562
detection:
    selection_args:
        ScriptBlockText|contains|all:
            - 'Set-NetFirewallProfile'
            - '-Enabled'
            - 'False'
    selection_opt:
        ScriptBlockText|contains:
            - '-All'
            - 'Public'
            - 'Domain'
            - 'Private'
    condition: all of selection*
falsepositives:
    - Unknown
level: medium