title: Potential PowerShell Obfuscation Using Alias Cmdlets
id: 96cd126d-f970-49c4-848a-da3a09f55c55
related:
    - id: e8314f79-564d-4f79-bc13-fbc0bf2660d8
      type: derived
status: test
description: Detects Set-Alias or New-Alias cmdlet usage. Which can be use as a mean to obfuscate PowerShell scripts
references:
    - https://github.com/1337Rin/Swag-PSO
author: frack113
date: 2023-01-08
modified: 2025-09-22
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1027
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains:
            - 'Set-Alias '
            - 'New-Alias '
    filter_main:
        ScriptBlockText|contains:
            - ' -Name ncms -Value New-CimSession '
            - ' -Name gcls -Value Get-CimClass '
            - ' -Name ncso -Value New-CimSessionOption '
            - ' -Name gcms -Value Get-CimSession '
            - ' -Name rcms -Value Remove-cimSession '
            - ' -Name rcie -Value Register-CimIndicationEvent '
            - ' -Name gcai -Value Get-CimAssociatedInstance '
            - ' -Name gcim -Value Get-CimInstance '
            - ' -Name scim -Value Set-CimInstance '
            - ' -Name ncim -Value New-CimInstance '
            - ' -Name rcim -Value Remove-cimInstance '
            - ' -Name icim -Value Invoke-CimMethod '
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: low
