title: Clearing Windows Console History
id: bde47d4b-9987-405c-94c7-b080410e8ea7
status: test
description: Identifies when a user attempts to clear console history. An adversary may clear the command history of a compromised account to conceal the actions undertaken during an intrusion.
references:
    - https://stefanos.cloud/blog/kb/how-to-clear-the-powershell-command-history/
    - https://www.shellhacks.com/clear-history-powershell/
    - https://community.sophos.com/sophos-labs/b/blog/posts/powershell-command-history-forensics
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/remove-item?view=powershell-7.5
author: Austin Songer @austinsonger
date: 2021-11-25
modified: 2026-05-11
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1070.003
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection_clear_history:
        ScriptBlockText|contains: Clear-History
    selection_remove_history_file:
        ScriptBlockText|re: '(?i)(Remove-Item|rmdir|erase|\b(rm|ri|rd|del)\b)[^\r\n;|]{0,100}(ConsoleHost_history\.txt|\(Get-PSReadlineOption\)\.HistorySavePath)'
    condition: 1 of selection_*
falsepositives:
    - Legitimate administrative cleanup or scripted log rotation
level: high

