title: Suspicious Local Group Reconnaissance via PowerShell
id: 4d70b2a4-5bde-4a9d-bc1c-9c6e86c37c35
status: experimental
description: |
    Detects suspicious attempts to enumerate local groups or their members via PowerShell commands.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
author: frack113
date: 2021-12-12
modified: 2025-08-13
tags:
    - attack.discovery
    - attack.t1069.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
  # Native PowerShell LocalAccounts cmdlets
  test_localgroup:
    - ScriptBlockText|contains:
        - 'get-localgroup'
        - 'get-localgroupmember'
  test_wmi_group:
    - ScriptBlockText|contains|all:
        - 'get-wmiobject'
        - 'win32_group'
    - ScriptBlockText|contains|all:
        - 'gwmi'
        - 'win32_group'
  test_cim_group:
    - ScriptBlockText|contains|all:
        - 'get-ciminstance'
        - 'win32_group'
    - ScriptBlockText|contains|all:
        - 'gcim'
        - 'win32_group'
  test_wmi_groupuser:
    - ScriptBlockText|contains|all:
        - 'get-wmiobject'
        - 'win32_groupuser'
    - ScriptBlockText|contains|all:
        - 'gwmi'
        - 'win32_groupuser'
    - ScriptBlockText|contains|all:
        - 'get-ciminstance'
        - 'win32_groupuser'
    - ScriptBlockText|contains|all:
        - 'gcim'
        - 'win32_groupuser'
  condition: 1 of test_*
falsepositives:
    - Inventory scripts or admin tasks
level: low
