title: DomainPasswordSpray Attacks
id: 5ff65fa4-32a1-4773-90cc-6238bf784148
status: test
description: Detects performing a domain password spray using the DomainPasswordSpray tool.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1110.003/T1110.003.md
    - https://github.com/dafthack/DomainPasswordSpray
author: Mustafa Kaan Demir (mkdemir)
tags:
    - attack.execution
    - attack.t1110.003
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enabled
detection:
    selection:
        ScriptBlockText|contains:
           - 'Invoke-DomainPasswordSpray'
    selection_p1:
        ScriptBlockText|contains:
        - ' -Password'
    selection_p2:
        ScriptBlockText|contains:
        - ' -UserList'
        - ' -PasswordList'
        - ' -Domain'
        - ' -Force'
    condition: selection and (selection_p1 or selection_p2)
falsepositives:
    - Unknow
level: critical
