title: PowerShell Download Cradles
id: 987513d0-ed41-439c-8ce6-32b610b60c62
status: experimental
description: Detects download a file in powerhell
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=56
author: frack113
date: 2022/12/25
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enable
detection:
    selection_1:
        ScriptBlockText|contains: '[System.Net.WebRequest]::create'
    selection_2:
        ScriptBlockText|contains: 'Invoke-RestMethod'
    selection_3:
        ScriptBlockText|contains: 'Start*BitsTransfer'
    selection_4:
        ScriptBlockText|contains: 'WinHttp.WinHttpRequest'
    selection_5:
        ScriptBlockText|contains|all:
            - 'New-Object'
            - 'Net.Webclient'
            - '.Download'
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of the library
level: medium
