title: Obfuscated MSI Install via WindowsInstaller COM Object - PowerShell
id: 02a2c4ba-f0fc-40b5-aece-b968bfdae379
related:
    - id: 7b6a7418-3afc-11f0-aff4-000d3abf478c
      type: similar
status: experimental
description: |
    Detects obfuscated PowerShell command or script execution that attempt to install MSI packages via the Windows Installer COM object (`WindowsInstaller.Installer`).
    The technique involves manipulating strings to hide functionality, such as constructing class names using string insertion (e.g., 'indowsInstaller.Installer'.Insert(0,'W')) and correcting
    malformed URLs (e.g., converting 'htps://' to 'https://') at runtime. This behavior is commonly associated with malware loaders or droppers that aim to bypass static detection
    by hiding intent in runtime-generated strings and using legitimate tools for code execution. The use of `InstallProduct` and COM object creation, particularly combined with
    hidden window execution and suppressed UI, indicates an attempt to install software (likely malicious) without user interaction.
references:
    - https://informationsecuritybuzz.com/the-real-danger-behind-a-simple-windows-shortcut/
    - https://redcanary.com/blog/threat-intelligence/intelligence-insights-may-2025/
    - https://www.virustotal.com/gui/file/f9710b0ba4de5fa0e7ec27da462d4d2fc6838eba83a19f23f6617a466bbad457
author: Meroujan Antonyan (vx3r), Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-07-28
tags:
    - attack.defense-evasion
    - attack.t1027.010
    - attack.t1218.007
    - attack.execution
    - attack.t1059.001
logsource:
    category: ps_script
    product: windows
detection:
    selection:
        ScriptBlockText|contains|all:
            - '-ComObject'
            - '.Insert('
            - 'InstallProduct('
            - 'UILevel'
    condition: selection
falsepositives:
    - Unknown
level: high
