title: AADInternals User MFA Maniupation
id: a745e587-a0a2-437c-ae30-ce321babcea9
status: experimental
description: Detects ADDInternals tool is being used for administering or hacking Azure AD and Office 365.
references:
    - https://o365blog.com/aadinternals/
    - https://github.com/Gerenios/AADInternals
author: Austin Songer (@austinsonger)
date: 2021/10/30
update: 2021/12/19
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enable
detection:
    selection:
        ScriptBlockText|contains:
            - "Get-AADIntUserMFA"
            - "Set-AADIntUserMFA"
            - "Get-AADIntUserMFAApps"
            - "Set-AADIntUserMFAApps"
            - "Register-AADIntMFAApp"
            - "New-AADIntOTPSecret"
            - "New-AADIntOTP"
    condition: selection
tags:
    - attack.execution
    - attack.reconnaissance
    - attack.discovery
    - attack.credential_access
    - attack.impact
falsepositives:
    - Penetration testing
level: high 
