title: Azure Device No Longer Managed or Compliant
id: 542b9912-c01f-4e3f-89a8-014c48cdca7d
status: test
description: Identifies when a device in azure is no longer managed or compliant
references:
    - https://learn.microsoft.com/en-us/entra/identity/monitoring-health/reference-audit-activities#core-directory
author: Austin Songer @austinsonger
date: 2021-09-03
modified: 2022-10-09
tags:
    - attack.impact
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        properties.message:
            - Device no longer compliant
            - Device no longer managed
    condition: selection
falsepositives:
    - Administrator may have forgotten to review the device.
level: medium
