title: Suspicious Commands in RunMRU key
id: f9d091f6-f1c7-4873-a24f-050b4a02b4dd
status: test
description: |
    Detects suspicious commands in the RunMRU registry key, commonly used by threat actors who deceive users 
    into pasting and executing malicious commands in the Run dialog, often disguised as CAPTCHA verification steps    
references:
    - https://www.forensafe.com/blogs/runmrukey.html
    - https://medium.com/@shaherzakaria8/downloading-trojan-lumma-infostealer-through-capatcha-1f25255a0e71
author: Ahmed Farouk
date: 2024/10/21
tags:
    - detection.threat-hunting
    - detection.emerging-threats
    - attack.execution
logsource:
    product: windows
    category: registry_set
detection:
    selection_key:
        TargetObject|contains: 'Software\Microsoft\Windows\CurrentVersion\Explorer\RunMRU'
    
    filter_mrulist:
        TargetObject|endswith: 'MRUList'
    
    filter_generic:
        Details|contains: 'ping'
    
    condition: all of selection_* and not 1 of filter_*

falsepositives:
    - Likely
level: low
