title: Responder Tool Footprints for NTLM Credential Theft
id: 8f3a2c4e-7b9d-4d1a-9c3e-2a26128b9d2f
status: experimental
description: Detects NTLM traffic patterns indicative of Responder credential harvesting.
author: Yael Ben Yair
date: 2025/11/11
logsource:
  category: network
  service: ntlm
detection:
  domain_pattern:
    netbios_domain_name|re: '^[A-Z0-9]{4}$'
  computer_pattern:
    netbios_computer_name|re: '^WIN-[A-Z0-9]{11}$'
  dns_swap_1:
    dns_computer_name|fieldref: netbios_domain_name
  dns_swap_2:
    dns_domain_name|fieldref: netbios_computer_name
  condition: (domain_pattern or computer_pattern) or (dns_swap_1 or dns_swap_2)
level: medium
tags:
  - attack.credential-access
  - attack.collection
  - attack.t1557
