---
action: global
title: Defrag Deactivation
description: Detects the deactivation of the Scheduled defragmentation task as seen by Slingshot APT group
references:
    - https://securelist.com/apt-slingshot/84312/
tags:
    - attack.persistence
author: Florian Roth
date: 2018/03/10
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'       
detection:
    condition: selection
falsepositives:
    - Unknown
level: medium
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine: 
            - '*schtasks* /delete *Defrag\ScheduledDefrag*'
---
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'       
detection:
    selection:
        EventID: 4701
        TaskName: '\Microsoft\Windows\Defrag\ScheduledDefrag'