title: WMIExec VBS Script
description: Detects suspicious file execution by wscript and cscript
author: Florian Roth
references:
    - https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
tags:
    - attack.execution
    - attack.g0045
    - attack.t1064
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image: '*\cscript.exe'
        CommandLine: '*.vbs /shell *'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unlikely
level: critical
