---
action: global
title: Empire Monkey 
description: Detects EmpireMonkey APT reported Activity 
references:
    - https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
tags:
    - attack.t1086
    - attack.execution
date: 2019/04/02
author: Markus Neis
detection:
    condition: 1 of them
falsepositives:
    - Very Unlikely 
level: critical
---
logsource:
    category: process_creation
    product: windows
detection:
    selection_cutil:
        CommandLine: 
            - '*/i:%APPDATA%\logs.txt scrobj.dll'
        Image:
            - '*\cutil.exe'
    selection_regsvr32:
        CommandLine: 
            - '*/i:%APPDATA%\logs.txt scrobj.dll'
        Description: 
            - Microsoft(C) Registerserver
        