
---
action: global
title: Sofacy Trojan Loader Activity
status: experimental
description: Detects Trojan loader acitivty as used by APT28 
references: 
    - https://researchcenter.paloaltonetworks.com/2018/02/unit42-sofacy-attacks-multiple-government-entities/
    - https://www.reverse.it/sample/e3399d4802f9e6d6d539e3ae57e7ea9a54610a7c4155a6541df8e94d67af086e?environmentId=100
    - https://twitter.com/ClearskySec/status/960924755355369472
tags:
    - attack.g0007
author: Florian Roth
date: 2018/03/01
detection:
    selection:
        CommandLine: 
            - 'rundll32.exe %APPDATA%\*.dat",*'
            - 'rundll32.exe %APPDATA%\*.dll",#1'
    condition: selection
falsepositives:
    - Unknown
level: critical
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
---
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection:
        EventID: 4688