title: Sofacy Zebrocy
author: Florian Roth
description: Detects Sofacy's Zebrocy malware execution
references:
    - https://app.any.run/tasks/54acca9a-394e-4384-a0c8-91a96d36c81d
tags:
    - attack.execution
    - attack.g0020
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*cmd.exe /c SYSTEMINFO & TASKLIST'
    condition: selection
falsepositives:
    - Unknown
level: critical
