title: Silence.Downloader V3
status: experimental
description: Detects Silence downloader. These commands are hardcoded into the binary.
author: Alina Stepchenkova, Roman Rezvukhin, Group-IB, oscd.community
date: 2019/11/01
modified: 2019/11/22
tags:
    - attack.persistence
    - attack.g0091
logsource:
    category: process_creation
    product: windows
detection:
    selection_recon:
        Image|endswith:
            - '\tasklist.exe'
            - '\qwinsta.exe'
            - '\ipconfig.exe'
            - '\hostname.exe'
        CommandLine|contains: '>>'
        CommandLine|endswith: 'temps.dat'
    selection_persistence:
        CommandLine|contains: '/C REG ADD "HKCU\Software\Microsoft\Windows\CurrentVersion\Run" /v "WinNetworkSecurity" /t REG_SZ /d'
detection:
    condition: selection_recon | near selection_persistence # requires both
falsepositives:
    - Unknown
level: high
