---
action: global
title: Baby Shark Activity 
status: experimental
description: 'Detects activity that could be related to Baby Shark malware' 
references:
    - https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
logsource:
    product: windows
author: Florian Roth
date: 2019/02/24 
detection:
    condition: selection
falsepositives:
    - unknown
level: high
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine: 
            - 'reg query "HKEY_CURRENT_USER\Software\Microsoft\Terminal Server Client\Default"'
            - 'powershell.exe mshta.exe http*'
            - 'cmd.exe /c taskkill /im cmd.exe'
---
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection:
        EventID: 4688
        ProcessCommandLine: 
            - 'reg query "HKEY_CURRENT_USER\Software\Microsoft\Terminal Server Client\Default"'
            - 'powershell.exe mshta.exe http*'
            - 'cmd.exe /c taskkill /im cmd.exe'
