title: Suspicious Executable File Creation
id: 74babdd6-a758-4549-9632-26535279e654
status: experimental
description: Detect creation of suspicious executable file name. Some strings look for suspicious file extensions, others look for filenames that exploit unquoted service paths.
author: frack113
references:
  - https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
  - https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/
date: 2022/09/05
logsource:
  product: windows
  category: file_event
detection:
  selection_double:
    TargetFilename|endswith: 
        - '.bat.exe'
        - '.sys.exe'
  selection_folder:
    TargetFilename:
        - 'C:\$Recycle.Bin.exe'
        - 'C:\Documents and Settings.exe'
        - 'C:\MSOCache.exe'
        - 'C:\Recovery.exe'
        - 'C:\PerfLogs.exe'
  condition: 1 of selection_*
falsepositives:
  - Unknown
level: high
tags:
  - attack.defense_evasion
  - attack.t1564
