title: Potential File Extension Spoofing Using Right-to-Left Override
id: 979baf41-ca44-4540-9d0c-4fcef3b5a3a4
related:
    - id: ad691d92-15f2-4181-9aa4-723c74f9ddc3
      type: derived
status: test
description: |
    Detects suspicious filenames that contain a right-to-left override character and a potentially spoofed file extensions.
references:
    - https://redcanary.com/blog/right-to-left-override/
    - https://www.malwarebytes.com/blog/news/2014/01/the-rtlo-method
    - https://tria.ge/241015-l98snsyeje/behavioral2
    - https://www.unicode.org/versions/Unicode5.2.0/ch02.pdf
author: Jonathan Peters (Nextron Systems), Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2024-11-17
modiified: 2025-02-06
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1036.002
logsource:
    category: file_event
    product: windows
detection:
    selection_rtlo_unicode:
        TargetFilename|contains:
            - '\u202e'  # Unicode RTLO character
            - '[U+202E]'
            - '%E2%80%AE'
            - '???' # In some case Unicode cannot be represented in unicode
    selection_extensions:
        TargetFilename|contains:
            - 'cod.'  # Reversed `.doc`
            - 'ftr.'  # Reversed `.rtf`
            - 'fdp.'  # Reversed `.pdf`
            - 'gnp.'  # Reversed `.png`
            - 'lmth.'  # Reversed `.html`
            - 'slx.'  # Reversed `.xls`
            - 'nls.' # Reversed `.sln`
            - 'vsc..'  # Reversed `.csv`
            - 'tdo.'  # Reversed `.odt`
            - 'xcod.'  # Reversed `.docx`
            - 'xslx.'  # Reversed `.xlsx`
            - 'xtpp.'  # Reversed `.pptx`
            - 'gpj.'  # Reversed `.jpg`
            - 'gepj.'  # Reversed `.jpeg`
            - '3pm.'  # Reversed `.mp3`
            - '4pm.'  # Reversed `.mp4`
            - 'vwm.'  # Reversed `.wmv`
            - 'ism.'  # Reversed `.msi`
            - 'piz.'  # Reversed `.zip`
    condition: all of selection_*
falsepositives:
    - Filenames that contains scriptures such as arabic or hebrew might make use of this character
level: high
