title: Mimikatz MemSSP Default Log File Creation
id: 034affe8-6170-11ec-844f-0f78aa0c4d66
status: test
description: Detects Mimikatz MemSSP default log file creation
references:
    - https://pentestlab.blog/2019/10/21/persistence-security-support-provider/
author: David ANDRE
date: 2021/12/20
modified: 2022/12/25
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith: 'mimilsa.log'
    condition: selection
falsepositives:
    - Unlikely
level: critical
