title: Suspicious File seat.txt Created in ProgramData Folder (LockBit)
id: 13375ade-3976-4640-b3a2-ac7df1676d91
status: experimental
description: Detects the creation of new seat.txt files being created in the C:\ProgramData location. Which could indicate the host has been compromised by a Ransomware affiliated threat actor.
references:
    - https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
    - https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
    - https://github.com/GhostPack/Seatbelt
author: Gavin Knapp
date: 2023/02/16
tags:
    - attack.discovery
    - attack.t1082
logsource:
    category: file_event
    product: windows
    definition: 'Threat Actors associated with LockBit execute Seatbelt to gather security-oriented information about the host and output it to a file like C:\ProgramData\seat.txt.'
detection:
    selection:
        TargetFilename|endswith: 'C:\ProgramData\seat.txt'
    condition: selection
falsepositives:
    - Unknown
level: medium