title: Pingback Backdoor - File
id: 2bd63d53-84d4-4210-80ff-bf0658f1bf78
status: test
description: Detects the use of Pingback backdoor that creates ICMP tunnel for C2 as described in the trustwave report
references:
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel
    - https://app.any.run/tasks/4a54c651-b70b-4b72-84d7-f34d301d6406
author: Bhabesh Raj
date: 2021/05/05
modified: 2022/12/02
tags:
    - attack.persistence
    - attack.t1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        Image|endswith: 'updata.exe'
        TargetFilename: 'C:\Windows\oci.dll'
    condition: selection
falsepositives:
    - Very unlikely
level: high
