title: Unsusal dll Created Via Suspicious binary
id: 27eabb7c-5e09-4e66-a4ac-70ec1c8f5eb3
status: experimental
description:
  Detect suspicious DLLs associated with Cerber Ransomware.
  Monitor DLL creation in unusual directories, such as “C:\Users\ADMINI~1\AppData\Local\Temp”.
references:
  https://www.virustotal.com/gui/file/b6fdf9369af7d3663274392de89b1d644f86232311e63a4a395dda474e1200ee/behavior
author: Sai Prashanth Pulisetti
logsource:
  product: windows
  category: file_event
tags:
  - attack.persistence
  - attack.privilege_escalation
detection:
  selection:
    TargetFilename|endswith: 'disembarkation.dll'
  condition: selection
falsepositives:
  - Unknown
level: high
