title: Mysql Daemon Creating Executable Files
id: c61daa90-3c1e-4f18-af62-8f288b5c9aaf
status: experimental
description: 'Detects the creation of executable files by Mysql daemon which could be an indicator of User Defined Functions abuse to download malware.

    '
references:
    - https://asec.ahnlab.com/en/58878/
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/honeypot-recon-mysql-malware-infection-via-user-defined-functions-udf/
author: Joseph Kamau
date: 2024/02/03
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: file_event
detection:
    selection:
        Image|endswith:
            - \mysqld.exe
            - \mysqld-nt.exe
        TargetFilename|endswith:
            - .exe
            - .dll
            - .ps1
            - .bat
    condition: selection
falsepositives:
    - Unknown
level: high
