title: WSL Binary Modification
id: 2f400434-01e1-416b-b52c-bb5bfbb9eb78
status: experimental
description: Detects the modification of WSL.exe in program files. When WSL or Bash are exectued in Windows, the respective file in the System32 folder is executed and calls WSL.exe from program files.
references:
    - https://cardinalops.com/blog/bash-and-switch-hijacking-via-windows-subsystem-for-linux/
author: Liran Ravich
date: 2025-10-01
tags:
    - attack.defense-evasion
    - attack.t1036.005
    - attack.t1218
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains: 'c:\program files\wsl\wsl.exe'
    condition: selection
falsepositives:
    - When installing WSL for the first time, this file is created by msiexec.exe.
level: high
