title: ArcSOC.exe Creating Suspicious Files
id: e890acee-d488-420e-8f20-d9b19b3c3d43
status: experimental
description: |
    Detects instances where the ArcGIS Server process ArcSOC.exe, which hosts REST services running on an ArcGIS 
    server, creates files with suspicious file types, indicating that they may be executables, script files, 
    or otherwise unusual.
references:
    - https://reliaquest.com/blog/threat-spotlight-inside-flax-typhoons-arcgis-compromise/
    - https://enterprise.arcgis.com/en/server/12.0/administer/windows/inside-an-arcgis-server-site.htm
author: Micah Babinski
date: 2025-11-25
tags:
    - attack.defense-evasion
    - attack.command-and-control
    - attack.persistence
    - attack.t1127
    - attack.t1105
    - attack.t1133
logsource:
    category: file_event
    product: windows
detection:
    selection:
        Image|endswith: '\ArcSOC.exe'
        TargetFilename|endswith:
            - '.exe'
            - '.dll'
            - '.ps1'
            - '.py'
            - '.vbs'
            - '.hta'
            - '.cmd'
            - '.bat'
            - '.wsf'
            - '.js'
            - '.ahk'
            - '.au3'
            - '.aspx'
    condition: selection
falsepositives:
    - Unknown
level: low