title: Suspicious Binaries and Scripts in Public Folders
id: b447f7de-1e53-4cbf-bfb4-f1f6d0b04e4e
status: experimental
description: Detects payloads dropped in public folders, which could indicate malicious activity.
references:
  - https://intel.thedfirreport.com/events/view/30032 (Private Report)
  - https://intel.thedfirreport.com/eventReports/view/70 (Private Report)
  - https://thedfirreport.com/2025/01/27/cobalt-strike-and-a-pair-of-socks-lead-to-lockbit-ransomware/
author: 'The DFIR Report'
date: 2025-01-23
tags:
  - attack.execution
  - attack.t1204
logsource:
  category: file_event
  product: windows
detection:
    selection:
        TargetFilename|startswith: 'C:\Users\Public\'
        TargetFilename|endswith:
            - '.bat'
            - '.dll'
            - '.exe'
            - '.hta'
            - '.js'
            - '.ps1'
            - '.vbs'
    condition: selection
falsepositives:
  - Administrators deploying legitimate binaries to public folders
level: high
