title: PSScriptPolicyTest Creation By Non-PowerShell Process
id: 1027d292-dd87-4a1a-8701-2abe04d7783c
status: experimental
description: Detects the creation of the "PSScriptPolicyTest" PowerShell script by a non PowerShell process. This file is usually generated by Microsoft Powershell to test against Applocker.
references:
    - https://www.paloaltonetworks.com/blog/security-operations/stopping-powershell-without-powershell/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/01
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|contains: '__PSScriptPolicyTest_'
    filter_main_powershell:
        Image|endswith:
            - '\powershell_ise.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: medium
