title: TieringEngineService Dropped in User Temp Directory
id: 
status: experimental
description: Detects creation of TieringEngineService.exe in user Temp directories
references:
    - https://github.com/Nightmare-Eclipse/RedSun
author: '@unresolvedhost'
date: 2026-04-16
tags:
  - attack.persistence
  - attack.defense_evasion
logsource:
  product: windows
  category: file_event
detection:
  selection:
    TargetFilename|contains: '\Users\'
    TargetFilename|contains: '\AppData\Local\Temp\'
    TargetFilename|endswith: '\TieringEngineService.exe'
  condition: selection
level: medium
falsepositives:
  - N/A

