title: Potential Privilege Escalation Attempt Via Wermgr.Exe.Local
id: 07a99744-56ac-40d2-97b7-2095967b0e03
status: experimental
description: Detects potential privilege escalation attempt via the creation of the "Wermgr.Exe.Local" folder inside the "System32" directory in order to sideload "comctl32.dll"
references:
    - https://github.com/binderlabs/DirCreate2System
author: Nasreddine Bencherchali
date: 2022/12/16
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.privilege_escalation
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|startswith: 'C:\windows\system32\wermgr.exe.local\'
        TargetFilename|endswith: '\comctl32.dll'
    condition: selection
falsepositives:
    - Unknown
level: high
