title: ADExplorer writing complete AD snapshot into .dat file
id: e6f7c210-1e4a-4b5e-b142-3240b62a43cb
description: Detects the dual use tool ADExplorer writing a complete AD snapshot into .dat file. This can be used by attackers to extract data for Bloodhound with https://github.com/c3c/ADExplorerSnapshot.py
status: experimental
author: Arnim Rupp, Thomas Patzke
date: 2025-07-09
logsource:
  category: file_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\ADExp.exe'
      - '\ADExplorer.exe'
      - '\ADExplorer64.exe'
      - '\ADExplorer64a.exe'
    TargetFilename|endswith: '.dat'
  condition: selection
fields:
  - Image
  - TargetFilename
  - ProcessId
  - User
falsepositives:
  - Legitimate use of ADExplorer by Administrators creating .dat snapshots
level: medium
tags:
  - attack.collection
  - attack.t1005

