title: Self Extraction Directive (.sed) file creation
id: 760e75d8-c3b5-409b-a9bf-6130b4c4603f
status: experimental
description: |
    Detects the creation of Self Extraction Directive files (.sed) in the system.
    The file created is a PE and usually is used by iexpress.exe to create a new package.
references:
    - https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
    - https://en.wikipedia.org/wiki/IExpress
    - https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024/01/24
tags:
    - attack.execution
    - attack.t1218
logsource:
    category: file_event #Ideally, this event would be more effective if it were Sysmon EVID 29 
    product: windows
detection:
    selection:
        TargetFilename|contains: '\AppData\Local\Temp\'
        TargetFilename|endswith: '.sed'
    condition: selection
falsepositives:
    - Legitimate applications
level: medium
