title: Suspicious File Creation Activity From Fake Recycle.Bin Folder
id: 1fea93a2-1524-4a3c-9828-3aa0c2414e27
related:
    - id: 5ce0f04e-3efc-42af-839d-5b3a543b76c0
      type: derived
status: experimental
description: Detects file write event from/to a fake recycle bin folder that's often used as a staging directory for malware
references:
    - https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
author: X__Junior (Nextron Systems)
date: 2023/07/12
tags:
    - attack.persistence
    - attack.defense_evasion
logsource:
    category: file_event
    product: windows
detection:
    selection:
        - Image|contains:
            - ':\RECYCLERS.BIN\'
            - ':\RECYCLER.BIN\'
            - ':\RECYCLE.BIN\'
        - TargetFilename|contains:
            - ':\RECYCLERS.BIN\'
            - ':\RECYCLER.BIN\'
            - ':\RECYCLE.BIN\'
    condition: selection
falsepositives:
    - Unknown
level: high
