title: Office Macro File Creation From Suspicious Process
id: b1c50487-1967-4315-a026-6491686d860e
status: experimental
description: Detects the creation of a office macro file from a a suspicious process
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
    - https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/23
modified: 2023/02/22
tags:
    - attack.initial_access
    - attack.t1566.001
logsource:
    category: file_event
    product: windows
detection:
    selection_cmd:
        - Image|endswith:
            - '\cmd.exe'
            - '\cscript.exe'
            - '\mshta.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\regsvr32.exe'
            - '\rundll32.exe'
            - '\wscript.exe'
        - OriginalFileName:
            - 'cmd.exe'
            - 'cscript.exe'
            - 'mshta.exe'
            - 'PowerShell.EXE'
            - 'pwsh.dll'
            - 'regsvr32.exe'
            - 'rundll32.exe'
            - 'wscript.exe'
        - ParentImage|endswith:
            - '\cmd.exe'
            - '\cscript.exe'
            - '\mshta.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\regsvr32.exe'
            - '\rundll32.exe'
            - '\wscript.exe'
    selection_ext:
        TargetFilename|endswith:
            - '.docm'
            - '.dotm'
            - '.xlsm'
            - '.xltm'
            - '.potm'
            - '.pptm'
            - '.pptx'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
