title: Windows Binaries Write Suspicious Extensions
id: b8fd0e93-ff58-4cbd-8f48-1c114e342e62
related:
    - id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
      type: derived
status: test
description: Detects Windows executables that writes files with suspicious extensions
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/12
modified: 2023/03/14
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: file_event
    product: windows
detection:
    selection_generic:
        Image|endswith:
            - '\smss.exe'
            - '\RuntimeBroker.exe'
            - '\sihost.exe'
            - '\lsass.exe'
            - '\csrss.exe'
            - '\winlogon.exe'
            - '\wininit.exe'
        TargetFilename|endswith:
            - '.bat'
            - '.vbe'
            - '.txt'
            - '.vbs'
            - '.exe'
            - '.ps1'
            - '.hta'
            - '.iso'
            - '.dll'
    selection_special:
        Image|endswith:
            - '\rundll32.exe'
            - '\svchost.exe'
            - '\dllhost.exe'
        TargetFilename|endswith:
            - '.bat'
            - '.vbe'
            - '.vbs'
            - '.ps1'
            - '.hta'
            - '.iso'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
