title: DDF file generated by iexpress.exe
id: 4a63f362-6a79-49fc-bb28-3955106550d6
status: experimental
description: |
    Detects the creation of .DDF files by iexpress.exe.
    These files are usually read by makecab.exe after the creation.
references:
    - https://strontic.github.io/xcyclopedia/library/iexpress.exe-D594B2A33EFAFD0EABF09E3FDC05FCEA.html
    - https://en.wikipedia.org/wiki/IExpress
    - https://www.virustotal.com/gui/file/602f4ae507fa8de57ada079adff25a6c2a899bd25cd092d0af7e62cdb619c93c/behavior
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024/01/24
tags:
    - attack.execution
    - attack.t1218
logsource:
    category: file_event 
    product: windows
detection:
    selection_img:
        - Image|endswith: '\iexpress.exe'
        - OriginalFileName: 'IEXPRESS.exe'
    selection_file:
        TargetFilename|endswith: '.DDF'
    condition: all of selection_*
falsepositives:
    - Legitimate applications
level: medium
