title: Potential MOVEit Transfer Exploitation
id: c3b2a774-3152-4989-83c1-7afc48fd1599
status: experimental
description: Detects the creation of files with unexpected extensions in the root folder of the MOVEit Transfer service. First reports mentioned uncommon file types in the wwwroot folder as signs of a compromised. Attackers used that folder as a staging directory for the exfiltration.
references:
    - https://www.bleepingcomputer.com/news/security/new-moveit-transfer-zero-day-mass-exploited-in-data-theft-attacks/
    - https://community.progress.com/s/article/MOVEit-Transfer-Critical-Vulnerability-31May2023
    - https://www.rapid7.com/blog/post/2023/06/01/rapid7-observed-exploitation-of-critical-moveit-transfer-vulnerability/
author: Florian Roth
date: 2023/06/01
tags:
    - attack.t1190
logsource:
    category: file_event
    product: windows
detection:
    selection_re:
        TargetFilename|re: '\\MOVEit Transfer\\wwwroot\\[^\\]{1,40}\.(zip|rar|7z|exe|ps1|bat)'
    selection_known_ioc:
        TargetFilename|contains: '\MOVEit Transfer\wwwroot\human2.aspx'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
