title: Suspicious Privilege Escalation Attempts using DirCreate2System
id: 2d367498-5112-4ae5-a06a-96e7bc33a212
status: experimental
description: |
  Detects privilege escalation from a privileged user (eg. Administrator) to NT AUTHORITY\SYSTEM using variety of DLL Hijacking techniques.
references:
    - https://github.com/sailay1996/awesome_windows_logical_bugs/blob/master/dir_create2system.txt
author: Subhash Popuri (@pbssubhash)
date: 2022/12/19
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|startswith:
            - 'C:\Windows\System32\LogonUI.exe.Local'
            - 'C:\Windows\System32\WerFault.exe.Local'
            - 'C:\Windows\System32\consent.exe.Local'
            - 'C:\Windows\System32\Narrator.exe.Local'
            - 'C:\Windows\System32\Wermgr.exe.Local'
        TargetFilename|endswith: 'comctl32.dll'
    condition: selection
falsepositives:
    - Unknown
level: high