title: Files With System Process Name In Unsuspected Locations
id: d5866ddf-ce8f-4aea-b28e-d96485a20d3d
status: test
description: Detects the creation of an executable with a system process name in folders other than the system ones (System32, SysWOW64...etc).
author: Sander Wiebing, Tim Shelton, Nasreddine Bencherchali
date: 2020/05/26
modified: 2022/11/03
tags:
    - attack.defense_evasion
    - attack.t1036.005
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith:
            - '\svchost.exe'
            - '\rundll32.exe'
            - '\services.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\regsvr32.exe'
            - '\spoolsv.exe'
            - '\lsass.exe'
            - '\smss.exe'
            - '\csrss.exe'
            - '\conhost.exe'
            - '\wininit.exe'
            - '\lsm.exe'
            - '\winlogon.exe'
            - '\explorer.exe'
            - '\taskhost.exe'
            - '\Taskmgr.exe'
            - '\sihost.exe'
            - '\RuntimeBroker.exe'
            - '\smartscreen.exe'
            - '\dllhost.exe'
            - '\audiodg.exe'
            - '\wlanext.exe'
            - '\AtBroker.exe'
            - '\bcdedit.exe'
            - '\bitsadmin.exe'
            - '\ipconfig.exe'
            - '\LsaIso.exe'
            - '\LogonUI.exe'
            - '\logman.exe'
            - '\msinfo32.exe'
            - '\mstsc.exe'
            - '\msiexec.exe'
            - '\nbtstat.exe'
            - '\regini.exe'
            - '\TiWorker.exe'
            - '\WmiPrvSE.exe'
            - '\WUDFHost.exe'
            - '\taskhostw.exe'
            - '\dasHost.exe'
            - '\wslhost.exe'
            - '\fontdrvhost.exe'
            - '\dwm.exe'
            - '\backgroundTaskHost.exe'
            - '\SystemSettingsBroker.exe'
            - '\odbcconf.exe'
            - '\schtasks.exe'
            - '\SearchProtocolHost.exe'
            - '\SearchIndexer.exe'
            - '\SearchFilterHost.exe'
            - '\SecurityHealthSystray.exe'
            - '\SecurityHealthService.exe'
            - '\ShellAppRuntime.exe'
            - '\vssadmin.exe'
            - '\w32tm.exe'
            - '\WerFault.exe'
            - '\WerFaultSecure.exe'
            - '\wermgr.exe'
            - '\wevtutil.exe'
            - '\winrshost.exe'
            - '\wlrmdr.exe'
            - '\WinRTNetMUAHostServer.exe'
            - '\WSReset.exe'
            - '\WWAHost.exe'
            - '\iscsicpl.exe'
            - '\iscsicli.exe'
            - '\extrac32.exe'
            - '\eventvwr.exe'
            - '\eventcreate.exe'
            - '\dfrgui.exe'
            - '\cmdl32.exe'
            - '\cmstp.exe'
    filter1:
        TargetFilename|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
            - 'C:\Windows\WinSxS\'
            - '\SystemRoot\System32\'
        Image|endswith:
            - '\Windows\System32\dism.exe'
            - '\TiWorker.exe'
    filter2:
        TargetFilename|startswith: 'C:\$WINDOWS.~BT\'
        Image: 'C:\$WINDOWS.~BT\Sources\SetupHost.exe'
    filter3:
        TargetFilename|endswith: '\RuntimeBroker.exe'
        Image: 'C:\Windows\system32\wbengine.exe'
    filter4:
        TargetFilename|endswith: '\spoolsv.exe'
        TargetFilename|startswith: 'C:\Windows\SoftwareDistribution\Download\'
        Image|endswith: ':\Windows\system32\svchost.exe'
    filter6:
        Image: C:\Windows\System32\wuauclt.exe
    filter7:
        TargetFilename: 'C:\Windows\explorer.exe'
    condition: selection and not 1 of filter*
fields:
    - Image
falsepositives:
    - System processes copied outside their default folders for testing purposes
    - Third party software naming their software with the same names as the processes mentioned here
level: high
