title: Suspicious Double Extension Files
id: b4926b47-a9d7-434c-b3a0-adc3fa0bd13e
related:
    - id: 1cdd9a09-06c9-4769-99ff-626e2b3991b8
      type: derived
status: experimental
description: Detects dropped files with double extensions which is often used by malware as a method to abuse the fact that windows hide default extensions by default.
author: Nasreddine Bencherchali, frack113
references:
    - https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-june-mustang-panda/
    - https://www.anomali.com/blog/china-based-apt-mustang-panda-targets-minority-groups-public-and-private-sector-organizations
    - https://www.cybereason.com/blog/research/a-bazar-of-tricks-following-team9s-development-cycles
    - https://twitter.com/malwrhunterteam/status/1235135745611960321
    - https://twitter.com/luc4m/status/1073181154126254080
date: 2022/06/19
modified: 2022/07/28
logsource:
    category: file_event
    product: windows
detection:
    selection_gen:
        TargetFilename|endswith:
            - '.zip'
            - '.rar'
            - '.lnk'
            - '.iso'
            - '.exe'
        TargetFilename|contains:
            - '.doc.'
            - '.docx.'
            - '.xls.'
            - '.xlsx.'
            - '.ppt.'
            - '.pptx.'
            - '.jpg.'
    selection_exe:
        TargetFilename|endswith:
            - '.zip.exe'
            - '.rar.exe'   
    filter:
        TargetFilename|contains:
            - '\AppData\Roaming\Microsoft\Office\Recent\'
            - '\AppData\Roaming\Microsoft\Windows\Recent\'
    condition: 1 of selection_* and not filter
falsepositives:
    - Unlikely
level: high
tags:
    - attack.defense_evasion
    - attack.t1036.007

