title: Suspicious PROCEXP152.sys File Created In TMP
id: 3da70954-0f2c-4103-adff-b7440368f50e
status: test
description: Detects the creation of the PROCEXP152.sys file in the application-data local temporary folder. This driver is used by Sysinternals Process Explorer but also by KDU (https://github.com/hfiref0x/KDU) or Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs), which uses KDU.
author: xknow (@xknow_infosec), xorxes (@xor_xes)
references:
  - https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
date: 2019/04/08
modified: 2021/11/27
logsource:
  product: windows
  category: file_event
detection:
  selection_1:
    TargetFilename|contains: '\AppData\Local\Temp\'
    TargetFilename|endswith: 'PROCEXP152.sys'
  selection_2:
    Image|contains:
      - '\procexp64.exe'
      - '\procexp.exe'
      - '\procmon64.exe'
      - '\procmon.exe'
  condition: selection_1 and not selection_2
falsepositives:
  - Other legimate tools using this driver and filename (like Sysinternals). Note - Clever attackers may easily bypass this detection by just renaming the driver filename. Therefore just Medium-level and don't rely on it.
level: medium
tags:
  - attack.t1562.001
  - attack.defense_evasion
