title: Wsl Binary Modification
id: 2f400434-01e1-416b-b52c-bb5bfbb9eb78
status: experimental
description: Detects the modification of WSL.exe in program files.
references:
    - Add later
author: Liran Ravich
date: 2025-09-30
tags:
    - attack.defense-evasion
    - attack.T1036.005
    - attack.T1218
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|contains:
            - '\deno\remote\https\'
    condition: selection
falsepositives:
    - Unlikely
level: low
