title: ADExplorer Writing Complete AD Snapshot Into .dat File
id: 0a1255c5-d732-4b62-ac02-b5152d34fb83
related:
    - id: 9212f354-7775-4e28-9c9f-8f0a4544e664
      type: similar
status: experimental
description: Detects the dual use tool ADExplorer writing a complete AD snapshot into .dat file. This can be used by attackers to extract data for Bloodhound
references:
    - https://learn.microsoft.com/de-de/sysinternals/downloads/adexplorer
    - https://github.com/c3c/ADExplorerSnapshot.py
    - https://www.packetlabs.net/posts/scattered-spider-is-a-young-ransomware-gang-exploiting-large-corporations/
    - https://trustedsec.com/blog/adexplorer-on-engagements
author: Arnim Rupp (Nextron Systems), Thomas Patzke
date: 2025-07-09
tags:
    - attack.collection
    - attack.t1005
logsource:
    category: file_event
    product: windows
detection:
    selection_img:
        - Image|endswith: '\ADExp.exe'
        - Image|endswith: '\ADExplorer.exe'
        - Image|endswith: '\ADExplorer64.exe'
        - Image|endswith: '\ADExplorer64a.exe'
    selection_written_file:
        TargetFilename|endswith: '.dat'
    condition: all of selection_*
falsepositives:
    - Legitimate use of ADExplorer by administrators creating .dat snapshots
level: medium

