title: Succesful authentication without the use of MFA from a blacklisted IP
status: experimental
description: detect compromised accounts using a blacklist of known attackers of your own or using threat intelligence feeds.
references:
  - https://0x00sec.org/t/a-blue-team-guide-to-azure-office-365-monitoring/14411
author: 'juju4 (rule), 0x00sec.org (idea)'
tags:
    - attack.t1078
logsource:
    product: o365
falsepositives:
    - Penetration Test
    - Unknown
level: medium
detection:
    selection:
      Operation: UserLoggedIn
    filter1:
      - OAuth2
    filter2:
      LogonError: UserAccountNotFound
#    filter3:
#      blacklist_lookup
#    condition: selection and not filter and not filter2 | count(userid, clientip)
    condition: selection and not filter1 and not filter2 | count(userid) > 5
