title: Azure AD Locked Accounts
id: 9479db96-aa1e-4906-8822-0737da0e56a5
status: experimental
description: Identifies locked accounts from existing users
references:
  - https://0x00sec.org/t/a-blue-team-guide-to-azure-office-365-monitoring/14411
author: 'juju4 (rule), 0x00sec.org (idea)'
date: 2019/06/06
tags:
    - attack.t1078
logsource:
    product: o365
falsepositives:
    - Penetration Test
    - Unknown
level: medium
detection:
    selection:
      Workload: AzureActiveDirectory
      Operation: UserLoginFailed
      LogonError: IdsLocked "Actor{}.ID"!="Unknown"
# iplocation clientip
    condition: selection | count(userid) > 5
