title: Compliance search requesting the deletion of items
status: experimental
description: attempt to remove incriminating evidence
references:
  - https://0x00sec.org/t/a-blue-team-guide-to-azure-office-365-monitoring/14411
author: 'juju4 (rule), 0x00sec.org (idea)'
logsource:
    product: o365
falsepositives:
    - Penetration Test
    - Unknown
level: medium
detection:
    selection:
      Workload: SecurityComplianceCenter
    keywords1:
      - "New-ComplianceSearchAction"
    keywords2:
      - "-Purge"
    condition: selection and keywords1 and keywords2
