title: Users sharing OneDrive items with individuals outside of the organizations
status: experimental
description: detect individuals voluntarily sharing confidential information with external party or typo mistakes. Here too, a list of trusted third-party (partners, subsidiaries, etc) emails could be useful to filter out the noise.
references:
  - https://0x00sec.org/t/a-blue-team-guide-to-azure-office-365-monitoring/14411
author: 'juju4 (rule), 0x00sec.org (idea)'
logsource:
    product: o365
falsepositives:
    - Penetration Test
    - Unknown
level: medium
detection:
    selection:
      Workload: OneDrive
      Operation: AddedToSecureLink
    filter:
      TargetUserOrGroupName: '*@organization.tld'
    condition: selection and not filter
