title: Compliance search requesting the deletion of items
id: 205d4148-69c2-48e3-bc8d-a94067d16ace
status: experimental
description: attempt to remove incriminating evidence
references:
  - https://0x00sec.org/t/a-blue-team-guide-to-azure-office-365-monitoring/14411
author: 'juju4 (rule), 0x00sec.org (idea)'
date: 2019/06/06
logsource:
    product: o365
falsepositives:
    - Penetration Test
    - Unknown
level: medium
detection:
    selection:
        Workload: SecurityComplianceCenter
    keywords1:
        - "New-ComplianceSearchAction"
    keywords2:
        - "-Purge"
    condition: selection and keywords1 and keywords2
