title: Kapeka Backdoor Binary Loaded by Rundll32.exe
id: a7e6b1f9-8d2c-4f1e-9a7d-63e4c8a2bf4c
status: experimental
description: |
    Detects the Kapeka Backdoor binary being loaded by rundll32.exe. 
    The Kapeka loader dropped a backdoor, which was a DLL with an extension '.wll', subsequently loaded by rundll32.exe.
references:
    - https://labs.withsecure.com/publications/kapeka
    - https://app.any.run/tasks/1efb3ed4-cc0f-4690-a0ed-24516809bc72/
author: Swachchhanda Shrawan Poudel
date: 2023/04/19
tags:
    - attack.execution
    - attack.t1204.002
    - attack.defense_evasion
    - attack.t1218.011
logsource:
    category: image_load
    product: windows
detection:
    selection_image:
        Image|endswith: '\rundll32.exe'
    selection_image_loaded_path:
        ImageLoaded|contains:
            - 'C:\ProgramData'
            - '\AppData\Local'
    selection_wll_extension:
        ImageLoaded|endswith: '.wll'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
