title: Kapeka Persistence Autorun Registry Modification
id: c0c67b21-eb8a-4c84-a395-40473ec3b482
related:
    - id: b9c5a847-1e0d-4d26-9f5a-273ec8f25b3a
      type: similar
status: experimental
description: Detects modification of autorun registry by Kapeka backdoor for persistence.
references:
    - https://labs.withsecure.com/publications/kapeka
    - https://app.any.run/tasks/1efb3ed4-cc0f-4690-a0ed-24516809bc72/
author: Swachchhanda Shrawan Poudel
date: 2023/04/19
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_set
    product: windows
detection:
    selection_base:
        TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\Run'
    selection_key:
        TargetObject|contains: 'Sens Api'
    selection_details:
        Details|contains|all:
            - 'C:\WINDOWS\system32\rundll32.exe'
            - '.wll'
            - '#1'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
