title: Invoke-Obfuscation Via Use Rundll32
id: 4e1518d9-2136-4015-ab49-c31d7c8588e1
related:
    - id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
      type: derived
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
status: unsupported
author: Nikita Nazarov, oscd.community
date: 2020/10/09
modified: 2022/03/08
references:
    - https://github.com/SigmaHQ/sigma/issues/1009 #(Task30)
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImagePath|contains|all: 
            - '&&'
            - 'rundll32'
            - 'shell32.dll'
            - 'shellexec_rundll'
        ImagePath|contains:     
            - 'value'
            - 'invoke'
            - 'comspec'
            - 'iex'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
