title: Invoke-Obfuscation Via Use Clip
id: 1fc02cb5-8acf-4d2c-bf9c-a28b6e0ad851
related:
    - id: 63e3365d-4824-42d8-8b82-e56810fefa0c
      type: derived
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
status: unsupported
author: Nikita Nazarov, oscd.community
date: 2020/10/09
modified: 2022/04/26
references:
    - https://github.com/SigmaHQ/sigma/issues/1009 #(Task29)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImagePath|contains: '(Clipboard|i'
    condition: selection
falsepositives:
    - Unknown
level: high