title: Email Forwarding Rule - Exchange
id: 332bfab9-170c-40ef-9b11-c8df8d402421
status: experimental
description: Detects scenarios where an attacker creates or updates a forwarding rules in order to collect information.
references:
    - https://redcanary.com/blog/email-forwarding-rules/
    - https://raw.githubusercontent.com/PwC-IR/Business-Email-Compromise-Guide/main/PwC-Business_Email_Compromise-Guide.pdf
author: Daniel Degasperi '@d4ns4n_'
date: 2024-10-23
tags:
    - attack.collection
    - attack.t1114.003
logsource:
    service: exchange
    product: m365
detection:
    selection:
        Operation:
            - 'New-InboxRule'
            - 'Set-InboxRule'
        Parameters.Name:
            - 'ForwardAsAttachmentTo'
            - 'ForwardTo'
            - 'ForwardingAddress'
            - 'RedirectToRecipients'
            - 'RedirectTo'
            - 'ForwardingSmtpAddress'
    condition: selection
falsepositives:
    - Legitimate forwarding emails to personal or corporate mailbox
level: medium
