title: Multiple Failed Mount Attempts of Admin Share
id: 1c3be8c5-6171-41d3-b792-cab6f717fcdb
description: Detects repeated failed (outgoing) attempts to mount an administrative share
author: Fabian Franz
status: experimental
references:
    - https://twitter.com/moti_b/status/1032645458634653697
    - https://www.bsi.bund.de/SharedDocs/Downloads/EN/BSI/Cyber-Security/SiSyPHuS/AP10/Logging_Configuration_Guideline.pdf?__blob=publicationFile&v=5
tags:
    - attack.t1021.002
    - attack.lateral_movement
date: 2022/08/30
modified: 2022/08/30
logsource:
    product: windows
    service: smbclient-security
detection:
    selection:
        EventID: 31010
        ShareName|endswith: '$'
    condition: selection | count() > 10
fields:
    - ShareName
falsepositives:
    - Legitimate administrative activity
    - Faulty scripts
level: medium
