title: Windows Defender Threat Detection Disabled
id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
status: stable
description: Detects disabling Windows Defender threat protection
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
    - https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
author: Ján Trenčanský, frack113, Christopher Peacock '@securepeacock' (Update)
date: 2020/07/28
modified: 2022/12/06
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID:
            - 5001 # Real-time protection is disabled.
            - 5010 # Scanning for malware and other potentially unwanted software is disabled.
            - 5012 # Scanning for viruses is disabled.
            - 5101 # The antimalware platform is expired.
            - 3002 # Real-Time Protection agent has encountered an error and failed to start.
    condition: selection
falsepositives:
    - Administrator actions (should be investigated)
    - Seen being triggered occasionally during Windows 8 Defender Updates
level: high
