title: Win Defender Restored Quarantine File
id: bc92ca75-cd42-4d61-9a37-9d5aa259c88b
status: test
description: Detects the restoration of files from the defender quarantine
references:
    - https://learn.microsoft.com/en-us/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-06
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    product: windows
    service: windefend
detection:
    selection:
        EventID: 1009 # The antimalware platform restored an item from quarantine.
    condition: selection
falsepositives:
    - Legitimate administrator activity restoring a file
level: high
