title: T1086 Remote PowerShell Session
description: Detects remote PowerShell sessions
status: experimental
date: 2019/08/10
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
logsource:
    product: windows
    service: powershell
detection:
    selection: 
        EventID:
            - 4103
            - 400
        HostName: 'ServerRemoteHost'
        HostApplication: '*wsmprovhost.exe*'
    condition: selection
falsepositives:
    - Unknown
level: critical