title: PrintNightmare Powershell Exploitation
id: 6d3f1399-a81c-4409-aff3-1ecfe9330baf
status: experimental
description: Detects Commandlet name for PrintNightmare exploitation.
date: 2021/08/09
references:
    - https://github.com/calebstewart/CVE-2021-1675
author: Max Altgelt, Tobias Michalski
logsource:
    product: windows
    service: powershell
    definition: It is recommended to use the new "Script Block Logging" of PowerShell v5.
detection:
  selection:
      EventID: 4104
      ScriptBlockText:
        - Invoke-Nightmare
  condition: selection
falsepositives:
    - Unknown
level: high
