title: PowerShell Downgrade Attack
id: 6331d09b-4785-4c13-980f-f96661356249
status: experimental
description: Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0
references:
    - http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1086
author: Florian Roth (rule), Lee Holmes (idea)
date: 2017/03/22
detection:
    condition: 1 of them
falsepositives:
    - Penetration Test
    - Unknown
level: medium
---
logsource:
    product: windows
    service: powershell-classic
detection:
    selection:
        EventID: 400
        EngineVersion|startswith: '2.'
    filter:
        HostVersion|startswith: '2.'
    condition: selection and not filter
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine:
            - '*-v* 2'
            - '*-V* 2'
        Image|endswith: '\powershell.exe'
    condition: selection
---
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4688
        CommandLine:
            - '*-v* 2'
            - '*-V* 2'
        Image|endswith: '\powershell.exe'
    condition: selection
