title: Alternate PowerShell Hosts
id: 4c2fafa1-699a-4971-ace3-345c8ac54a8d
description: Detects alternate PowerShell hosts potentially bypassing detections looking for powershell.exe
status: experimental
date: 2019/08/11
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.execution
    - attack.t1059.001
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html
logsource:
    product: windows
    service: powershell
detection:
    selection: 
        EventID:
            - 4103
            - 400
    filter:
        HostApplication: 'powershell.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical
