title: Network Sniffing
status: experimental
description: Network sniffing refers to using the network interface on a system to monitor or capture information sent over a wired or wireless connection. An adversary may place a network interface into promiscuous mode to passively access data in transit over the network, or use span ports to capture a larger amount of data.
author: Timur Zinniatullin, oscd.community
references:
    - https://attack.mitre.org/techniques/T1040/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1040/T1040.yaml
logsource:
    product: windows
    service: powershell
    description: 'Script block logging must be enabled'
detection:
    selection:
        EventID: 4104
    keyword1: 
        - '*tshark*-i*'
    keyword2:
        - '*windump*'
    condition: selection and (keyword1 or keyword2)
falsepositives:
    - Admin activity
level: low
tags:
    - attack.credential_access
    - attack.discovery
    - attack.t1040
    