title: Zip A Folder With PowerShell For Staging In Temp
id: b7a3c9a3-09ea-4934-8864-6a32cacd98d9
status: experimental
author: frack113
date: 2021/07/20
modified: 2021/09/30
description: Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1074.001/T1074.001.md
tags:
    - attack.collection
    - attack.t1074.001
logsource:
    product: windows
    service: powershell
    definition: 4103 Module Logging must be enabled , 4104 Script Block Logging must be enable
detection:
    selection_4103:
        EventID: 4103
        ContextInfo|contains|all:
            - 'Compress-Archive '
            - ' -Path '
            - ' -DestinationPath '
            - '$env:TEMP\'
    selection_4104:
        EventID: 4104
        ScriptBlockText|contains|all:
            - 'Compress-Archive '
            - ' -Path '
            - ' -DestinationPath '
            - '$env:TEMP\'
    condition: selection_4103 or  selection_4104
falsepositives:
    - Unknown
level: medium
