title: Netcat The Powershell Version
id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
status: experimental
author: frack113
date: 2021/07/21
modified: 2021/09/07
description: Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network
references:
    - https://nmap.org/ncat/
    - https://github.com/besimorhino/powercat
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
tags:
    - attack.command_and_control
    - attack.t1095
logsource:
    product: windows
    service: powershell
    definition: Module Logging must be enable
detection:
    selection:
        EventID: 4103
        ContextInfo|contains:
            - 'powercat '
            - 'powercat.ps1'
    condition: selection 
falsepositives:
    - Unknown
level: medium