title: Encoded PowerShell Command Line
id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
description: Detects specific combinations of encoding methods in the PowerShell command lines
status: experimental
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community
date: 2020/10/11
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        Image|endswith: '\powershell.exe'
    selection_2:
        CommandLine|all:
            - '*char*'
            - '*join*'
    selection_3:
        CommandLine|contains:
            - 'ToInt'
            - 'ToDecimal'
            - 'ToByte'
            - 'ToSingle'
            - 'ToSByte'
    selection_4:
        CommandLine|contains:
            - 'ToChar'
            - 'ToString'
            - 'String'
    selection_5:
        CommandLine|all:
            - '*split*'
            - '*join*'
    selection_6:
        CommandLine|all:
            - '*ForEach*'
            - '*Xor*'
    selection_7:
        CommandLine|contains:
            - 'cOnvErTTO-SECUreStRIng'
    condition: selection_1 and (selection_2 or (selection_3 and selection_4) or selection_5 or selection_6 or selection_7)
falsepositives:
    - Unlikely
level: high
