title: Removal Of SD Value to Hide Schedule Task
id: acd74772-5f88-45c7-956b-6a7b36c294d2
related:
    - id: 5b16df71-8615-4f7f-ac9b-6c43c0509e61
      type: similar
    - id: 526cc8bc-1cdc-48ad-8b26-f19bff969cec
      type: similar
description: Remove SD (Security Descriptor) value in \Schedule\TaskCache\Tree registry hive to hide schedule task. This technique is used by Tarrask malware
status: experimental
date: 2022/04/15
author: Sittikorn S
references:
    - https://www.microsoft.com/security/blog/2022/04/12/tarrask-malware-uses-scheduled-tasks-for-defense-evasion/
logsource:
    product: windows
    category: registry_delete
    definition: key must be added to the sysmon configuration for this rule to work
detection:
    selection:
        EventType: DeleteKey
        TargetObject|contains|all:
            - '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\'
            - 'SD'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion
    - attack.t1562
