title: Credential Guard Disabled Via Registry Deletion
id: d645ef86-2396-48a1-a2b6-b629ca3f57ff
related:
    - id: c629cc9b-8ddf-4282-9f10-6934ce3ea1ee
      type: similar
status: experimental
description: |
    Detects attempts to disable Windows Credential Guard by deleting registry keys. Credential Guard uses virtualization-based security to isolate secrets so that only privileged system software can access them.
    Adversaries may disable Credential Guard to gain access to sensitive credentials stored in the system, such as NTLM hashes and Kerberos tickets, which can be used for lateral movement and privilege escalation.
references:
    - https://github.com/DambergC/SaveFolder/blob/90e945eba80fae85f2d54b4616e05a44ec90c500/Cygate%20Installation%20tool%206.22/Script/OSD/OSDeployment-CredentialGuardDisable.ps1#L50
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-26
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: registry_delete
    product: windows
detection:
    selection:
        TargetObject|endswith:
            - '\SYSTEM\CurrentControlSet\Control\DeviceGuard\EnableVirtualizationBasedSecurity'
            - '\SYSTEM\CurrentControlSet\Control\DeviceGuard\RequirePlatformSecurityFeatures'
            - '\SYSTEM\CurrentControlSet\Control\Lsa\LsaCfgFlags'
            - '\SOFTWARE\Policies\Microsoft\Windows\DeviceGuard\EnableVirtualizationBasedSecurity'
            - '\SOFTWARE\Policies\Microsoft\Windows\DeviceGuard\RequirePlatformSecurityFeatures'
            - '\SOFTWARE\Policies\Microsoft\Windows\DeviceGuard\LsaCfgFlags'
    condition: selection
falsepositives:
    - Legitimately disabling Credential Guard for troubleshooting or configuration purposes such as resolve compatibility or during upgrade processes.
level: medium
