title: DNS Request from Windows Script Host
id: 12310575-e8b1-475c-a976-57ed540b349c
status: experimental
description: |
    Detects unusual domain resolutions originating from CScript/WScript that can identify malicious
    javascript files executing in an environment, often as a result from a phishing or watering hole attack
author: Josh Nickels, Marius Rothenbücher
references:
    - Internal Research
date: 2024-09-04
logsource:
    product: windows
    category: dns_query
detection:
    condition: selection_image and not 1 of filter_*
    selection_image:
        Image|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
    filter_internal_domains: # Populate this placeholder with known and expected internal domains
        QueryName|expand: '%internal_domains%'
    filter_optional_trusted_domains: # Mostly certificate distribution domains
        - QueryName:
              - 'oscp.comodoca.com'
              - 'oscp.sectigo.com'
              - 'oscp.starfieldtech.com'
              - 'ocsp.usertrust.com'
              - 'crl.starfieldtech.com'
              - 'officecdn.microsoft.com'
              - 'oneocsp.microsoft.com'
              - 'www.python.org'
        - QueryName|endswith:
              - '.entrust.net'
              - '.digicert.com'
              - '.globalsign.net'
              - '.verisign.com'
falsepositives:
    - Script files making domain expected domain requests
level: low
tags:
    - attack.execution
    - attack.t1059
