title: REDSUN Named Pipe Usage
id: 
status: experimental
description: Detects creation or usage of the REDSUN named pipe
author: '@unresolvedhost'
references:
    - https://github.com/Nightmare-Eclipse/RedSun
date: 2026-04-16
tags:
  - attack.privilege_escalation
logsource:
  product: windows
  category: pipe_created
detection:
  selection:
    PipeName: '\REDSUN'
  condition: selection
falsepositives:
  - N/A
level: low