title: Koh Default Named Pipes
id: 0adc67e0-a68f-4ffd-9c43-28905aad5d6a
status: experimental
description: Detects creation of default named pipes used by the Koh tool
author: Nasreddine Bencherchali
references:
    - https://github.com/GhostPack/Koh/blob/0283d9f3f91cf74732ad377821986cfcb088e20a/Clients/BOF/KohClient.c#L12
date: 2022/07/08
logsource:
    product: windows
    category: pipe_created
detection:
    selection:
        PipeName|contains:
            - '\imposecost'
            - '\imposingcost'
    condition: selection
falsepositives:
    - Unlikely
level: critical
tags:
    - attack.privilege_escalation
    - attack.credential_access
    - attack.t1528
    - attack.t1134.001
