title: DiagTrackEoP Default Named Pipe
id: 1f7025a6-e747-4130-aac4-961eb47015f1
status: experimental
description: Detects creation of default named pipe used by the DiagTrackEoP POC
author: Nasreddine Bencherchali
references:
    - https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L22
date: 2022/08/03
logsource:
    product: windows
    category: pipe_created
detection:
    selection:
        PipeName|contains: 'thisispipe' # Based on source code
    condition: selection
falsepositives:
    - Unlikely
level: critical
tags:
    - attack.privilege_escalation
