title: Remote Thread Creation Ttdinject.exe Proxy
id: c15e99a3-c474-48ab-b9a7-84549a7a9d16
status: experimental
description: Detects a remote thread creation of Ttdinject.exe used as proxy
author: frack113
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/
date: 2022/05/16
modified: 2022/06/02
logsource:
    product: windows
    category: create_remote_thread
detection:
    selection:
        SourceImage|endswith: '\ttdinject.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1127
