title: KeePass Password Dumping
id: 77564cc2-7382-438b-a7f6-395c2ae53b9a
status: experimental
description: Detects remote thread creation in KeePass.exe indicating password dumping activity
references:
    - https://www.cisa.gov/uscert/ncas/alerts/aa20-259a
    - https://github.com/denandz/KeeFarce
    - https://github.com/GhostPack/KeeThief
author: Timon Hackenjos
date: 2022/04/22
tags:
    - attack.credential_access
    - attack.t1555.005
logsource:
    product: windows
    category: create_remote_thread
detection:
    selection:
        TargetImage|endswith: '\KeePass.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
