title: Create Remote Thread In Shell Application
id: 0ADFAC0B-1A34-4D73-86A4-BC5B75822E30
status: test
description: Detects process injection in command shell applications, such as cmd.exe and PowerShell. It is a common technique used by malware, such as IcedID.
references:
    - https://research.splunk.com/endpoint/10399c1e-f51e-11eb-b920-acde48001122/
    - https://www.binarydefense.com/resources/blog/icedid-gziploader-analysis/
author: Splunk Research
date: 2024/07/25
tags:
    - attack.defense_evasion
    - attack.t1055
logsource:
    product: windows
    category: create_remote_thread
detection:
    selection:
        TargetImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
    condition: selection
falsepositives:
    - Unknown
level: Medium
