title: Suspicious Remote Thread Creation By Dialer.exe
id: b4ea373c-2f60-4396-9bd8-ce7d36f556a1
status: experimental
description: 'Detects suspicious creation of remote thread by dialer.exe targeting '
references:
    - https://app.any.run/tasks/6720b85b-9c53-4a12-b1dc-73052a78477d/
author: SaiPrashanth Pulisetti
date: 2024/06/14
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
logsource:
    product: windows
    category: create_remote_thread
detection:
    selection:
        SourceImage|endswith: \dialer.exe
        TargetImage|startswith: C:\Windows\System32\
    condition: selection
falsepositives:
    - Unknown
level: high
