title: Disable System Restore Through Registry
id: 5de03871-5d46-4539-a82d-3aa992a69a83
description: Modify the registry to disable system restore on the computer
author: frack113
date: 2022/04/04
status: experimental
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|startswith:
            - 'HKLM\SOFTWARE\Policies\Microsoft\Windows NT\SystemRestore'
            - 'HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SystemRestore'
        TargetObject|endswith: 
            - DisableConfig
            - DisableSR
        Details: 'DWORD (0x00000001)'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
  - attack.impact
  - attack.t1490
