title: IIS Remove W3C HTTP Logging
id: 2cf25394-e266-4139-a632-c463b8dd577a
status: experimental
description: Detects Remove W3C HTTP Logging.
references:
    - https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
    - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
author: frack113
date: 2024/07/27
tags:
    - attack.defense_evasion
    - attack.t1562.002
    - attack.t1505.004
logsource:
    product: windows
    service: iis-configuration
detection:
    selection:
        EventID: 29
        Configuration|endswith: "@logFormat"
    filter:
        NewValue: "W3C"
    condition: selection and not filter
falsepositives:
    - Legitimate administrator activity
level: high
