title: IIS Add Module
id: dd857d3e-0c6e-457b-9b48-e82ae7f86bd7
status: experimental
description: Detects adding a new module to the IIS server.
references:
    - https://learn.microsoft.com/en-us/iis/manage/provisioning-and-managing-iis/configure-logging-in-iis
    - https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
author: frack113
date: 2024-07-27
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1562.002
    - attack.t1505.004
logsource:
    product: windows
    service: iis-configuration
detection:
    selection:
        EventID: 29
        Configuration|startswith: '/system.webServer/modules/add'
    filter_natif:
        NewValue:
            - 'AnonymousAuthenticationModule'
            - 'CustomErrorModule'
            - 'DefaultDocumentModule'
            - 'DirectoryListingModule'
            - 'FileCacheModule'
            - 'HttpCacheModule'
            - 'HttpLoggingModule'
            - 'ProtocolSupportModule'
            - 'RequestFilteringModule'
            - 'StaticCompressionModule'
            - 'StaticFileModule'
            - 'TokenCacheModule'
            - 'UriCacheModule'
    filter_remove:
        NewValue: ''
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate administrator activity
level: medium
