title: Cisco LDP authentication failures
id: 50e606bf-04ce-4ca7-9d54-3449494bbd4b
status: experimental
description: Find LDP failures which may be indicative of brute force attacks to manipulate MPLS labels: https://www.cisco.com/c/en/us/td/docs/ios/12_2sb/12_2sba/feature/guide/sba_md5.html
author: Tim Brown
date: 2023/01/09
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.T1078
    - attack.credential_access
    - attack.T1110
    - attack.collection
    - attack.T1557
logsource:
    product: cisco
    service: ldp
detection:
    protocol:
        - 'LDP'
    keywords:
        - 'SOCKET_TCP_PACKET_MD5_AUTHEN_FAIL'
        - 'TCPMD5AuthenFail'
    condition: protocol and keywords
fields:
    - tcpConnLocalAddress
    - tcpConnRemAddress
level: low
falsepositives:
    - Uncommon except due to misconfigurations
