title: Cisco LDP authentication failures
status: test
description: Find authenticated LDP failures
author: Tim Brown
date: 2023/01/09
logsource:
    product: cisco
    service: ldp
detection:
    protocol:
        - 'LDP'
    keywords:
        - 'SOCKET_TCP_PACKET_MD5_AUTHEN_FAIL'
        - 'TCPMD5AuthenFail'
    condition: protocol and keywords
fields:
    - tcpConnLocalAddress
    - tcpConnRemAddress
level: low
