title: Privilege Role Sign-In Outside Of Normal Hours
id: e927a2f5-e7af-424f-ace7-70ebb49e8976
status: experimental
description: Detects when an account signs in from outside normal hours or locations. Admin accounts should be investigated
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: 2022/08/11
references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor
logsource:
    product: azure
    service: signinlogs
detection:
    # You need to tune the rule for your enrivonnement before use
    selection:
        Status: Sucess
        # Countries you DO operate out of e,g GB, use list for mulitple
        Location: '%LegitCountries%'
        # outside normal working hours
        Date: '%ClosingTime%'
        Initiatied.By: '%ApprovedUserUpn%'
    condition: selection
falsepositives:
     - An admin doing actual work outside of normal business hours. 
tags:
    - attack.persistence
    - attack.t1078
level: high
