title: Remote Schedule Task Recon via AtScv
id: 1ff70682-0a51-30e8-076d-740be8cee98b
description: Detects remote RPC calls to read information about scheduled tasks via AtScv
references:
    - https://attack.mitre.org/tactics/TA0007/
    - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
    - https://github.com/zeronetworks/rpcfirewall
tags:
    - attack.ta0007
status: experimental
author: Sagie Dulce, Dekel Paz
date: 2022/01/01
modified: 2022/01/01
logsource:
    product: windows
    service: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes with "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
    references:
      - https://github.com/zeronetworks/rpcfirewall
      - https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/
detection:
    selection:
      - EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 1ff70682-0a51-30e8-076d-740be8cee98b
    filter:
      OpNum:
        - 0
        - 1
    condition: selection and not filter
falsepositives:
    - unknown
level: high
