title: Remote Schedule Task Lateral Movement via ATSvc
id: 1ff70682-0a51-30e8-076d-740be8cee98b
description: Detects remote RPC calls to create or execute a scheduled task via ATSvc
references:
    - https://attack.mitre.org/techniques/T1053/
    - https://attack.mitre.org/tactics/TA0008/
    - https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
tags:
    - attack.lateral_movement
    - attack.ta0008
    - attack.t1053
    - attack.t1053.002
status: experimental
author: Sagie Dulce, Dekel Paz
date: 2022/01/01
modified: 2022/01/01
logsource:
    product: windows
    service: rpc_firewall
    definition: 'Requirements: install and apply the RPC Firewall to all processes with "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
    references:
      - https://github.com/zeronetworks/rpcfirewall
      - https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/
detection:
    selection:
      - EventLog: RPCFW
        EventID: 3
        InterfaceUuid: 1ff70682-0a51-30e8-076d-740be8cee98b
        OpNum:
          - 0
          - 1
    condition: selection
falsepositives:
    - unknown
level: high
