title: RDP Session Hijacking
id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
status: experimental
description: Detects RDP Session Hijacking on Windows systems
references:
    - https://twitter.com/Moti_B/status/909449115477659651
author: juju4
date: 2019/05/26
tags:
    - attack.execution
    - attack.t1076
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: tscon.exe
        IntegrityLevel: SYSTEM
    condition: selection
fields:
    - Image
    - IntegrityLevel
falsepositives:
    - Administrative activity
level: medium