title: CobaltStrike Service Installations
id: 5a105d34-05fc-401e-8553-272b45c1522d
description: Detects known malicious service installs that appear in cases in which a Cobalt Strike beacon elevates privileges or lateral movement
author: Florian Roth, Wojciech Lesicki
references:
    - https://www.sans.org/webcasts/119395
date: 2021/05/26
modified: 2021/06/03
tags:
    - attack.execution
    - attack.privilege_escalation
    - attack.lateral_movement 
    - attack.t1021.002
    - attack.t1543.003
    - attack.t1569.002
logsource:
    product: windows
    service: system
detection:
    selection1:
        EventID: 7045
    selection2:
        ServiceFileName|contains|all: 
            - 'ADMIN$'
            - '.exe'
    selection3:
        ServiceFileName|contains|all: 
            - '%COMSPEC%'
            - 'start'
            - 'powershell'
    condition: selection1 and (selection2 or selection3)
falsepositives:
    - Unknown
level: critical
