action: global
title: Remote Service Creation
id: 4a3a2b96-d7fc-4cb9-80e4-4a545fe95f46
status: experimental
description: Detects remote execution via service creation on the destination host
author: Jai Minton, oscd.community
date: 2020/10/05
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
tags:
    - attack.lateral_movement
    - attack.persistence
    - attack.execution
    - attack.t1543.003 
logsource:
    product: windows
    service: security, system
detection:
    selection1:
        EventID: 4624
        Logon_Type: 3
    filter1: 
        Source_Network_Address:
            - '::1'
            - '127.0.0.1'
    timeframe: 30d
    condition: (selection1 and not filter1) or selection2
falsepositives:
    - Unknown
level: medium
---
 logsource:
     product: windows
     service: security
 detection:
     selection2:
         EventID: 4697
---
logsource:
    product: windows
    service: system
detection:
    selection2:
        EventID: 7045