title: Simultaneous Service Installs
id: fd4fb1c9-6774-47fb-b725-7bb86f839812
description: Detects multiple service installs that appear in a small time frame. could reveal automated attacks. typical examples are psexec and fgdump.
status: experimental
author: juju4
date: 2017/09/09
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1050
references:
    - https://www.first.org/resources/papers/conf2017/Windows-Credentials-Attacks-and-Mitigation-Techniques.pdf
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
    timeframe: 1m
    condition: selection | count(ServiceFileName) > 1
falsepositives:
    - Software installation
    - Software updates
    - Orchestration tool usage
    - Products using multiple cascading services
    - Can prefer to whitelist Security and Infrastructure services
level: low