title: Eventlog Cleared
description: One of the Windows Eventlogs has been cleared
references:
    - https://twitter.com/deviouspolack/status/832535435960209408
author: Florian Roth
tags:
    - attack.defense_evasion
    - attack.t1070
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 104
    condition: selection
falsepositives:
    - Unknown
level: medium

