title: MSExchange Transport Agent Installation
id: 4fe151c2-ecf9-4fae-95ae-b88ec9c2fca6
related:
    - id: 83809e84-4475-4b69-bc3e-4aad8568612f
      type: derived
status: experimental
description: Detects the Installation of a Exchange Transport Agent
references:
    - https://twitter.com/blueteamsec1/status/1401290874202382336?s=20
tags:
    - attack.persistence  
    - attack.t1505.002    
author: Tobias Michalski  
date: 2021/06/08
modified: 2021/09/19
logsource:
    product: windows
    service: msexchange-management
detection:
    selection:
        - 'Install-TransportAgent'
    condition: selection
fields:
    - AssemblyPath
falsepositives:
    - legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator for this.
level: medium