title: T1086 Non Interactive PowerShell
description: Detects non-interactive PowerShell activity by looking at powershell.exe with not explorer.exe as a parent.
status: experimental
date: 2019/12/10
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/basic_powershell_execution.md
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 4688
        NewProcessName: '*\powershell.exe'
        ParentProcessName: '*\explorer.exe'
    condition: selection
falsepositives:
    - Unknown
level: critical