title: Addition of SID History to Active Directory Object
status: stable
description: An attacker can use the SID history attribute to gain additional privileges.
reference: https://adsecurity.org/?p=1772
author: Thomas Patzke
logsource:
    product: windows
detection:
    selection:
        EventLog: Security
        EventID:
            - 4765
            - 4766
    condition: selection
falsepositives:
    - Migration of an account into a new domain
level: medium
