action: global
title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
status: experimental
author: Timur Zinniatullin, oscd.community
date: 2020/10/13
modified: 2021/08/09
references:
    - https://github.com/Neo23x0/sigma/issues/1009 #(Task27)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
falsepositives:
    - Unknown
level: high
detection:
    selection:
        ImagePath|re: '(?i).*&&set.*(\{\d\}){2,}\\\"\s+?\-f.*&&.*cmd.*\/c' # FPs with |\/r
    condition: selection and selection_eventid
---
id: 14bcba49-a428-42d9-b943-e2ce0f0f7ae6
logsource:
    product: windows
    service: system
detection:
    selection_eventid:
        EventID: 7045
---
id: 7b9a650e-6788-4fdf-888d-ec7c0a62810d
logsource:
    product: windows
    category: driver_load
detection:
    selection_eventid:
        EventID: 6
---
id: 4c54ba8f-73d2-4d40-8890-d9cf1dca3d30
logsource:
    product: windows
    service: security
detection:
    selection_eventid:
        EventID: 4697
