action: global
title: Invoke-Obfuscation RUNDLL LAUNCHER
id: 11b52f18-aaec-4d60-9143-5dd8cc4706b9
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
status: experimental
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
references:
    - https://github.com/Neo23x0/sigma/issues/1009 #(Task 23)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
falsepositives:
    - Unknown
level: medium
detection:
    selection:
        - ImagePath|re: '(?i).*rundll32(?:\.exe)?(?:\s+)?shell32\.dll.*shellexec_rundll.*powershell.*\"'
---
logsource:
    product: windows
    service: system
detection:
    selection_id:
        EventID: 7045
    condition: selection and selection_id
---
logsource:
    product: windows
    category: driver_load
detection:
    condition: selection
---
 logsource:
     product: windows
     service: security
 detection:
     selection_id:
         EventID: 4697
     condition: selection and selection_id
