id: a122ac13-daf8-4175-83a2-72c387be339d
title: Security Event log cleared
status: experimental
description: |
  'Checks for event id 1102 which indicates the security event log was cleared.'
reference: Azure Sentinel
author: Saw Winn Naung
severity: Medium
logsource:                     
    service: security  
    product: windows 
tags:

  - attack.t1107
detection:
    selection:
        EventID: 1102
    condition: selection
fields:
    - fields in the log source that are important to investigate further
falsepositives:
    - Legitimate administrative activity
