title: Explicit credentials logon
description: Detect explicit credentials logon and account impersonation
reference:
  - https://www.reddit.com/r/sysadmin/comments/1yzjul/restricting_interactive_logon_but_allow_runas/
status: experimental
author: juju4
tags:
  - attack.lateral_movement
logsource:
    product: windows
    service: security
    description: 'Requirements: Identifiable administrators usernames (pattern or special unique character), internal policy mandating use only as secondary account'
detection:
    selection:
        EventID: 4648
        LogonType:
          - 2
          - 10
        LogonProcess:
          - C:\Windows\System32\winlogon.exe
          - C:\Windows\System32\lsass.exe
        SubjectAccountName:
          - '*-adm'
    filter:
        SubjectAccountName:
          - '*$'
          - '-'
        UsedAccountName: '*$'
    condition: selection and not filter
falsepositives: 
    - Legitimate administrative activity
    - Legitimate service accounts login on behalf of users
level: low
