title: New Uer Created And Added To The Built-in Administrators Group
id: aa1eff90-29d4-49dc-a3ea-b65199f516db
description: Identifies when a user account was created and then added to the builtin Administrators group. This should be monitored closely and all additions reviewed.
author: sawwinnnaung
references: 
  - Azure Sentinel  
date: 2021/08/15
level: low
logsource:          
    service: Security 
    product: windows
tags:
  - attack.persistence
  - attack.privilege_escalation
relevantTechniques:
  - attack.t1098
  - attack.t1078
detection:
    selection:
        EventID: 
          - 4720
          - 4732
    condition: selection  