title: Access to ADMIN$ Share
description: 
status: experimental
author: Florian Roth
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4732
        GroupName: Administrators
    filter:
        SubjectAccountName: '*$'
    condition: selection and not filter
falsepositives: 
    - Legitimate administrative activity
level: low
