---
action: global
title: Certutil Encode
status: experimental
description: 'Detects suspicious a certutil command that used to encode files, which is sometimes used for data exfiltration' 
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
    - https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
logsource:
    product: windows
author: Florian Roth
date: 2019/02/24 
detection:
    condition: selection
falsepositives:
    - unknown
level: medium
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine: 
            - 'certutil -f -encode *'
            - 'certutil.exe -f -encode *'
            - 'certutil -encode -f *'
            - 'certutil.exe -encode -f *'
---
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection:
        EventID: 4688
        ProcessCommandLine: 
            - 'certutil -f -encode *'
            - 'certutil.exe -f -encode *'
            - 'certutil -encode -f *'
            - 'certutil.exe -encode -f *'

