title: Mimikatz Use
id: 06d71506-7beb-4f22-8888-e2e5e2ca7fd8
description: This method detects mimikatz keywords in different Eventlogs (some of them only appear in older Mimikatz version that are however still used by different threat groups)
status: experimental
author: Florian Roth (rule), David ANDRE (additional keywords)
date: 2017/01/10
modified: 2021/12/20
references:
    - https://tools.thehacker.recipes/mimikatz/modules
tags:
    - attack.s0002
    - attack.t1003          # an old one
    - attack.lateral_movement
    - attack.credential_access
    - car.2013-07-001
    - car.2019-04-004
    - attack.t1003.002
    - attack.t1003.004
    - attack.t1003.001
    - attack.t1003.006
logsource:
    product: windows
detection:
    keywords:
        - '<3 eo.oe'
        - 'crypto::capi'
        - 'crypto::certificates'
        - 'crypto::certtohw'
        - 'crypto::cng'
        - 'crypto::extract'
        - 'crypto::hash'
        - 'crypto::keys'
        - 'crypto::providers'
        - 'crypto::sc'
        - 'crypto::scauth'
        - 'crypto::stores'
        - 'crypto::system'
        - 'crypto::tpminfo'
        - 'dpapi::blob'
        - 'dpapi::cache'
        - 'dpapi::capi'
        - 'dpapi::chrome'
        - 'dpapi::cloudapkd'
        - 'dpapi::cloudapreg'
        - 'dpapi::cng'
        - 'dpapi::create'
        - 'dpapi::cred'
        - 'dpapi::credhist'
        - 'dpapi::luna'
        - 'dpapi::masterkey'
        - 'dpapi::protect'
        - 'dpapi::ps'
        - 'dpapi::rdg'
        - 'dpapi::sccm'
        - 'dpapi::ssh'
        - 'dpapi::tpm'
        - 'dpapi::vault'
        - 'dpapi::wifi'
        - 'dpapi::wwman'
        - 'eo.oe.kiwi'
        - 'event::clear'
        - 'event::drop'
        - 'gentilkiwi.com'
        - 'id::modify'
        - 'kerberos::ask'
        - 'kerberos::clist'
        - 'kerberos::golden'
        - 'kerberos::hash'
        - 'kerberos::list'
        - 'kerberos::ptc'
        - 'kerberos::ptt'
        - 'kerberos::purge'
        - 'kerberos::tgt'
        - 'Kiwi Legit Printer'
        - 'lsadump::backupkeys'
        - 'lsadump::cache'
        - 'lsadump::changentlm'
        - 'lsadump::dcshadow'
        - 'lsadump::dcsync'
        - 'lsadump::lsa'
        - 'lsadump::mbc'
        - 'lsadump::netsync'
        - 'lsadump::packages'
        - 'lsadump::postzerologon'
        - 'lsadump::RpData'
        - 'lsadump::sam'
        - 'lsadump::secrets'
        - 'lsadump::setntlm'
        - 'lsadump::trust'
        - 'lsadump::zerologon'
        - 'mimidrv.sys'
        - '\mimilib.dll'
        - 'misc::aadcookie'
        - 'misc::clip'
        - 'misc::cmd'
        - 'misc::compress'
        - 'misc::detours'
        - 'misc::efs'
        - 'misc::lock'
        - 'misc::memssp'
        - 'misc::mflt'
        - 'misc::ncroutemon'
        - 'misc::ngcsign'
        - 'misc::printnightmare'
        - 'misc::regedit'
        - 'misc::sccm'
        - 'misc::shadowcopies'
        - 'misc::skeleton'
        - 'misc::spooler'
        - 'misc::taskmgr'
        - 'misc::wp'
        - 'misc::xor'
        - 'net::alias'
        - 'net::deleg'
        - 'net::group'
        - 'net::if'
        - 'net::serverinfo'
        - 'net::session'
        - 'net::share'
        - 'net::stats'
        - 'net::tod'
        - 'net::trust'
        - 'net::user'
        - 'net::wsession'
        - ' p::d '
        - 'privilege::backup'
        - 'privilege::debug'
        - 'privilege::driver'
        - 'privilege::id'
        - 'privilege::name'
        - 'privilege::restore'
        - 'privilege::security'
        - 'privilege::sysenv'
        - 'privilege::tcb'
        - 'process::exports'
        - 'process::imports'
        - 'process::list'
        - 'process::resume'
        - 'process::run'
        - 'process::runp'
        - 'process::start'
        - 'process::stop'
        - 'process::suspend'
        - 'rpc::close'
        - 'rpc::connect'
        - 'rpc::enum'
        - 'rpc::server'
        - 'sekurlsa::backupkeys'
        - 'sekurlsa::bootkey'
        - 'sekurlsa::cloudap'
        - 'sekurlsa::credman'
        - 'sekurlsa::dpapi'
        - 'sekurlsa::dpapisystem'
        - 'sekurlsa::ekeys'
        - 'sekurlsa::kerberos'
        - 'sekurlsa::krbtgt'
        - 'sekurlsa::livessp'
        - 'sekurlsa::logonpasswords'
        - 'sekurlsa::minidump'
        - 'sekurlsa::msv'
        - 'sekurlsa::process'
        - 'sekurlsa::pth'
        - 'sekurlsa::ssp'
        - 'sekurlsa::tickets'
        - 'sekurlsa::trust'
        - 'sekurlsa::tspkg'
        - 'sekurlsa::wdigest'
        - 'service::me'
        - 'service::preshutdown'
        - 'service::remove'
        - 'service::resume'
        - 'service::shutdown'
        - 'service::start'
        - 'service::stop'
        - 'service::suspend'
        - 'sid::add'
        - 'sid::clear'
        - 'sid::lookup'
        - 'sid::modify'
        - 'sid::patch'
        - 'sid::query'
        - ' s::l '
        - 'standard::answer'
        - 'standard::base64'
        - 'standard::cd'
        - 'standard::cls'
        - 'standard::coffee'
        - 'standard::exit'
        - 'standard::hostname'
        - 'standard::localtime'
        - 'standard::log'
        - 'standard::sleep'
        - 'standard::version'
        - 'token::elevate'
        - 'token::list'
        - 'token::revert'
        - 'token::run'
        - 'token::whoami'
        - 'ts::logonpasswords'
        - 'ts::mstsc'
        - 'ts::multirdp'
        - 'ts::remote'
        - 'ts::sessions'
        - 'vault::cred'
        - 'vault::list'
    filter:
        EventID: 15  # Sysmon's FileStream Events (could cause false positives when Sigma rules get copied on/to a system)
    condition: keywords and not filter
falsepositives:
    - Naughty administrators
    - Penetration test
    - AV Signature updates
    - Files with Mimikatz in their filename
level: critical
