title: QuarksPwDump clearing access history
status: experimental
description: Detects QuarksPwDump clearing access history in hive
author: Florian Roth
date: 2017/05/15
tags:
  - attack.credential_access
  - attack.t1003
level: critical
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 16
        HiveName: '*\AppData\Local\Temp\SAM*.dmp'
    condition: selection
falsepositives:
    - Unknown
