action: global
title: Invoke-Obfuscation WMIC LAUNCHER
id: fa5da811-5463-4ca0-8884-6e893514cb30
description: Detects Obfuscated Powershell via WMIC LAUNCHER
status: experimental
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
references:
    - https://github.com/Neo23x0/sigma/issues/1009 #(Task 22)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
falsepositives:
    - Unknown
level: medium
detection:
    selection_1:
        - ImagePath|re: >
          '(?i).*wmic(?:\.exe)?(?:\s+)?(?:"|')?process(?:"|')?.*call.*create.*powershell'
    condition: selection and selection_1
---
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 6
---
 logsource:
     product: windows
     service: security
 detection:
     selection:
         EventID: 4697 
