title: Admin user remote login
description: Detect remote login by Administrator users depending on internal pattern
reference:
  - https://www.reddit.com/r/sysadmin/comments/1yzjul/restricting_interactive_logon_but_allow_runas/
status: experimental
author: juju4
logsource:
    product: windows
    service: security
    description: 'Requirements: Identifiable administrators usernames (pattern or special unique character. ex: "Admin-*"), internal policy mandating use only as secondary account'
detection:
    selection:
        EventID: 4624
        LogonType: 10
        LogonProcess:
          - C:\Windows\System32\winlogon.exe
          - C:\Windows\System32\lsass.exe
    filter:
        NewAccountName: 'Admin-*'
    condition: selection and not filter
falsepositives: 
    - Legitimate administrative activity
level: low
