action: global
title: Invoke-Obfuscation ENCODING OBFUSCATION\8
id: 00559152-8ef6-4e83-8daf-69ce2c98c850
description: Detects Obfuscated Powershell via ENCODING OBFUSCATION\8
status: experimental
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
references:
    - https://github.com/Neo23x0/sigma/issues/1009 #(Task 18)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
falsepositives:
    - Unknown
level: medium
detection:
    selection_1:
        - ImagePath|re: >-
            '(?i)\'\s+\'\s?\|(?:foreach|\s?%).*(?:\[string\]::join|remove\.tostring).*trim.*split.*(?:char|substring\.tostring).*\}'
    condition: selection and selection_1
---
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 6
---
 logsource:
     product: windows
     service: security
 detection:
     selection:
         EventID: 4697 
