title: Windows Processes Suspicious Parent
status: experimental
description: Detect suspicious parent processes of well-known Windows processes
author: 'vburov'
references:
    - https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
    - https://attack.mitre.org/techniques/T1036/
date: 2019/02/23
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    product: windows
    service: sysmon
    definition: 'Requirements: Sysmon'
detection:
    selection1:
        EventID: 1
        Image:
            - '*\svchost.exe'
            - '*\taskhost.exe'
    filter1:
        ParentImage:
            - '*\services.exe'
            - '*\MsMpEng.exe'
            - '*\rpcnet.exe'
            - '*\svchost.exe'
    selection2:
        EventID: 1
        Image:
            - '*\lsm.exe'
            - '*\lsass.exe'
            - '*\services.exe'
            - '*\lsaiso.exe'
    filter2:
        ParentImage:
            - '*\wininit.exe'
    selection3:
        EventID: 1
        Image:
            - '*\csrss.exe'
            - '*\wininit.exe'
            - '*\winlogon.exe'
    filter3:
        ParentImage:
            - '*\smss.exe'
    condition: ( selection1 and not filter1 ) or ( selection2 and not filter2 ) or ( selection3 and not filter3 )
falsepositives:
    - Unknown please report back
level: high
