action: global
title: Tap Driver Installation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
status: experimental
description: Well-known TAP software installation. Possible preparation for data exfiltration using tunnelling techniques
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
falsepositives:
    - Legitimate OpenVPN TAP insntallation
level: medium
detection:
    selection_1:
        ImagePath|contains: 'tap0901'
    condition: selection and selection_1
tags:
    - attack.exfiltration
    - attack.t1048
---
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
---
logsource:
    product: windows
    category: driver_load
---
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4697
