title: User account enabled and disabled 
id: 3d023f64-8225-41a2-9570-2bd7c2c4535e
description: 'Identifies when a user account is enabled and then disabled. This can be an indication of compromise and
  an adversary attempting to hide in the noise.'
references: Azure Sentinel  
level: Medium
logsource:          
    service: Security 
    product: windows 
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1098
  - attack.t1078
detection:
    selection:
        EventID: 
          - 4722
          - 4725
    condition: selection 
