title: T1012 SysKey Registry Keys Access
description: Detects handle requests and access operations to specific registry keys to calculate the SysKey
status: experimental
date: 2019/08/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/07_discovery/T1012_query_registry/syskey_registry_access.md
tags:
    - attack.discovery
    - attack.t1012
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 
            - 4656
            - 4663
        ObjectType: 'key'
        ObjectName:
            - '*lsa\JD'
            - '*lsa\GBG'
            - '*lsa\Skew1'
            - '*lsa\Data'
    condition: selection
falsepositives:
    - Unknown
level: critical