title: User account created and deleted within 10 mins
id: 4b93c5af-d20b-4236-b696-a28b8c51407f
description: 'Identifies when a user account is created and then deleted within 10 minutes. This can be an indication of compromise and
  an adversary attempting to hide in the noise.'
references: Azure Sentinel  
level: Medium
logsource:          
    service: Security 
    product: windows 
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1098
  - attack.t1078
detection:
    selection:
        EventID: 4720
    condition: selection  