title: Windows-ACL-AdminSDHolder
id: 618aca70-906b-11ea-bb37-0242ac130002
description: Detecting persistence behavior using AdminSDholder
status: experimental
references:
    - https://github.com/infosecn1nja/AD-Attack-Defense/blob/master/README.md
    - https://github.com/0Kee-Team/WatchAD/blob/master/modules/detect/event_log/persistence/AdminSDHolder.py
author: 12306Bro
date: 2020/05/05
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1098
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 5136
    selection2:
        EventID: 4780
    timeframe: 60m
    condition: all of them
falsepositives:
    - Directory service objects have been modified. AdminSDHolder changes, generally used for permission maintenance, since changes are rare.
level: medium
