title: Account added and removed from privileged groups
id: 7efc75ce-e2a4-400f-a8b1-283d3b0f2c60
description: Identifies accounts that are added to privileged group and then quickly removed, which could be a sign of compromise.
references: 
  - Azure Sentinel
date: 2021/08/15
level: low
logsource:          
    service: Security 
    product: windows 
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1098
  - attack.t1078
detection:
    selection1:
        EventID: 
          - 4728
          - 4732
          - 4756
    selection2:
        EventID: 
          - 4729
          - 4733
          - 4757    
    condition: selection1 or selection2
