title: Meterpreter or Cobalt Strike getsystem service installation
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting a specific service installation
author: Teymur Kheirkhabarov
date: 2019/10/26
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
tags:
    - attack.privilege_escalation
    - attack.t1134
logsource:
    product: windows
    service: system
detection:
    service_installation_event:
        EventID:
            - 7045
            - 4697
    cmd_or_comspec:
        ServiceFileName:
            - '*cmd*'
            - '*COMSPEC*'
    getsystem_technique_1:
        ServiceFileName: '*cmd* /c echo * > \\.\pipe\*'      #cmd.exe /c echo 559891bb017 > \\.\pipe\5e120a    cmd /c echo 559891bb017 > \\.\pipe\5e120a
    getsystem_cobaltstrike_technique_1:
        ServiceFileName: '%COMSPEC% /c echo * > \\.\pipe\*'      #%COMSPEC% /c echo 559891bb017 > \\.\pipe\5e120a
    getsystem_technique_2:
        ServiceFileName: '*rundll32*.dll,a /p:*'        #rundll32.exe C:\Users\test\AppData\Local\Temp\tmexsn.dll,a /p:tmexsn
    condition: service_installation_event and (getsystem_technique_1 or getsystem_cobaltstrike_technique_1 or getsystem_technique_2)
fields:
    - ServiceFileName
falsepositives:
    - Penetration Test
    - Unknown
level: critical