title: RDP Login from localhost
description: RDP login with localhost source address may be a tunnelled login
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
tags:
    - attack.lateral_movement
status: experimental
author: Thomas Patzke
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 10
        IpAddress:
            - "::1"
            - "127.0.0.1"
    condition: selection
falsepositives:
    - Legitimate administration
level: low
