title: Process execution anomaly
id: 2c55fe7a-b06f-4029-a5b9-c54a2320d7b8
description: 'Identifies anomalous executions of sensitive processes which are often leveraged as attack vectors.'
references: Azure Sentinel
level: Medium
logsource:          
    service: Security 
    product: windows 
tags:
  - attack.execution
  - attack.t1064
detection:
    selection:
        EventID: 4688
        NewProcessName|contains: 
          - 'powershell.exe'
          - 'cmd.exe'
          - 'wmic.exe'
          - 'psexec.exe'
          - 'cacls.exe'
          - 'rundll.exe'
    condition: selection   
