title: Hacktool Use
description: This method detects well-known keywords, certain field combination that appear in Windows Eventlog when certain hack tools are used
author: Florian Roth
tags:
    - attack.discovery
    - attack.execution
    - attack.t1087
    - attack.t1075
    - attack.t1114
    - attack.t1059
logsource:
    product: windows
    service: security
detection:
    # Ruler https://github.com/sensepost/ruler
    selection1:
        EventID: 
          - 4776
          - 4624
          - 4625
        WorkstationName: 'RULER'
    condition: selection1
falsepositives:
    - Unlikely
level: critical
