---
action: global
title: Suspicious Calculator Usage
description: Detects suspicious use of calc.exe with command line parameters or in a suspicious directory, which is likely caused by some PoC or detection evasion
status: experimental
references:
    - https://twitter.com/ItsReallyNick/status/1094080242686312448
author: Florian Roth
date: 2019/02/09
detection:
    condition: selection1 or ( selection2 and not filter2 )
falsepositives: 
    - Unknown
level: high
---
logsource:
    product: windows
    service: sysmon
detection:
    selection1:
        EventID: 1
        CommandLine: '*\calc.exe *'
    selection2:
        EventID: 1
        Image: '*\calc.exe'
    filter2:
        Image: '*\Windows\Sys*'
---
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection1:
        EventID: 4688
        ProcessCommandLine: '*\calc.exe *'
    selection2:
        EventID: 1
        Image: '*\calc.exe'
    filter2:
        Image: '*\Windows\Sys*'