action: global
title: Zip A Folder With PowerShell For Staging In Temp
status: experimental
author: frack113
date: 2021/07/20
description: Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1074.001/T1074.001.md
tags:
    - attack.collection
    - attack.t1074.001
falsepositives:
    - Unknown
level: medium
---
id: 85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains|all:
            - 'Compress-Archive '
            - ' -Path '
            - ' -DestinationPath '
            - '$env:TEMP\'
    condition: selection 
---
id: 71ff406e-b633-4989-96ec-bc49d825a412
logsource:
    product: windows
    service: powershell-classic
    definition: fields have to be extract from event
detection:
    selection:
        HostApplication|contains|all:
            - 'Compress-Archive '
            - ' -Path '
            - ' -DestinationPath '
            - '$env:TEMP\'
    condition: selection 
---
id: b7a3c9a3-09ea-4934-8864-6a32cacd98d9
logsource:
    product: windows
    service: powershell
detection:
    selection:
        ContextInfo|contains|all:
            - 'Compress-Archive '
            - ' -Path '
            - ' -DestinationPath '
            - '$env:TEMP\'
    condition: selection 