title: Suspicious outbound Kerberos connection
status: experimental
description: Detects suspicious outbound network activity via kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.
references:
    - https://github.com/GhostPack/Rubeus8
author: Ilyas Ochkov, oscd.community
date:  2019/10/24
tags:
    - attack.lateral_movement
    - attack.t1208
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5156
        DestinationPort: 88
    filter:
        Image:
            - '*\lsass.exe'
            - '*\opera.exe'
            - '*\chrome.exe'
            - '*\firefox.exe'
    condition: selection and not filter 
falsepositives:
    - Other browsers
level: high