title: Suspicous Logon with Explicit Credentials
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
status: experimental
description: Detects the attack technique pass the hash which is used to move laterally inside the network
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
author: Teymur Kheirkhabarov '@HeirhabarovT', Zach '@svch0st'
date: 2020/10/05
tags:
logsource:
    product: windows
    service: security
    definition: 
detection:
    selection:
        EventID: 4648
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\winrs.exe'
            - '\wmic.exe'
            - '\net.exe'
            - '\net1.exe'
            - '\reg.exe'
            - '\winrs.exe'
    filter:
        Target_Server_Name: 'localhost'
    condition: selection and not filter
falsepositives:
level: medium
