title: Process Execution Anomaly
id: 2c55fe7a-b06f-4029-a5b9-c54a2320d7b8
description: 'Identifies anomalous executions of sensitive processes which are often leveraged as attack vectors.'
author: sawwinnnaung
references: 
  - https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/TimeSeriesAnomaly-ProcessExecutions.yaml
date: 2021/08/15
level: medium
tags:
  - attack.execution
  - attack.t1064
logsource:          
    product: windows 
    category: process_creation 
detection:
    selection:
        NewProcessName|contains: 
          - 'powershell.exe'
          - 'cmd.exe'
          - 'wmic.exe'
          - 'psexec.exe'
          - 'cacls.exe'
          - 'rundll.exe'
    condition: selection   
