title: Mounting of ISO Images
id: 0248a7bc-8a9a-4cd8-a57e-3ae8e073a073
description: Detects the mount of ISO images on an endpoint
status: experimental
date: 29/05/2021
author: Syed Hasan (@syedhasan009)
tags:
    - attack.initial_access
logsource:
    product: windows
    service: security
detection:
    selection: 
        EventID: 4663
        ObjectServer: 'Security'
        ObjectType: 'File'
        ObjectName: '\Device\CdRom*'
    condition: selection
falsepositives:
    - Software installation ISO files
level: Medium