title: PowerShell Scripts Installed as Services
id: 3f07b9d1-2082-4c56-9277-613a621983cc
description: Detects powershell script installed as a Service
status: experimental
author: oscd.community, Natalia Shornikova
date: 2020/10/06
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
tag:
    - attack.execution
    - attack.t1569.002
logsource:
    product: windows
detection:
    selection:
      EventID: 1
      ParentImage|endswith: '\services.exe'
      CommandLine|contains: 
        - 'powershell'
        - 'pwsh'
    selection2:
      EventID:
        - 7045
        - 4697
      ServiceFileName|contains: 
        - 'powershell'
        - 'pwsh'
    selection3:
      EventID: 13
      TargetObject: '*\Services\*\ImagePath'
      Details|contains:
        - 'powershell'
        - 'pwsh'
    condition: selection or selection2 or selection3
falsepositives: Unknown
level: high