title: Security Eventlog Cleared
id: f2f01843-e7b8-4f95-a35a-d23584476423
description: Some threat groups tend to delete the local 'Security' Eventlog using certain utitlities
references:
  - https://car.mitre.org/wiki/CAR-2016-04-002
tags:
    - attack.defense_evasion
    - attack.t1070          # an old one
    - attack.t1070.001
    - car.2016-04-002
author: Florian Roth
date: 2017/02/19
modified: 2020/08/23
logsource:
    product: windows
detection:
    selection1:
        service: security
        EventID:
            - 517
            - 1102
            - 104
    selection2:
        service: system
        EventID:
            - 1100
            - 1102
    condition: selection1 or selection2
falsepositives:
    - Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)
    - System provisioning (system reset before the golden image creation)
level: high
