title: Suspicious SAM Dumps to AppData
status: experimental
description: Detects suspicious SAM dump activity as cause by QuarksPwDump and other password dumpers
author: Florian Roth
logsource:
    product: windows
    service: system
    description: The source of this type of event is Kernel-General
detection:
    selection:
        EventID: 16
    keywords:
        - '*\AppData\Local\Temp\SAM-*.dmp *'
    condition: selection and keywords
falsepositives: 
    - Penetration testing
level: high
