action: global
title: Detects Possible Applocker Bypass
description: Detects execution of executables that can be used to bypass Applocker whitelisting
status: experimental
reference:
    - https://github.com/subTee/ApplicationWhitelistBypassTechniques/blob/master/TheList.txt
    - https://room362.com/post/2014/2014-01-16-application-whitelist-bypass-using-ieexec-dot-exe/
    - https://twitter.com/monoxgas/status/895045566090010624
    - https://twitter.com/0rbz_/status/912530504871759872
    - https://twitter.com/KyleHanslovan/status/914800377580503040
    - https://gist.github.com/api0cradle/8cdc53e2a80de079709d28a2d96458c2
    - https://github.com/api0cradle/UltimateAppLockerByPassList/blob/master/README.md
    - https://www.hexacorn.com/blog/2017/10/04/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline-part-2/
    - https://www.hexacorn.com/blog/2017/10/22/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline-part-3/
author: juju4
detection:
    selection:
        CommandLine: 
            - '*\msdt.exe*'
            - '*\installutil.exe*'
            - '*\regsvcs.exe*'
            - '*\regasm.exe*'
            - '*\regsvr32.exe*'
            - '*\msbuild.exe*'
            - '*\ieexec.exe*'
            - '*\mshta.exe*'
            # higher risk of false positives
#            - '*\cscript.EXE*'
            - '*\SyncAppvPublishingServer.exe*'
            - '*\pcalua.exe*-a*'
            - '*\scriptrunner.exe*-appvscript*'
            - '*\sqldumper.exe*'
            - '*\hh.exe*'
            - '*\AppVLP.exe*'
            - '*\bginfo.exe*.bgi*'
            - '*\msdt.exe*'
            - '*\presentationhost.exe*'
            - '*\cdb.exe*'
            - '*\dnx.exe*'
            - '*\rcsi.exe*'
            - '*\csi.exe*'
            - '*\control.exe*'
            - '*\msxsl.exe*'
            - '*\cmstp.exe*'
            - '*\xwizard.exe*'
            - '*\fsi.exe*'
            - '*\odbcconf.exe*'
            - '*\odbcad32.exe*'
            - '*\WinMail.exe*'
            - '*\java.exe*-agentlib*'
            - '*\java.exe*-agentpath*'
            - '*\stubapp.exe*-i*'
    condition: selection
falsepositives: 
    - False positives depend on scripts and administrative tools used in the monitored environment
level: medium
---
# Windows Audit Log
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection:
        EventID: 4688
---
# Sysmon
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
