title: MSSQL Failed Logon From External Network
id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
status: experimental
description: Repeatedly wrong login from external network can be a bruteforce attack.
author: j4son
date: 2023/05/29
references:
    - https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
tags:
    - attack.credential_access
    - attack.T1110
logsource:
    category: database
    definition: 'Requirements: Must enable MSSQL authentication.'
detection:
    selection:
      EventID:
        - 18456
    filter:
        IpAddress|startswith:
            - '10.' #filter_range_IP: 10.0.0.0/8
            - '172.16.' #filter_range_IP: 172.16.0.0/12
            - '172.17.'
            - '172.18.'
            - '172.19.'
            - '172.20.'
            - '172.21.'
            - '172.22.'
            - '172.23.'
            - '172.24.'
            - '172.25.'
            - '172.26.'
            - '172.27.'
            - '172.28.'
            - '172.29.'
            - '172.30.'
            - '172.31.'
            - '192.168.' #filter_range_IP: 192.168.0.0/16
            - '127.' #filter_loop_back: 127.0.0.0/8
            - '169.254.' #fileter_link-local_addressing: 169.254.0.0/16
    condition: selection and not filter
falsepositives:
    - Legitimate logon
level: high
