title: HackTool - Potential EDRSilencer Execution
id: 98054878-5eab-434c-85d4-72d4e5a3361b
status: experimental
description: Detects execution of EDRSilencer, a tool that abuses Windows Filtering Platform (WFP) to block the outbound traffic of running EDR agents based on their PE information.
references:
    - https://github.com/netero1010/EDRSilencer
tags:
    - attack.defense_evasion
    - attack.t1562
author: Thodoris Polyzos (@SmoothDeploy)
date: 2024/01/15
logsource:
    category: windows_filtering_platform
    product: windows
    service: security
    definition: 'Requirements: Audit Filtering Platform Policy Change needs to be enabled'
detection:
    selection_5447:
        EventID: 5447
        FilterName|contains: 'Custom Outbound Filter'
    selection_5441:
        EventID: 5441
        FilterName|contains: 'Custom Outbound Filter'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
