title: Group Policy Abuse for Privilege
id: 1c480e10-7ee1-46d4-8ed2-85f9789e3ce4
status: experimental
description: Detects the first occurrence of a modification to Group Policy Object Attributes
    to add privileges to user accounts or use them to add users as local admins.
author: Josh Nickels, Marius Rothenbücher
references:
    - https://www.elastic.co/guide/en/security/current/group-policy-abuse-for-privilege-addition.html#_setup_275
date: 2024-09-04
logsource:
    product: windows
    service: security
    definition: The "Audit Directory Service Changes" logging policy must be configured in order to receive events.
detection:
    condition: all of selection_*
    selection_event:
        EventID: 5136
    selection_attributes:
        AttributeLDAPDisplayName: 'gPCMachineExtensionNames'
        AttributeValue|contains:
            - '827D319E-6EAC-11D2-A4EA-00C04F79F83A'
            - '803E14A0-B4FB-11D0-A0D0-00A0C90F574B'
falsepositives:
    - Users allowed to perform these modifications (user found in field SubjectUserName)
level: medium
tags:
    - attack.privilege-escalation
    - attack.t1484.001
