title: Suspicious NTLM Logon Failure Without WorkstationName - Possible Impacket
id: a5b0db6d-7f9b-4d13-9f8e-b1b26f4625fa
status: experimental
description: Detects failed NTLM logons (Event ID 4625) with specific attributes and no workstation name, which could indicate malicious activity such as NTLM relay or password spraying.
author: Charles BLANC-ROLIN @woundride
date: 2025/04/19
logsource:
  product: windows
  service: security
  category: logon
detection:
  selection:
    AuthenticationPackageName: NTLM
    EventID: 4625
    LogonType: 3
    KeyLength: 0
    SubjectUserSid: S-1-0-0
    WorkstationName: '-'
  condition: selection
fields:
  - SubjectUserName
  - IpAddress
  - LogonProcessName
  - WorkstationName
  - TargetUserSid
falsepositives:
  - Some legitimate system processes or misconfigured clients may lack workstationName
level: high
tags:
  - attack.credential_access
  - attack.t1110
  - windows
  - ntlm
