title: BlueSky Ransomware Detected by Filename
id: eee8311f-a752-44f0-bf2f-6b007db16300
status: test
description: Detect BlueSky Ransomware based on filename after being encrypted.
references:
    - https://unit42.paloaltonetworks.com/bluesky-ransomware/
author: j4son
date: 2023/05/23
tags:
    - attack.impact
    - attack.T1486
logsource:
    product: windows
    service: security
detection:
    eventid_1:
        EventID:
            - 4663
            - 4656
    eventid_2:
        EventID: 5145
    filename_1:
        ObjectName|endswith: '.bluesky'
    filename_2:
        ObjectName|contains: 'DECRYPT FILES BLUESKY'
    filename_3:
        RelativeTargetName|endswith: '.bluesky'
    filename_4:
        RelativeTargetName|contains: 'DECRYPT FILES BLUESKY'
    condition: (eventid_1 and (filename_1 or filename_2)) or (eventid_2 and (filename_3 or filename_4))
falsepositives: 
    - Unknown
level: Critical
