title: Kerberoasting Activity - Initial query
id: d04ae2b8-ad54-4de0-bd87-4bc1da66aa59
status: experimental
description: This rule will collect the data needed to start looking into possible kerberoasting activity.
             Further analysis or computation within the query is needed focusing on requests from one specific host/IP towards 
             multiple service names within a time period of 5 seconds. You can then set a threshold for the number of requests 
             and time between the requests to turn this into an alert.
date: 2022/01/21
author: \@kostastsale
references: 
 - https://www.trustedsec.com/blog/art_of_kerberoast/
 - https://adsecurity.org/?p=3513
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
          4769
        Status:
         '0x0' # Translated as status from failure code field. Query only for successes
        TicketEncryptionType:
          '0x17' # RC4 ticket encryption type
    filter:
        ServiceName|endswith:
         -  'krbtgt' # Ignore requests for the krbtgt service
         -  '$' # Ignore requests from service names that end with $ which are associated with genuine kerberos traffic
        TargetUserName|contains:
         -  '$@' # Ignore requests from machines
    condition: selection and not filter
falsepositives:
    - Legacy applications 
level: medium
tags:
    - attack.credential_access
    - attack.t1558.003