title: External Remote Service Logon from Public IP
id: 259a9cdf-c4dd-4fa2-b243-2269e5ab18a2
status: experimental
description: Detects successful logon from public IP address via RDP, SMB, etc. This can indicate a publicly-exposed RDP or SMB port.
references:
    - https://www.inversecos.com/2020/04/successful-4624-anonymous-logons-to.html
    - https://twitter.com/Purp1eW0lf/status/1616144561965002752
author: Micah Babinski, @micahbabinski
date: 2023/01/19
tags:
    - attack.initial_access
    - attack.credential_access
    - attack.t1133
    - attack.t1078
    - attack.t1110
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType:
            - 3 # Network logon such as SMB
            - 10 # RemoteInteractive logon such as RDP
    filter_username:
        SubjectUserName: '-'
    filter_src_ip:
        - IpAddress|cidr: 10.0.0.0/8
        - IpAddress|cidr: 172.16.0.0/12
        - IpAddress|cidr: 192.168.0.0/16
        - IpAddress|cidr: 224.0.0.0/4
        - IpAddress|cidr: 127.0.0.0/8
    condition: selection and not filter_username and not filter_src_ip
falsepositives:
    - Legitimate or intentional inbound connections from public IP addresses on RDP or SMB ports.
level: medium