title: User with Privileges Logon
id: 94309181-d345-4cbf-b5fe-061769bdf9cb
status: experimental
description: Detects logon with "Special groups" and "Special Privileges" can be thought of as Administrator groups or privileges.
author: frack113
date: 2022/10/14
references:
    - https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4672
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4964
logsource:
    service: security
    product: windows
detection:
    selection:
        EventID:
            - 4672
            - 4964
    condition: selection
falsepositives:
     - Unknown
level: medium
