title: Password Policy Enumerated
id: 12ba6a38-adb3-4d6b-91ba-a7fb248e3199
status: experimental
description: Detects when the password policy was enumerated.
references:
    - https://attack.mitre.org/techniques/T1201/
author: Zach Mathis
date: 2023/05/17
modified: 2023/05/17
tags:
    - attack.discovery
    - attack.t1201 # Password Policy Discovery
logsource:
    product: windows
    service: security
    definition: 'Advanced Audit Policy Configuration > Object Access > Audit SAM needs to be enabled.'
detection:
    selection:
        EventID: 4661 # A handle to an object was requested.
        AccessList|contains: '%%5392' # ReadPasswordParameters
        ObjectServer: 'Security Account Manager'
    condition: selection
level: medium