title: Win Susp Computer Name containing samtheadmin
id: 39698b3f-da92-4bc6-bfb5-645a98386e45
status: experimental
description: Detects suspicious computer name
author: elhoim
date: 2022/09/09
references:
    - https://twitter.com/malmoeb/status/1511760068743766026
    - https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py
    - https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py
tags:
    - cve.2021.42278
    - cve.2021.42287
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1078
logsource:
    category: security
    product: windows
detection:
    selection1:
        SamAccountName|startswith: 'SAMTHEADMIN-'
        SamAccountName|endswith: '$'
    selection2:
        TargetUserName|startswith: 'SAMTHEADMIN-'
        TargetUserName|endswith: '$'
    condition: 1 of selection*
    fields:
        - EventID
        - SamAccountName
        - SubjectUserName
        - TargetUserName
falsepositives:
     - Unknown
level: critical
