title: Suspicious Access to Browser Credential Files
id: 4b60e527-ec73-4b47-8cb3-f02ad927ca65
status: experimental
description: Detects attempts to access browser credential files, which may indicate credential dumping or theft activities.
references:
    - https://ipurple.team/2024/09/10/browser-stored-credentials/
author: 'Daniel Koifman (@Koifsec)'
date: 2024-10-21
tags:
    - attack.credential-access
    - attack.t1555.003
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit File System subcategory must be enabled. Additionally, each listed ObjectName must have "List folder/read data" auditing enabled.'
detection:
    selection:
        EventID: 4663
        ObjectType: 'File'
        AccessMask: '0x1'
        ObjectName|contains:
          - '\AppData\Local\Google\Chrome\User Data\Local State'
          - '\AppData\Local\Google\Chrome\User Data\Default\Network\Cookies'
          - '\AppData\Local\Google\Chrome\User Data\Default\Network\Cookies-journal'
          - '\AppData\Local\Google\Chrome\User Data\Default\Login Data'
          - '\AppData\Local\Google\Chrome\User Data\Default\Login Data-journal'
          - '\AppData\Local\Microsoft\Edge\User Data\Local State'
          - '\AppData\Local\Microsoft\Edge\User Data\Default\Network\Cookies'
          - '\AppData\Local\Microsoft\Edge\User Data\Default\Network\Cookies-journal'
          - '\AppData\Local\Microsoft\Edge\User Data\Default\Login Data'
          - '\AppData\Local\Microsoft\Edge\User Data\Default\Login Data-journal'
    filter:
        ProcessName|endswith:
          - '\chrome.exe'
          - '\msedge.exe'
          - '\chromium.exe'
          - '\microsoftedge.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
