title: Modification of msDS-ManagedAccountPrecededByLink Attribute
id: e8ea7198-c54f-40d2-a94b-13a3c168c6ec
status: experimental
description: |
    Detects modifications to the msDS-ManagedAccountPrecededByLink attribute, which may indicate an attempted or successful abuse of the BaD-Successor msDS-DelegatedManagedServiceAccount (DMSA) vulnerability.
    The DMSA is a new object class introduced in Windows Server 2025 that allows administrators to delegate the management of service accounts to other users or groups.
    Changes to this attribute by suspicious accounts or outside of normal administrative workflows are a strong signal of an attempted or successful abuse.
    If it is indeed modified by an account that is not typically responsible for such changes, it could indicate an attempt to exploit the BaD-Successor vulnerability for privilege escalation within the Windows Server 2025 Active Directory environment.
references:
    - https://www.akamai.com/blog/security-research/abusing-bad-successor-for-privilege-escalation-in-active-directory
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-05-24
tags:
    - attack.privilege-escalation
    - attack.t1078.002
    - attack.t1098
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Account Management > Audit User Account Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit Policies\Account Management\Audit User Account Management, DS Access > Audit Directory Service Changes, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit Policies\DS Access\Audit Directory Service Changes'
detection:
    selection:
        EventID: 5136
        ObjectClass: 'msDS-DelegatedManagedServiceAccount'
        AttributeLDAPDisplayName: 'msDS-ManagedAccountPrecededByLink'
    filter_main_legitimate_accounts:
        # Exclude modifications made by the system or legitimate administrative accounts
        - SubjectAccountName: 'SYSTEM'
        - SubjectAccountName|contains: 'admin'
    condition: selection and not filter_main_legitimate_accounts
fields:
    - SubjectAccountName # The user who modified the msDS-ManagedAccountPrecededByLink attribute
    - ObjectDN # The distinguished name of the object whose attribute was modified
falsepositives:
    - Legitimate administrative changes to the attribute
# The level is set to high because of the nature of this vulnerability and we may need to later lower it.
level: high
