title: Uncommon Scheduled Task Once 00:00
id: 970823b7-273b-460a-8afc-3a6811998529
description: Detects scheduled task creation events that include suspicious actions, and is run once at 00:00
status: experimental
author: pH-T
date: 2022/07/15
references:
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
logsource:
    category: process_creation
    product: windows
detection:
    image:
        Image|contains: '\schtasks.exe'
    selection_base:
        CommandLine|contains:
            - 'wscript'
            - 'vbscript'
            - 'cscript'
            - 'wmic '
            - 'wmic.exe'
            - 'regsvr32.exe'
            - 'powershell'
            - '\AppData\'
    selection_time:
        CommandLine|contains|all:
            - 'once'
            - '00:00'
    bad_name:
        CommandLine|contains: 'Joke'
    condition: image and selection_base and (selection_time or bad_name)
falsepositives:
    - Software installation
level: high
