title: Suspicious NTLM Logon Success
id: 798fd9eb-7151-43a1-9717-b2b164abfe91
status: experimental
description: Detects success NTLM logons (Event ID 4624) with specific attributes and no workstation name (possible Impacket) or WORKSTATION for name (possible Metasploit), which could indicate malicious activity.
author: Charles BLANC-ROLIN @woundride
date: 2025/04/19
modified: 2025/04/20
logsource:
  product: windows
  service: security
  category: logon
detection:
  selection:
    AuthenticationPackageName: NTLM
    EventID: 4624
    LogonType: 3
    KeyLength:
       - 0
       - 128
    SubjectUserSid: S-1-0-0
    WorkstationName:
        - '-'
        - WORKSTATION
  condition: selection
fields:
  - SubjectUserName
  - IpAddress
  - LogonProcessName
  - WorkstationName
  - TargetUserSid
falsepositives:
  - Some legitimate system processes or misconfigured clients may lack workstationName
level: high
tags:
  - attack.credential_access
  - attack.t1110
  - windows
  - ntlm
