title: Access Token Abuse
id: 02f7c9c1-1ae8-4c6a-8add-04693807f92f
status: experimental
level: high
description: 'This rule tries to detect token impersonation and theft. (Example: DuplicateToken(Ex) and ImpersonateLoggedOnUser with the LOGON32_LOGON_NEW_CREDENTIALS flag.)'
author: Michaela Adams, Zach Mathis
date: 2022/11/06
modified: 2022/11/06
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4624
        LogonType: 9
        LogonProcessName: 
            - Advapi  # This is used when the attacker is abusing PowerShell.
            - seclogo # This is used when the process is C:\Windows\System32\svchost.exe
        AuthenticationPackageName: Negotiate
        ImpersonationLevel: '%%1833' # Impersonation
    condition: selection
falsepositives:
references:
    - https://attack.mitre.org/techniques/T1134/001/
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1134.001