title: External Disk Drive Or USB Storage Device Was Recognized By The System
id: f69a87ea-955e-4fb4-adb2-bb9fd6685632
status: test
description: Detects external diskdrives or plugged in USB devices, EventID 6416 on Windows 10 or later
references:
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-6416
author: Keith Wright
date: 2019/11/20
modified: 2024/01/16
tags:
    - attack.t1091
    - attack.t1200
    - attack.lateral_movement
    - attack.initial_access
logsource:
    product: windows
    service: security
detection:
    selection_disk:
        EventID: 6416
        ClassName: 'DiskDrive'
    selection_usb:
        DeviceDescription: 'USB Mass Storage Device'
    condition: 1 of selection_*
falsepositives:
    - Likely
level: low
