title: Clear Windows security event logs
id: 55c5b112-5deb-48b7-8748-050192192cc9
status: experimental
description: Manual deletion of security event logs (Event ID 1102) which could indicate malicious activity.
references:
  - https://attack.mitre.org/techniques/T1070/001/
author: Charles BLANC-ROLIN @woundride
date: 2025/04/20
modified: 2025/04/20
logsource:
  product: windows
  service: eventlog
detection:
  selection:
    Channel: Security
    EventID: 1102
  condition: selection
fields:
  - SubjectUserName
  - SubjectDomainName
  - Computer
falsepositives:
  - Unknown
level: high
tags:
  - attack.defense_evasion
  - attack.t1070.001
  - windows
  - eventid.1102

