title: Windows Filtering Platform - Block Connection Event Involving EDR Agent Binary
id: a8fb2a20-c7b4-4514-bf84-abf31d594489
related:
    - id: eb2d07d4-49cb-4523-801a-da002df36602
      type: derived
status: experimental
description: |
    Detects a Windows Filtering Platform (WFP) blocked connection event involving common Endpoint Detection and Response (EDR) agents.
    Adversaries may use WFP filters to prevent Endpoint Detection and Response (EDR) agents from reporting security events.
references:
    - https://github.com/netero1010/EDRSilencer
    - https://github.com/amjcyber/EDRNoiseMaker
    - https://ghoulsec.medium.com/misc-series-4-forensics-on-edrsilencer-events-428b20b3f983
author: '@gott_cyber'
date: 2024/01/05
tags:
    - attack.defense_evasion
    - attack.t1562
logsource:
    product: windows
    service: security
detection:
    selection_5157:
        EventID: 5157
        Provider_Name: security
    selection_edr:
        Application|endswith:
            # Microsoft Defender for Endpoint and Microsoft Defender Antivirus
            - '\MsMpEng.exe'
            - '\MsSense.exe'
            - '\SenseIR.exe'
            - '\SenseNdr.exe'
            - '\SenseCncProxy.exe'
            - '\SenseSampleUploader.exe'
            # Elastic EDR
            - '\winlogbeat.exe'
            - '\elastic-agent.exe'
            - '\elastic-endpoint.exe'
            - '\filebeat.exe'
            # Trellix EDR
            - '\xagt.exe'
            # Qualys EDR
            - '\QualysAgent.exe'
            # SentinelOne
            - '\SentinelAgent.exe'
            - '\SentinelAgentWorker.exe'
            - '\SentinelServiceHost.exe'
            - '\SentinelStaticEngine.exe'
            - '\LogProcessorService.exe'
            - '\SentinelStaticEngineScanner.exe'
            - '\SentinelHelperService.exe'
            - '\SentinelBrowserNativeHost.exe'
            # Cylance
            - '\CylanceSvc.exe'
            # Cybereason
            - '\AmSvc.exe'
            - '\CrAmTray.exe'
            - '\CrsSvc.exe'
            - '\ExecutionPreventionSvc.exe'
            - '\CybereasonAV.exe'
            # Carbon Black EDR
            - '\cb.exe'
            # Carbon Black Cloud
            - '\RepMgr.exe'
            - '\RepUtils.exe'
            - '\RepUx.exe'
            - '\RepWAV.exe'
            - '\RepWSC.exe'
            # Tanium
            - '\TaniumClient.exe'
            - '\TaniumCX.exe'
            - '\TaniumDetectEngine.exe'
            # Palo Alto Networks Traps/Cortex XDR
            - '\Traps.exe'
            - '\cyserver.exe'
            - '\CyveraService.exe'
            - '\CyvrFsFlt.exe'
            # FortiEDR
            - '\fortiedr.exe'
            # Cisco Secure Endpoint (Formerly Cisco AMP)
            - '\sfc.exe'
            # ESET Inspect
            - '\EIConnector.exe'
            # Harfanglab EDR
            - '\hurukai.exe'
            # TrendMicro Apex One
            - '\CETASvc.exe'
            - '\WSCommunicator.exe'
            - '\EndpointBasecamp.exe'
            - '\TmListen.exe'
            - '\Ntrtscan.exe'
            - '\TmWSCSvc.exe'
            - '\PccNTMon.exe'
            - '\TMBMSRV.exe'
            - '\CNTAoSMgr.exe'
            - '\TmCCSF.exe'
            # Sophos EDR
            - '\sophosfilescanner.exe'
            - '\hmpalert.exe'
            - '\sophososquery.exe'
            - '\sophos ui.exe'
            - '\sophosntpservice.exe'
            - '\sophosfs.exe'
            - '\sophoshealth.exe'
            - '\sophosLivequeryservice.exe'
            - '\sspservice.exe'
            - '\sophosnetfilter.exe'
            - '\sedservice.exe'
            - '\sophosips.exe'
            - '\mcsclient.exe'
            - '\mcsagent.exe'
            # CrowdStrike Falcon
            - '\CSFalconContainer.exe'
            - '\CSFalconService.exe'
    condition: selection_5157 and 1 of selection_edr
falsepositives:
    - Unlikely
level: high
