title: KDS Root Key Access on Windows System
id: 5f0d5e5a-61d1-44cd-900d-2df14ffe4f82
status: experimental
description: |
    Detects potential retrieval of KDS Root Key information from Active Directory for the purpose of conducting a Golden dMSA attack.
    The Golden dMSA technique attempts to read the Master Root Keys by accessing the object type msKds-ProvRootKey.
references:
    - https://learn.microsoft.com/en-us/windows/win32/adschema/c-mskds-provrootkey
    - https://ipurple.team/2025/09/02/golden-dmsa/
    - https://www.semperis.com/blog/golden-dmsa-what-is-dmsa-authentication-bypass/
author: Panos Gkatziroulis, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-09-11
tags:
    - attack.credential-access
logsource:
    product: windows
    service: security
    definition: |
        Requirements: Audit Directory Service Access auditing should be enabled.
        Monitoring of KDS Root Keys requires creating a System Access Control List (SACL) for the associated object.
        Enable auditing for objects attempting to Read or Write properties for the principal group "Everyone" on msKds-ProvRootKey object types.
detection:
    selection:
        # This rule should be applied after initial baselining according your environment.
        EventID: 4662
        ObjectType: '%{aa02fd41-17e0-4f18-8687-b2239649736b}'
        AccessMask:
            - '0x100'
            - '0x10'
    condition: selection
fields:
    - SubjectUserName # Look for An account name that is not a DC
falsepositives:
    - Legitimate administrative activities
level: medium
