title: OpenCanary - SNMP CMD
id: e9856028-fd4e-46e6-b3d1-10f7ceb95078
status: experimental
description: SNMP service on an OpenCanary node has had an OID request.
author: Security Onion Solutions
license: MIT
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
tags:
    - attack.discovery
    - attack.lateral_movement
    - attack.t1016
    - attack.t1021
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 13001
    condition: selection
falsepositives:
    - none
level: critical
