title: OpenCanary - TFTP
id: b4e6b016-a2ac-4759-ad85-8000b300d61e
status: experimental
description: TFTP service on an OpenCanary node has had a request.
author: Security Onion Solutions
license: MIT
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
tags:
    - attack.exfiltration
    - attack.t1041
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 10001
    condition: selection
falsepositives:
    - none
level: critical
