title: OpenCanary - VNC
id: 9db5446c-b44a-4291-8b89-fcab5609c3b3
status: experimental
description: VNC service on an OpenCanary node has had a connection attempt.
author: Security Onion Solutions
license: MIT
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
tags:
    - attack.lateral_movement
    - attack.t1021
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 12001
    condition: selection
falsepositives:
    - none
level: critical
