title: OpenCanary - HTTP POST - Login Attempt
id: af1ac430-df6b-4b38-b976-0b52f07a0252
status: experimental
description: HTTP service on an OpenCanary node has had login attempt via Form POST.
author: Security Onion Solutions
license: MIT
references:
    - https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
    - https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: opencanary
detection:
    selection:
        logtype: 3001
    condition: selection
falsepositives:
    - none
level: critical
