title: Cowrie - Install Root Certificate
id: 9a44afc0-96b5-49d4-ae6c-12e6dc2e8c60
related:
  - id: 78a80655-a51e-4669-bc6b-e9d206a462ee
    type: similar
status: experimental
description: Detects installation of new certificate on the system which attackers may use to avoid warnings when connecting to controlled web servers or C2s
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.defense-evasion
  - attack.t1553.004
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|re: "(?i)\\b(update-ca-certificates|update-ca-trust)\\b"
  condition: selection
falsepositives:
  - Unlikely
level: low