title: Cowrie - Remove Scheduled Cron Task/Job
id: 4b9e2a1d-8f7a-4a9b-9e2b-7d4c3f1a6b9e
related:
  - id: c2e234de-03a3-41e1-b39a-1e56dc17ba67
    type: similar
status: experimental
description: |
  Detects usage of the 'crontab' utility to remove the current crontab.
  This is a common occurrence where cryptocurrency miners compete against each other by removing traces of other miners to hijack the maximum amount of resources possible
references:
  - https://www.trendmicro.com/en_us/research/22/i/how-malicious-actors-abuse-native-linux-tools-in-their-attacks.html
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.defense-evasion
  - attack.t1070.002
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "crontab"
      - "-r"
  condition: selection
falsepositives:
  - Unlikely
level: medium