title: Cowrie - Potential Netcat Reverse Shell Execution
id: 3e1d16b1-5c22-46b4-a012-0f60d96d60d7
related:
  - id: 7f734ed0-4f47-46c0-837f-6ee62505abd9
    type: similar
status: experimental
description: Detects execution of netcat with the "-e" or "-c" flag followed by common shells. This could be a sign of a potential reverse shell setup.
references:
  - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
  - https://www.revshells.com/
  - https://www.hackingtutorials.org/networking/hacking-netcat-part-2-bind-reverse-shells/
  - https://www.infosecademy.com/netcat-reverse-shells/
  - https://man7.org/linux/man-pages/man1/ncat.1.html
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|re: "(?i)\\b(nc|ncat)\\b"
  selection2:
    input|contains:
      - " -c "
      - " -e "
  selection3:
    input|contains:
      - " ash"
      - " bash"
      - " bsh"
      - " csh"
      - " ksh"
      - " pdksh"
      - " sh"
      - " tcsh"
      - "/bin/ash"
      - "/bin/bash"
      - "/bin/bsh"
      - "/bin/csh"
      - "/bin/ksh"
      - "/bin/pdksh"
      - "/bin/sh"
      - "/bin/tcsh"
      - "/bin/zsh"
      - "$IFSash"
      - "$IFSbash"
      - "$IFSbsh"
      - "$IFScsh"
      - "$IFSksh"
      - "$IFSpdksh"
      - "$IFSsh"
      - "$IFStcsh"
      - "$IFSzsh"
  condition: selection1 and selection2 and selection3
falsepositives:
  - Unlikely
level: high