title: Cowrie - File or Folder Permissions Change
id: 262eec2b-1488-4acb-a07b-e200fb6246bc
related:
  - id: 74c01ace-0152-4094-8ae2-6fd776dd43e5
    type: similar
status: experimental
description: Detects file and folder permission changes.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
author: Saravanan Palanisamy
date: 2025-08-22
modified: 2025-08-22
tags:
  - attack.defense-evasion
  - attack.t1222.002
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - "chmod"
      - "chown"
      - "chgrp"
      - "umask"
      - "setfacl"
  condition: selection
falsepositives:
  - Unlikely
level: low