title: Cowrie - Mount Execution With Hidepid Parameter
id: 8b1c0d74-91d2-4e46-84b2-2e4b4f5b77af
related:
  - id: ec52985a-d024-41e3-8ff6-14169039a0b3
    type: similar
status: experimental
description: Detects execution of the "mount" command with "hidepid" parameter to make invisible processes to other users from the system
references:
  - https://blogs.blackberry.com/
  - https://www.cyberciti.biz/faq/linux-hide-processes-from-other-users/
  - https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.credential-access
  - attack.defense-evasion
  - attack.t1564
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "mount"
      - "hidepid=2"
      - " -o "
  condition: selection
falsepositives:
  - Unlikely
level: medium