title: Cowrie - Linux Remote System Discovery
id: 663fc8e7-9f6b-44f5-b1ef-6ed5fefaba43
related:
  - id: 11063ec2-de63-4153-935e-b1a8b9e616f1
    type: similar
status: experimental
description: Detects the enumeration of other remote systems.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.discovery
  - attack.t1018
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains|all:
      - "arp"
      - "-a"
  selection2:
    input|contains:
      - "ping 10."
      - "ping 192.168."
      - "ping 172.16."
      - "ping 172.17."
      - "ping 172.18."
      - "ping 172.19."
      - "ping 172.20."
      - "ping 172.21."
      - "ping 172.22."
      - "ping 172.23."
      - "ping 172.24."
      - "ping 172.25."
      - "ping 172.26."
      - "ping 172.27."
      - "ping 172.28."
      - "ping 172.29."
      - "ping 172.30."
      - "ping 172.31."
      - "ping 127."
      - "ping 169.254."
  condition: 1 of selection*
falsepositives:
  - Unlikely
level: low