title: Cowrie - Linux Capabilities Discovery
id: 6f890b65-0406-4d71-88c2-6312cb7f210b
related:
  - id: d8d97d51-122d-4cdd-9e2f-01b4b4933530
    type: similar
status: experimental
description: Detects usage of "getcap" binary. This is often used during recon activity to determine potential binaries that can be abused as GTFOBins or other.
references:
  - https://github.com/SaiSathvik1/Linux-Privilege-Escalation-Notes
  - https://github.com/carlospolop/PEASS-ng
  - https://github.com/diego-treitos/linux-smart-enumeration
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.discovery
  - attack.t1083
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "getcap"
  selection2:
    input|contains: " -r "
  condition: all of selection*
falsepositives:
  - Unlikely
level: low