title: Cowrie - BPFtrace Unsafe Option Usage
id: 4d3f2a8b-0c51-4b4c-9c2e-6a8b5f0d9c31
related:
  - id: f8341cb2-ee25-43fa-a975-d8a5a9714b39
    type: similar
status: experimental
description: Detects the usage of the unsafe bpftrace option
references:
  - https://embracethered.com/blog/posts/2021/offensive-bpf-bpftrace/
  - https://bpftrace.org/
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.execution
  - attack.t1059.004
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "bpftrace"
      - "--unsafe"
  condition: selection
falsepositives:
  - Unlikely
level: medium