title: Cowrie - Potential Linux Process Code Injection Via DD Utility
id: 77acdc7c-0c6d-4a8f-bebf-28964a1d20f9
related:
  - id: 4cad6c64-d6df-42d6-8dae-eb78defdc415
    type: similar
status: experimental
description: Detects the injection of code by overwriting the memory map of a Linux process using the "dd" Linux command.
references:
  - https://www.aon.com/cyber-solutions/aon_cyber_labs/linux-based-inter-process-code-injection-without-ptrace2/
  - https://github.com/AonCyberLabs/Cexigua/blob/34d338620afae4c6335ba8d8d499e1d7d3d5d7b5/overwrite.sh
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.defense-evasion
  - attack.t1055.009
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "dd"
  selection2:
    input|contains|all:
      - "of="
      - "/proc/"
      - "/mem"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: medium