title: Cowrie - Chmod Suspicious Directory
id: d416def9-68c5-4e32-82e1-f111e9f422bb
related:
  - id: 6419afd1-3742-47a5-a7e6-b50386cd15f8
    type: similar
status: experimental
description: Detects chmod targeting files in abnormal directory paths.
references:
  - https://www.intezer.com/blog/malware-analysis/new-backdoor-sysjoker/
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.defense-evasion
  - attack.t1222.002
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "chmod"
  selection2:
    input|contains:
      - "/tmp/"
      - "/.Library/"
      - "/etc/"
      - "/opt/"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: medium