title: Cowrie - Suspicious Git Clone
id: 1e3c98e9-ffbb-4561-b5f3-16402ad87fd5
related:
  - id: cfec9d29-64ec-4a0f-9ffe-0fdb856d5446
    type: similar
status: experimental
description: Detects execution of "git" in order to clone a remote repository that contain suspicious keywords which might be suspicious
references:
  - https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.reconnaissance
  - attack.t1593.003
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains|all:
      - "git"
      - "clone"
  selection2:
    input|contains:
      - "exploit"
      - "Vulns"
      - "vulnerability"
      - "RCE"
      - "RemoteCodeExecution"
      - "Invoke-"
      - "CVE-"
      - "poc-"
      - "ProofOfConcept"
      - "proxyshell"
      - "log4shell"
      - "eternalblue"
      - "eternal-blue"
      - "MS17-"
  condition: all of selection*
falsepositives:
  - Unlikely
level: medium