title: Cowrie - Modifying Crontab
id: 6e3d2c7a-2f0c-4b4f-9a8d-7f4b3d0e2c91
related:
  - id: af202fd3-7bff-4212-a25a-fb34606cfcbe
    type: similar
status: experimental
description: Detects suspicious modification of crontab files.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.003/T1053.003.md
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.persistence
  - attack.t1053.003
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|re: "(?i)\\bcrontab\\b\\s+/[^\\s]+"
  condition: selection
falsepositives:
  - Unlikely
level: medium