title: Cowrie - Linux HackTool Execution
id: 44f2a4f0-b57c-4c12-b2b2-23154c398f63
related:
  - id: a015e032-146d-4717-8944-7a1884122111
    type: similar
status: experimental
description: Detects known hacktool execution based on image name.
references:
  - https://github.com/Gui774ume/ebpfkit
  - https://github.com/pathtofile/bad-bpf
  - https://github.com/carlospolop/PEASS-ng
  - https://github.com/t3l3machus/hoaxshell
  - https://github.com/t3l3machus/Villain
  - https://github.com/HavocFramework/Havoc
  - https://github.com/1N3/Sn1per
  - https://github.com/Ne0nd0g/merlin
  - https://github.com/Pennyw0rth/NetExec/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.resource-development
  - attack.t1587
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - "crackmapexec"
      - "havoc"
      - "merlin-agent"
      - "merlinServer-Linux-x64"
      - "msfconsole"
      - "msfvenom"
      - "ps-empire"
      - "sliver-client"
      - "sliver-server"
      - "Villain.py"
      - "cobaltstrike"
      - "teamserver"
      - "autorecon"
      - "httpx"
      - "legion"
      - "naabu"
      - "netdiscover"
      - "nuclei"
      - "recon-ng"
      - "sniper"
      - "dirb"
      - "dirbuster"
      - "eyewitness"
      - "feroxbuster"
      - "ffuf"
      - "gobuster"
      - "wfuzz"
      - "whatweb"
      - "joomscan"
      - "nikto"
      - "wpscan"
      - "aircrack-ng"
      - "bloodhound-python"
      - "bpfdos"
      - "ebpfki"
      - "evil-winrm"
      - "hashcat"
      - "hoaxshell.py"
      - "hydra"
      - "john"
      - "ncrack"
      - "nxc-ubuntu-latest"
      - "pidhide"
      - "pspy32"
      - "pspy32s"
      - "pspy64"
      - "pspy64s"
      - "setoolkit"
      - "sqlmap"
      - "writeblocker"
      - "linpeas"
  condition: selection
falsepositives:
  - Unlikely
level: high