title: Cowrie - Capsh Shell Invocation
id: 6f0c9a29-1c7f-4c2c-9d1c-9f6f4b2a7e83
related:
  - id: db1ac3be-f606-4e3a-89e0-9607cbe6b98a
    type: similar
status: experimental
description: |
  Detects the use of the "capsh" utility to invoke a shell.
references:
  - https://gtfobins.github.io/gtfobins/capsh/#shell
  - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "capsh"
      - " --"
  condition: selection
falsepositives:
  - Unlikely
level: high