title: Cowrie - Suspicious Curl Change User Agents
id: 4409a50b-061c-4b86-96e1-15b47b1f2a4a
related:
  - id: b86d356d-6093-443d-971c-9b07db583c68
    type: similar
status: experimental
description: Detects a suspicious curl process start with set user-agent options.
references:
  - https://curl.se/docs/manpage.html
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.command-and-control
  - attack.t1071.001
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "curl"
  selection2:
    input|contains:
      - " -A "
      - " --user-agent "
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: medium