title: Cowrie - Potentially Suspicious Execution From Tmp Folder
id: 67150f87-1783-4a72-870f-cbcb5ef00538
related:
  - id: 312b42b1-bded-4441-8b58-163a3af58775
    type: similar
status: experimental
description: Detects a potentially suspicious execution of a process located in the "/tmp/" folder.
references:
  - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
  - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
  - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
  - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.defense-evasion
  - attack.t1036
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|startswith: "/tmp/"
  condition: selection
falsepositives:
  - Unlikely
level: high