title: Cowrie - Inline Python Execution - Spawn Shell Via OS System Library
id: 3fdd7b28-20e5-4a13-b66d-5ec0048a7c65
related:
  - id: 2d2f44ff-4611-4778-a8fc-323a0e9850cc
    type: similar
status: experimental
description: |
  Detects execution of inline Python code via the "-c" in order to call the "system" function from the "os" library, and spawn a shell.
references:
  - https://gtfobins.github.io/gtfobins/python/#shell
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains|all:
      - "python"
      - " -c "
      - "os.system("
  selection2:
    input|contains:
      - "/bin/bash"
      - "/bin/dash"
      - "/bin/fish"
      - "/bin/sh"
      - "/bin/zsh"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: high