title: Cowrie - Container Residence Discovery Via Proc Virtual FS
id: 6e0e2907-c2f0-4672-8d22-f2dbff31bde2
related:
  - id: 746c86fb-ccda-4816-8997-01386263acc4
    type: similar
status: experimental
description: Detects potential container discovery via listing of certain kernel features in the "/proc" virtual filesystem.
references:
  - https://blog.skyplabs.net/posts/container-detection/
  - https://stackoverflow.com/questions/20010199/how-to-determine-if-a-process-runs-inside-lxc-docker
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.discovery
  - attack.t1082
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "awk"
      - "cat"
      - "grep"
      - "head"
      - "less"
      - "more"
      - "nl"
      - "tail"
  selection2:
    input|contains: "/proc/2/"
  selection3:
    input|contains: "/proc/"
  selection4:
    input|endswith:
      - "/cgroup"
      - "/sched"
  condition: selection1 and (selection2 or (selection3 and selection4))
falsepositives:
  - Unlikely
level: low