title: Cowrie - Linux Package Uninstall
id: 2bbcdfe9-0ff2-46c4-8ff6-6f95b9e15dc4
related:
  - id: 95d61234-7f56-465c-6f2d-b562c6fedbc4
    type: similar
status: experimental
description: Detects linux package removal using builtin tools such as "yum", "apt", "apt-get" or "dpkg".
references:
  - https://sysdig.com/blog/mitre-defense-evasion-falco
  - https://www.tutorialspoint.com/how-to-install-a-software-on-linux-using-yum-command
  - https://linuxhint.com/uninstall_yum_package/
  - https://linuxhint.com/uninstall-debian-packages/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.defense-evasion
  - attack.t1070
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "yum"
  selection2:
    input|contains:
      - "erase"
      - "remove"
  selection3:
    input|contains:
      - "apt"
      - "apt-get"
  selection4:
    input|contains:
      - "remove"
      - "purge"
  selection5:
    input|contains: "dpkg"
  selection6:
    input|contains:
      - "--remove"
      - " -r "
  selection7:
    input|contains|all:
      - "rpm"
      - " -e "
  condition: (selection1 and selection2) or (selection3 and selection4) or (selection5 and selection6) or selection7
falsepositives:
  - Unlikely
level: low