title: Cowrie - Touch Suspicious Service File
id: 6f35f90f-1f67-40c6-ae9e-7f67b8a4af88
related:
  - id: 31545105-3444-4584-bebf-c466353230d2
    type: similar
status: experimental
description: Detects usage of the "touch" process in service file.
references:
  - https://blogs.blackberry.com/
  - https://twitter.com/Joseliyo_Jstnk/status/1620131033474822144
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.defense-evasion
  - attack.t1070.006
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "touch"
  selection2:
    input|contains: " -t "
  selection3:
    input|endswith: ".service"
  condition: all of selection*
falsepositives:
  - Unlikely
level: medium