title: Cowrie - Shell Invocation Via SSH
id: 4e89cbdd-f615-4a6e-9e8f-727e2a3b08b4
related:
  - id: 8737b7f6-8df3-4bb7-b1da-06019b99b687
    type: similar
status: experimental
description: |
  Detects the use of the "ssh" utility to execute a shell. Such behavior may be associated with privilege escalation, unauthorized command execution, or to break out from restricted environments.
references:
  - https://gtfobins.github.io/gtfobins/ssh/
  - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "ssh"
  selection2:
    input|contains:
      - "ProxyCommand=;"
      - "permitlocalcommand=yes"
      - "localhost"
  selection3:
    input|contains:
      - "/bin/bash"
      - "/bin/dash"
      - "/bin/fish"
      - "/bin/sh"
      - "/bin/zsh"
      - "sh 0<&2 1>&2"
      - "sh 1>&2 0<&2"
  condition: all of selection*
falsepositives:
  - Unlikely
level: high