title: Cowrie - File Time Attribute Change
id: fa8bbd84-d8c8-4dad-ac91-8a8611e7e1ff
related:
  - id: b3cec4e7-6901-4b0d-a02d-8ab2d8eb818b
    type: similar
status: experimental
description: Detect file time attribute change to hide new or changes to existing files.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md
author: Saravanan Palanisamy
date: 2025-08-21
modified: 2025-08-21
tags:
  - attack.defense-evasion
  - attack.t1070.006
logsource:
  product: cowrie
  category: application
detection:
  selection_cmd:
    input|contains: "touch"
  selection_flags:
    input|contains:
      - "-t"
      - "-acmr"
      - "-d"
      - "-r"
  selection_cmd1:
    input|contains: "tar --mtime="
  condition: (selection_cmd and selection_flags) or selection_cmd1
falsepositives:
  - Unlikely
level: medium