title: Cowrie - Linux Capabilities Discovery
id: 4ce49807-51c7-41d3-81ea-dfd738621d9e
related:
  - id: fe10751f-1995-40a5-aaa2-c97ccb4123fe
    type: similar
status: experimental
description: Detects attempts to discover the files/processes with setuid/setgid capability on them. That would allow adversary to escalate their privileges.
references:
  - https://man7.org/linux/man-pages/man8/getcap.8.html
  - https://www.hackingarticles.in/linux-privilege-escalation-using-capabilities/
  - https://mn3m.info/posts/suid-vs-capabilities/
  - https://int0x33.medium.com/day-44-linux-capabilities-privilege-escalation-via-openssl-with-selinux-enabled-and-enforced-74d2bec02099
author: Saravanan Palanisamy
date: 2025-08-21
modified: 2025-08-21
tags:
  - attack.collection
  - attack.privilege-escalation
  - attack.t1123
  - attack.t1548
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - "getcap -r /"
      - "filecap -a"
      - "getpcaps"
      - "pscap"
  condition: selection
falsepositives:
  - Unlikely
level: low
