title: Cowrie - Potential Xterm Reverse Shell
id: f8c79228-8435-4575-a5b8-f07f10af4bfb
related:
  - id: 4e25af4b-246d-44ea-8563-e42aacab006b
    type: similar
status: experimental
description: Detects usage of "xterm" as a potential reverse shell tunnel
references:
  - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
  - https://www.revshells.com/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "xterm"
      - "-display"
      - ":1"
  condition: selection
falsepositives:
  - Unlikely
level: medium