title: Cowrie - Masquerading as Linux Crond Process
id: b7f3e6b1-0b0d-4d56-9a3f-6e8d2ce8a1c9
related:
  - id: 9d4548fa-bba0-4e88-bd66-5d5bf516cda0
    type: similar
status: experimental
description: |
  Masquerading occurs when the name or location of an executable, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation.
  Several different variations of this technique have been observed.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/8a82e9b66a5b4f4bc5b91089e9f24e0544f20ad7/atomics/T1036.003/T1036.003.md#atomic-test-2---masquerading-as-linux-crond-process
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.defense-evasion
  - attack.t1036.003
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "cp /bin/sh"
  selection2:
    input|endswith: "/crond"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: medium