title: Cowrie - Binary Padding
id: 6fc56b50-908b-41b4-adb3-98f610019ea2
status: experimental
description: |
    Adversaries may use binary padding to add junk data and change the on-disk representation of malware.
    This rule detect using dd and truncate to add a junk data to file.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
author: Saravanan Palanisamy
date: 2025-08-21
modified: 2025-08-21
tags:
  - attack.defense-evasion
  - attack.t1027.001
logsource:
  product: cowrie
  category: application
detection:
  selection_truncate:
    input|contains|all:
      - "truncate"
      - "-s"
  selection_dd:
    input|contains|all:
      - "dd"
      - "if="
  filter:
    input|contains:
      - "of="
  condition: selection_truncate or (selection_dd and not filter)
falsepositives:
  - Unlikely
level: high
