title: Cowrie - Access of Sudoers File Content
id: 1f8a78ff-81ed-4e0b-87f6-5f4b41fc58b3
related:
  - id: 0f79c4d2-4e1f-4683-9c36-b5469a665e06
    type: similar
status: experimental
description: Detects attempts to read the "/etc/sudoers" file using text-based inspection utilities.
references:
  - https://github.com/sleventyeleven/linuxprivchecker/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.reconnaissance
  - attack.t1592.004
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "cat"
      - "ed"
      - "egrep"
      - "emacs"
      - "fgrep"
      - "grep"
      - "head"
      - "less"
      - "more"
      - "nano"
      - "tail"
  selection2:
    input|contains: "/etc/sudoers"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: medium