title: Cowrie - System Network Discovery
id: f2152b8d-9ad0-4a44-8307-4fc7596ad149
related:
  - id: e7bd1cfa-b446-4c88-8afb-403bcd79e3fa
    type: similar
status: experimental
description: Detects enumeration of local network configuration in Cowrie sessions.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.discovery
  - attack.t1016
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "firewall-cmd"
      - "ufw"
      - "iptables"
      - "netstat"
      - "ifconfig"
      - "systemd-resolve"
      - "route"
  selection2:
    input|contains: "/etc/resolv.conf"
  condition: selection1 or selection2
falsepositives:
  - Unlikely
level: informational