title: Cowrie - Linux Doas Conf File Activity
id: 3b7f2a7e-a9c4-4a7f-8b78-3c1f3f6a0f2d
related:
  - id: 00eee2a5-fdb0-4746-a21d-e43fbdea5681
    type: similar
status: experimental
description: Detects the creation of doas.conf file in linux host platform.
references:
  - https://research.splunk.com/endpoint/linux_doas_conf_file_creation/
  - https://www.makeuseof.com/how-to-install-and-use-doas/
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.privilege-escalation
  - attack.t1548
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains: "/etc/doas.conf"
  condition: selection
falsepositives:
  - Unlikely
level: medium