title: Cowrie - Possible Coin Miner CPU Priority Param
id: fb4fe800-bab9-4f07-91a4-7106cf5dd7de
related:
  - id: 071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed
    type: similar
status: experimental
description: Detects command line parameter very often used with coin miners
references:
  - https://xmrig.com/docs/miner/command-line-options
author: Saravanan Palanisamy
date: 2025-08-22
modified: 2025-08-22
tags:
  - attack.privilege-escalation
  - attack.t1068
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains: '--cpu-priority'
  condition: selection
falsepositives:
  - Unlikely
level: critical