title: Cowrie - Crontab Enumeration
id: 3d9f316c-21a6-4d13-8e04-b74a8759a818
related:
  - id: 403ed92c-b7ec-4edd-9947-5b535ee12d46
    type: similar
status: experimental
description: Detects usage of crontab to list the tasks of the user
references:
  - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
  - https://jstnk9.github.io/jstnk9/research/GobRAT-Malware/
  - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
  - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.discovery
  - attack.t1007
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "crontab"
      - "-l"
  condition: selection
falsepositives:
  - Unlikely
level: low