title: Cowrie - Potential Ruby Reverse Shell
id: 6d7a9f1f-0e5f-43f2-8ff1-7e3a1b48df56
related:
  - id: b8bdac18-c06e-4016-ac30-221553e74f59
    type: similar
status: experimental
description: Detects execution of ruby with the "-e" flag and calls to "socket" related functions. This could be an indication of a potential attempt to setup a reverse shell
references:
  - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
  - https://www.revshells.com/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "ruby"
  selection2:
    input|contains|all:
      - " -e"
      - "rsocket"
      - "TCPSocket"
  selection3:
    input|contains:
      - " ash"
      - " bash"
      - " bsh"
      - " csh"
      - " ksh"
      - " pdksh"
      - " sh"
      - " tcsh"
  condition: all of selection*
falsepositives:
  - Unlikely
level: medium