title: Cowrie - Remove Immutable File Attribute
id: 7260526a-0fea-4d5c-9413-ae5ef6705ed7
status: experimental
description: Detects removing immutable file attribute. This technique was used by the threat actor Rocke during the compromise of Linux web servers.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md#atomic-test-9---chattr---remove-immutable-file-attribute
  - https://raw.githubusercontent.com/SigmaHQ/sigma/refs/heads/master/rules/linux/auditd/lnx_auditd_chattr_immutable_removal.yml
author: Saravanan Palanisamy
date: 2025-08-22
modified: 2025-08-22
tags:
  - attack.defense-evasion
  - attack.t1222.002
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains|all:
      - "chattr"
      - "-i"
  condition: selection
falsepositives:
  - Unlikely
level: medium