title: Cowrie - Linux Recon Indicators
id: 926d0165-f20d-4ec4-b358-3813d3122996
related:
  - id: 0cf7a157-8879-41a2-8f55-388dd23746b7
    type: similar
status: experimental
description: Detects suspicious reconnaissance commands executed in Cowrie sessions.
references:
  - https://github.com/sleventyeleven/linuxprivchecker
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.reconnaissance
  - attack.t1592.004
  - attack.credential-access
  - attack.t1552.001
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - " -name .htpasswd"
      - " -perm -4000 "
  condition: selection
falsepositives:
  - Unlikely
level: high