title: Cowrie - Linux Webshell Indicators
id: 657c8a27-b16b-4ef1-b2f0-5e27ec5a42a2
related:
  - id: 818f7b24-0fba-4c49-a073-8b755573b9c7
    type: similar
status: experimental
description: Detects suspicious sub processes of web server processes
references:
  - https://www.acunetix.com/blog/articles/web-shells-101-using-php-introduction-web-shells-part-2/
  - https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.persistence
  - attack.t1505.003
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "httpd"
      - "lighttpd"
      - "nginx"
      - "apache2"
      - "node"
      - "caddy"
      - "tomcat"
      - "websphere"
  selection2:
    input|contains:
      - "whoami"
      - "ifconfig"
      - "ip"
      - "uname"
      - "cat"
      - "crontab"
      - "hostname"
      - "iptables"
      - "netstat"
      - "pwd"
      - "route"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: high