title: Cowrie - Loading of Kernel Module via Insmod
id: 2db4e732-d83d-41cc-bdee-4bbdc9f419fc
related:
  - id: 106d7cbd-80ff-4985-b682-a7043e5acb72
    type: similar
status: experimental
description: |
    Detects loading of kernel modules with insmod command.
    Loadable Kernel Modules (LKMs) are pieces of code that can be loaded and unloaded into the kernel upon demand.
    Adversaries may use LKMs to obtain persistence within the system or elevate the privileges.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.006/T1547.006.md
  - https://linux.die.net/man/8/insmod
  - https://man7.org/linux/man-pages/man8/kmod.8.html
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.persistence
  - attack.privilege-escalation
  - attack.t1547.006
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - "insmod "
      - "modprobe "
  condition: selection
falsepositives:
  - Unlikely
level: high