title: Cowrie - Named Pipe Created Via Mkfifo
id: 5f7a3c9e-2a41-41e8-9c9b-4d8c2e9f6b31
related:
  - id: 9d779ce8-5256-4b13-8b6f-b91c602b43f4
    type: similar
status: experimental
description: Detects the creation of a new named pipe using the "mkfifo" utility
references:
  - https://dev.to/0xbf/use-mkfifo-to-create-named-pipe-linux-tips-5bbk
  - https://www.mandiant.com/resources/blog/barracuda-esg-exploited-globally
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.execution
  - attack.t1203
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|re: "(?i)^mkfifo(\\s|$)"
  condition: selection
falsepositives:
  - Unlikely
level: low