title: Cowrie - Docker Container Discovery Via Dockerenv Listing
id: 3e1a97f4-0058-46e0-a3cf-bfcd0460551f
related:
  - id: 11701de9-d5a5-44aa-8238-84252f131895
    type: similar
status: experimental
description: Detects listing or file reading of ".dockerenv" which can be a sign of potential container discovery.
references:
  - https://blog.skyplabs.net/posts/container-detection/
  - https://stackoverflow.com/questions/20010199/how-to-determine-if-a-process-runs-inside-lxc-docker
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.discovery
  - attack.t1082
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "cat"
      - "dir"
      - "find"
      - "ls"
      - "stat"
      - "test"
      - "grep"
  selection2:
    input|endswith: ".dockerenv"
  condition: selection1 and selection2
falsepositives:
  - Unlikely
level: low