title: Cowrie - Potential Suspicious Change To Sensitive Files
id: 26db60d2-bb3b-415f-8965-c8f84404e56f
related:
  - id: 86157017-c2b1-4d4a-8c33-93b8e67e4af4
    type: similar
status: experimental
description: Detects suspicious changes to sensitive and critical files in Cowrie sessions.
references:
  - https://learn.microsoft.com/en-us/azure/defender-for-cloud/file-integrity-monitoring-overview#which-files-should-i-monitor
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.impact
  - attack.t1565.001
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "cat"
      - "echo"
      - "grep"
      - "head"
      - "more"
      - "tail"
  selection2:
    input|contains:
      - ">"
  selection3:
    input|contains:
      - "emacs"
      - "nano"
      - "sed"
      - "vi"
      - "vim"
  selection4:
    input|contains:
      - "/bin/login"
      - "/bin/passwd"
      - "/boot/"
      - "/etc/"
      - "/opt/bin/"
      - "/sbin"
      - "/usr/bin/"
      - "/usr/local/bin/"
  condition: (selection1 and selection2 and selection4) or (selection3 and selection4)
falsepositives:
  - Unlikely
level: medium