title: Cowrie - Suspicious Package Installed
id: 1b95af64-37c1-4e63-94c6-8af5c2ed8de7
related:
  - id: 700fb7e8-2981-401c-8430-be58e189e741
    type: similar
status: experimental
description: Detects installation of suspicious packages using system installation utilities
references:
  - https://gist.githubusercontent.com/MichaelKoczwara/12faba9c061c12b5814b711166de8c2f/raw/e2068486692897b620c25fde1ea258c8218fe3d3/history.txt
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.defense-evasion
  - attack.t1553.004
logsource:
  product: cowrie
  category: application
detection:
  selection_tool_apt:
    input|contains|all:
      - "apt"
      - "install"
  selection_tool_yum:
    input|contains|all:
      - "yum"
      - "install"
  selection_tool_rpm:
    input|contains|all:
      - "rpm"
      - "-i"
  selection_tool_dpkg:
    input|contains|all:
      - "dpkg"
      - "-i"
  selection_keyword:
    input|contains:
      - "nmap"
      - " nc"
      - "netcat"
      - "wireshark"
      - "tshark"
      - "openconnect"
      - "proxychains"
  condition: 1 of selection_tool_* and selection_keyword
falsepositives:
  - Unlikely
level: medium