title: Cowrie - Sudo Privilege Escalation CVE-2019-14287
id: f07044b3-002f-4d39-aaa3-72c2d9237f90
related:
  - id: f74107df-b6c6-4e80-bf00-4170b658162b
    type: similar
status: experimental
description: Detects users trying to exploit sudo vulnerability reported in CVE-2019-14287.
references:
  - https://www.openwall.com/lists/oss-security/2019/10/14/1
  - https://access.redhat.com/security/cve/cve-2019-14287
  - https://twitter.com/matthieugarin/status/1183970598210412546
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.privilege-escalation
  - attack.t1068
  - attack.t1548.003
  - cve.2019-14287
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains: " -u#"
  condition: selection
falsepositives:
  - Unlikely
level: high