title: Cowrie - Setuid and Setgid
id: 3f0d7f14-272a-4969-8738-95cfdcd6d24d
related:
  - id: c21c4eaa-ba2e-419a-92b2-8371703cbe21
    type: similar
status: experimental
description: Detects suspicious change of file privileges with chown and chmod commands
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.001/T1548.001.md
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.persistence
  - attack.privilege-escalation
  - attack.t1548.001
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "setcap cap_setuid="
  selection2:
    input|contains:
      - "chmod u+s"
      - "chmod g+s"
  condition: 1 of selection*
falsepositives:
  - Unlikely
level: low