title: Cowrie - Print History File Contents
id: 2c227d41-b6de-44dc-a383-62e3283c6b9b
related:
  - id: d7821ff1-4527-4e33-9f84-d0d57fa2fb66
    type: similar
status: experimental
description: Detects attempts to print or read history file contents (e.g. .bash_history, .zsh_history) for reconnaissance.
references:
  - https://github.com/sleventyeleven/linuxprivchecker/
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.reconnaissance
  - attack.t1592.004
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|re: "(?i)\\bcat\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  selection2:
    input|re: "(?i)\\bhead\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  selection3:
    input|re: "(?i)\\btail\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  selection4:
    input|re: "(?i)\\bmore\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  condition: 1 of selection*
falsepositives:
  - Unlikely
level: medium