title: Cowrie - Potential Perl Reverse Shell Execution
id: a78f4a2b-b2f7-48aa-bab4-5c1f235c2c57
related:
  - id: 259df6bc-003f-4306-9f54-4ff1a08fa38e
    type: similar
status: experimental
description: Detects execution of the perl binary with the "-e" flag and common strings related to potential reverse shell activity
references:
  - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
  - https://www.revshells.com/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains|all:
      - "perl"
      - " -e "
  selection2:
    input|contains|all:
      - "fdopen("
      - "::Socket::INET"
  selection3:
    input|contains|all:
      - "Socket"
      - "connect"
      - "open"
      - "exec"
  condition: selection1 and (selection2 or selection3)
falsepositives:
  - Unlikely
level: high