title: Cowrie - Linux Doas Tool Execution
id: 887cf050-93ea-4ff6-9f95-967b1768e6e7
related:
  - id: 067d8238-7127-451c-a9ec-fa78045b618b
    type: similar
status: experimental
description: Detects the doas tool execution in linux host platform. This utility tool allow standard users to perform tasks as root, the same way sudo does.
references:
  - https://research.splunk.com/endpoint/linux_doas_tool_execution/
  - https://www.makeuseof.com/how-to-install-and-use-doas/
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.privilege-escalation
  - attack.t1548
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains: "doas"
  condition: selection
falsepositives:
  - Unlikely
level: low