title: Cowrie - Connection Proxy
id: 77c5a2b4-6f6a-4b83-9d69-b6a51a77a693
related:
  - id: 72f4ab3f-787d-495d-a55d-68c2ff46cf4c
    type: similar
status: experimental
description: Detects setting proxy configuration
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.defense-evasion
  - attack.command-and-control
  - attack.t1090
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - "http_proxy="
      - "https_proxy="
  condition: selection
falsepositives:
  - Unlikely
level: low