title: Cowrie - History File Deletion
id: 4c8a4b4d-50e2-47c1-9d16-b86ffb5c6f0f
related:
  - id: 1182f3b3-e716-4efa-99ab-d2685d04360f
    type: similar
status: experimental
description: Detects deletion of history files (e.g. .bash_history, .zsh_history) to remove traces of malicious activity.
references:
  - https://github.com/sleventyeleven/linuxprivchecker/
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.impact
  - attack.t1565.001
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|re: "(?i)\\brm\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  selection2:
    input|re: "(?i)\\bunlink\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  selection3:
    input|re: "(?i)\\bshred\\b.*(\\.bash_history|\\.zsh_history|_history|\\.history|zhistory)\\b"
  condition: 1 of selection*
falsepositives:
  - Unlikely
level: high