title: Cowrie - Suspicious Java Children Processes
id: 53ad759a-5d48-4b60-9c57-7d78c71a2c2d
related:
  - id: d292e0af-9a18-420c-9525-ec0ac3936892
    type: similar
status: experimental
description: Detects java process spawning suspicious children
references:
  - https://www.tecmint.com/different-types-of-linux-shells/
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.t1059
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "java"
  selection2:
    input|contains:
      - "/bin/sh"
      - "bash"
      - "dash"
      - "ksh"
      - "zsh"
      - "csh"
      - "fish"
      - "curl"
      - "wget"
      - "python"
  condition: all of selection*
falsepositives:
  - Unlikely
level: high