title: Creation Of An User Account
id: 472cc19f-866b-4d73-86d1-96bbbfe67b9b
status: experimental
description: Detects the creation of a new user account. Such accounts may be used for persistence that do not require persistent remote access tools to be deployed on the system.
references:
    - https://linux.die.net/man/8/useradd
author: Saravanan Palanisamy
date: 2025-08-21
modified: 2025-08-21
tags:
    - attack.t1136.001
    - attack.persistence
logsource:
    product: cowrie
    category: application
detection:
    selection:
        input|contains:
            - "adduser "
            - "useradd "
    condition: selection
falsepositives:
    - Unlikely
level: high