title: Cowrie - User Has Been Deleted via Userdel
id: 2ee5fbd7-60c7-4a37-949b-2f6f0b0b60a7
related:
  - id: 08f26069-6f80-474b-8d1f-d971c6fedea0
    type: similar
status: experimental
description: Detects execution of the "userdel" binary. Which is used to delete a user account and related files. This is sometimes abused by threat actors in order to cover their tracks
references:
  - https://linuxize.com/post/how-to-delete-group-in-linux/
  - https://www.cyberciti.biz/faq/linux-remove-user-command/
  - https://www.cybrary.it/blog/0p3n/linux-commands-used-attackers/
  - https://linux.die.net/man/8/userdel
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.impact
  - attack.t1531
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains: "userdel "
  condition: selection
falsepositives:
  - Unlikely
level: medium