title: Cowrie - Base64 Encoded Shebang In CLI
id: 1d12bc0d-d5f1-4cf5-8c18-44e6f7d63a55
related:
  - id: fe2f9663-41cb-47e2-b954-8a228f3b9dff
    type: similar
status: experimental
description: Detects the presence of a base64 version of the shebang in the commandline, which could indicate a malicious payload about to be decoded
references:
  - https://www.trendmicro.com/pl_pl/research/20/i/the-evolution-of-malicious-shell-scripts.html
  - https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.defense-evasion
  - attack.t1140
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - "IyEvYmluL2Jhc2"
      - "IyEvYmluL2Rhc2"
      - "IyEvYmluL3pza"
      - "IyEvYmluL2Zpc2"
      - "IyEvYmluL3No"
  condition: selection
falsepositives:
  - Unlikely
level: medium