title: Cowrie - Linux Network Service Scanning Tools Execution
id: 5b629d4c-cd5b-4f2d-909e-bf47d13f4229
related:
  - id: 3e102cd9-a70d-4a7a-9508-403963092f31
    type: similar
status: experimental
description: Detects execution of network scanning and reconnaissance tools in Cowrie sessions.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
  - https://github.com/projectdiscovery/naabu
  - https://github.com/Tib3rius/AutoRecon
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.discovery
  - attack.t1046
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "nc"
      - "ncat"
      - "netcat"
      - "socat"
  selection2:
    input|contains:
      - "autorecon"
      - "hping"
      - "hping2"
      - "hping3"
      - "naabu"
      - "nmap"
      - "nping"
      - "telnet"
      - "zenmap"
  filter1:
    input|contains:
      - " --listen "
      - " -l "
  condition: (selection1 and not filter1) or selection2
falsepositives:
  - Unlikely
level: low