title: Cowrie - Suspicious History File Operations
id: e0ae1eef-d4a1-4336-ab2d-f21937c9e8ab
status: experimental
description: 'Detects commandline operations on shell history files'
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
author: Saravanan Palanisamy
date: 2025-08-21
modified: 2025-08-21
tags:
  - attack.credential-access
  - attack.t1552.003
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains:
      - ".bash_history"
      - ".zsh_history"
      - ".zhistory"
      - ".history"
      - ".sh_history"
      - "fish_history"
  condition: selection
falsepositives:
  - Unlikely
level: high
