title: Cowrie - Password Policy Discovery
id: 9e0b1c3b-4b63-45d7-9a1a-4d3b9a8c1e72
related:
  - id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
    type: similar
status: experimental
description: Detects password policy discovery commands
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md
  - https://linux.die.net/man/1/chage
  - https://man7.org/linux/man-pages/man1/passwd.1.html
  - https://superuser.com/questions/150675/how-to-display-password-policy-information-for-a-user-ubuntu
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.discovery
  - attack.t1201
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains:
      - "/etc/login.defs"
      - "/etc/pam.d/auth"
      - "/etc/pam.d/common-account"
      - "/etc/pam.d/common-auth"
      - "/etc/pam.d/common-password"
      - "/etc/pam.d/system-auth"
      - "/etc/security/pwquality.conf"
  selection2:
    input|contains|all:
      - "chage"
      - "--list"
  selection3:
    input|contains|all:
      - "chage"
      - "-l"
  selection4:
    input|contains|all:
      - "passwd"
      - "-S"
  selection5:
    input|contains|all:
      - "passwd"
      - "--status"
  condition: 1 of selection*
falsepositives:
  - Unlikely
level: low