title: Cowrie - Interactive Bash Suspicious Children
id: 3de03e1e-3033-4d7e-a745-74cf77f04268
related:
  - id: ea3ecad2-db86-4a89-ad0b-132a10d2db55
    type: similar
status: experimental
description: Detects suspicious interactive bash as a parent to rather uncommon child processes
references:
  - Internal Research
author: Saravanan Palanisamy
date: 2025-08-24
modified: 2025-08-24
tags:
  - attack.execution
  - attack.defense-evasion
  - attack.t1059.004
  - attack.t1036
logsource:
  product: cowrie
  category: application
detection:
  selection1:
    input|contains: "bash -i"
  selection2:
    input|contains:
      - "-c import "
      - "base64"
      - "pty.spawn"
  selection3:
    input|contains:
      - "whoami"
      - "iptables"
      - "ncat"
      - "nc"
      - "netcat"
  condition: selection1 and (selection2 or selection3)
falsepositives:
  - Unlikely
level: medium