title: Cowrie - Group Deletion via Groupdel
id: 3f9d3c15-c066-4be7-977d-7d2edc6808d7
related:
  - id: 8a46f16c-8c4c-82d1-b121-0fdd3ba70a84
    type: similar
status: experimental
description: |
  Detects execution of the "groupdel" command, which deletes a group from the system. 
  Threat actors may use this to cover tracks.
references:
  - https://linuxize.com/post/how-to-delete-group-in-linux/
  - https://www.cyberciti.biz/faq/linux-remove-user-command/
  - https://www.cybrary.it/blog/0p3n/linux-commands-used-attackers/
  - https://linux.die.net/man/8/groupdel
author: Saravanan Palanisamy
date: 2025-08-23
modified: 2025-08-23
tags:
  - attack.impact
  - attack.t1531
logsource:
  product: cowrie
  category: application
detection:
  selection:
    input|contains: "groupdel "
  condition: selection
falsepositives:
  - Unlikely
level: medium