title: EDR Disabling With Mitigation Options Modification
id: 99366c3a-f4c5-4484-9eef-d74d9b003ace
status: experimental
description: |
    Detects the enablement of a mitigation option policy via registry modification. When active, this policy prevents any process from loading DLLs not signed by Microsoft, breaking EDR functionality that relies on vendor-signed DLL.
references:
    - https://www.orangecyberdefense.com/global/blog/cybersecurity/fairy-law
author: Chris Barros (Swiss Post Cybersecurity)
date: 2026-03-06
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|startswith: 'HKLM\SYSTEM\CurrentControlSet\Control\Session Manager\kernel\'
        TargetObject|contains:
            - 'MitigationOptions'
            - 'MitigationAuditOptions'

    filter_main:
        Details:
            - '-'
            - '(empty)'

    condition: all of selection* and not 1 of filter_*
falsepositives:
    - Legitimate custom hardening in a closed and protected environment.
    - Windows Update modifying default mitigation configurations.
level: high
regression_tests_path: regression_data/rules/windows/registry/registry_set/registry_set_edr_disabling_with_mitigation_options/info.yml
