title: PowerShell Logging Disabled
id: fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7
description: Detects the modification of the registry of the currently logged in user to disable PowerShell module logging, script block logging or transcription and script execution logging
author: frack113
date: 2022/04/02
status: experimental
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: 
            - SOFTWARE\Policies\Microsoft\Windows\PowerShell\ModuleLogging\EnableModuleLogging
            - SOFTWARE\Policies\Microsoft\Windows\PowerShell\ScriptBlockLogging\EnableScriptBlockLogging
            - SOFTWARE\Policies\Microsoft\Windows\PowerShell\Transcription\EnableTranscripting
            - SOFTWARE\Policies\Microsoft\Windows\PowerShell\EnableScripts
        Details: 'DWORD (0x00000000)'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
  - attack.defense_evasion
  - attack.t1564.001
