title: Disabled AV On Dev Drive via Registry
id: 31e124fb-5dc4-42a0-83b3-44a69c77b271
description: Detects the execution registry change that enables a Dev Drive without allowing AV to access the created drive. This technique is available starting with Windows 11.
status: experimental
date: 2023/11/05
author: \@kostastsale
references:
    - https://twitter.com/0gtweet/status/1720419490519752955
logsource:
    category: registry_set
    product: windows
detection:
    selection1:
        TargetObject|contains: 
          - '\SYSTEM\CurrentControlSet\'
        TargetObject|endswith:
          - 'FltmgrDevDriveAllowAntivirusFilter'
        Details|endswith: '0'
    condition: selection1
falsepositives:
    - Unlikely
level: high
tags:
    - attack.defense.evasion
    - attack.T1562.001
