title: Hypervisor Enforced Code Integrity Disabled
id: 1821ea92-e34c-4cad-8e12-07091a75c6c4
related:
    - id: 6225c53a-a96e-4235-b28f-8d7997cd96eb
      type: similar
status: experimental
description: |
    Detects the disabling of Hypervisor-protected Code Integrity (HVCI) via registry modification.
    HVCI helps protect the kernel and system processes from tampering by malicious code.
    Disabling HVCI could allow attackers to execute unsigned kernel-mode code, potentially leading to kernel-level rootkits or EDR bypass techniques.
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/device-guard/enable-virtualization-based-protection-of-code-integrity
    - https://www.sophos.com/en-us/blog/sharpening-the-knife-gold-blades-strategic-evolution
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-22
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: '\SYSTEM\CurrentControlSet'
        TargetObject|endswith: '\Control\DeviceGuard\Scenarios\HypervisorEnforcedCodeIntegrity\Enabled'
        Details: 'DWORD (0x00000000)'
    condition: selection
falsepositives:
    - Unknown
level: high
