title: Service Binary in Temp Folder
id: c0abc838-36b0-47c9-b3b3-a90c39455382
description: Detect the creation of a service with a service binary located in a temporary directory 
status: experimental
date: 2022/05/01
author: frack113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
logsource:
    category: registry_set
    product: windows
detection:
    selection_1:
        EventType: SetValue
        TargetObject|startswith: 'HKLM\System\CurrentControlSet\Services\'
        TargetObject|endswith: '\Start'
        Image|contains: '\Temp\'
        Details: 
            - 'DWORD (0x00000000)'  # boot
            - 'DWORD (0x00000001)'  # System
            - 'DWORD (0x00000002)'  # Automatic
            # 3 - Manual , 4 - Disabled
    selection_2:
        EventType: SetValue
        TargetObject|startswith: 'HKLM\System\CurrentControlSet\Services\'
        TargetObject|endswith: '\ImagePath'
        Details|contains: '\Temp\'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1112 
