title: Potential Persistence Via Custom Protocol Handler
id: fdbf0b9d-0182-4c43-893b-a1eaab92d085
status: experimental
description: Detects potential persistence activity via the registering of a new custom protocole handlers. While legitimate applications register protocole handlers often times during installation. And attacker can abuse this by setting a custom handler to be used as a persistence mechanism.
references:
    - https://ladydebug.com/blog/2019/06/21/custom-protocol-handler-cph/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/30
modified: 2023/01/10
tags:
    - attack.defense_evasion
    - attack.t1112
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|startswith: 'HKCR\'
        Details|startswith: 'URL:'
    filter_ms_trusted:
        Details|startswith: 'URL:ms-' # Microsoft Protocols usualy start with "ms-"
    filter_generic_locations:
        Image|startswith: # Add more folders to avoid FP
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)'
            - 'C:\Windows\'
    #filter_specific:
    # Uncomment This section to add specific Protocol Handler names that are know
    #    Details: 'URL:'
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate applications registering a new custom protocol handler
level: medium
