title: PowerShell as a Service in Registry
id: 4a5f5a5e-ac01-474b-9b4e-d61298c9df1d
description: Detects that a powershell code is written to the registry as a service.
status: experimental
author: oscd.community, Natalia Shornikova
date: 2020/10/06
modified: 2022/03/26
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: '\Services\'
        TargetObject|endswith: '\ImagePath'
        Details|contains:
            - 'powershell'
            - 'pwsh'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.execution
    - attack.t1569.002