title: Persistence Via Mpnotify
id: 92772523-d9c1-4c93-9547-b0ca500baba3
description: Detects when an attacker register a new SIP provider for persistence and defense evasion
author: Nasreddine Bencherchali
date: 2022/07/21
status: experimental
references:
    - https://persistence-info.github.io/Data/mpnotify.html
    - https://www.youtube.com/watch?v=ggY3srD9dYs&ab_channel=GrzegorzTworek
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\mpnotify'
    condition: selection
falsepositives:
    - Might trigger if a legitimate new SIP provider is registered. But this is not a common occurrence in an environment and should be investigated either way
level: high
tags:
    - attack.persistence

