title: Disable UAC Using Registry
id: 48437c39-9e5f-47fb-af95-3d663c3f2919
status: experimental
description: Detects when an attacker tries to disable User Account Control (UAC) by changing registry key
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/7e11e9b79583545f208a6dc3fa062f2ed443d999/atomics/T1548.002/T1548.002.md
author: frack113
date: 2022/01/05
modified: 2024/05/05
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
logsource:
    category: registry_set
    product: windows
detection:
    selection_zerro:
        TargetObject|contains:
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA'
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\PromptOnSecureDesktop'
        Details: DWORD (0x00000000)
    selection_one:
        TargetObject|contains: 'SOFTWARE\Microsoft\Security Center\UACDisableNotify'
        Details: DWORD (0x00000001)
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: medium
