title: IE Change Domain Zone
id: 45e112d0-7759-4c2a-aa36-9f8fb79d3393
description: Hides the file extension through modification of the registry
author: frack113
date: 2022/01/22
modified: 2022/04/04
status: experimental
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
    - https://docs.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
logsource:
    category: registry_set
    product: windows
detection:
    selection_domains:
        EventType: SetValue
        TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains\
    filter:
        Details:
            - DWORD (0x00000000) # My Computer
            - DWORD (0x00000001) # Local Intranet Zone
            - '(Empty)'
    condition: selection_domains and not filter
falsepositives:
    - Administrative scripts
level: medium
tags:
    - attack.persistence
    - attack.t1137
