title: Scheduled TaskCache Change by Uncommon Program
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled task is registered by a process that is not svchost.exe, which is suspicious
status: experimental
date: 2021/06/18
modified: 2022/05/23
references:
  - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
  - https://labs.f-secure.com/blog/scheduled-task-tampering/
author: Syed Hasan (@syedhasan009)
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    EventType: SetValue
    TargetObject|contains: 'SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\'
  filter:
    TargetObject|contains:
      - 'Microsoft\Windows\UpdateOrchestrator'
      - 'Microsoft\Windows\SoftwareProtectionPlatform\SvcRestartTask\Index'
      - 'Microsoft\Windows\Flighting\OneSettings\RefreshCache\Index'
  filter_tiworker:
    Image|startswith: 'C:\Windows\'
    Image|endswith: '\TiWorker.exe'
    TargetObject|contains: '\MICROSOFT\WINDOWS NT\CURRENTVERSION\SCHEDULE\TASKCACHE\PLAIN\{1A552422-F571-4376-A7F1-5941E63D7B40}'
  filter_svchost:
    Image: 'C:\WINDOWS\system32\svchost.exe'
  condition: selection and not 1 of filter*
falsepositives:
  - Unknown
level: high
tags:
  - attack.persistence
  - attack.t1053
  - attack.t1053.005