title: Block Loading Drivers via HVCIDisallowedImages
id: ec0083ce-d843-48c0-9ef1-1a7e41bedf8e
status: experimental
description: Detects Registry Modification to Block Loading Drivers via HVCIDisallowedImages
references:
    - https://x.com/yarden_shafir/status/1822667605175324787
author: Omar Khaled (@beacon_exe)
date: 2024/08/12
tags:
    - attack.defense_evasion
    - attack.t1112
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|endswith: '\SYSTEM\CurrentControlSet\Control\CI\HvciDisallowedImages'
    condition: selection
falsepositives:
    - Unknown
level: high
