title: Potential WFP Filters to Block Security Tools
id: 1f1d8209-636e-4c6c-a137-781cca8b82f9
status: experimental
description: Detects when an attacker registers a new Add WFP filters to block Security tools
references:
    - Internal Research
    - https://github.com/netero1010/EDRSilencer/blob/0e73a7037ec65c52894d8208e6f605a7da0a34a6/EDRSilencer.c
author: Frack113
date: 2024-12-07
tags:
    - attack.defense-evasion
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: '\System\CurrentControlSet\Services\BFE\Parameters\Policy\Persistent\Filter\'
    condition: selection
falsepositives:
    - Unknown
level: medium
