title: Modification of IE Registry Settings
id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
description: Detects the modification of the registry settings used for Internet Explorer and other Windows components that use these settings
author: frack113
date: 2022/01/22
modified: 2022/03/29
status: experimental
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
logsource:
    category: registry_set
    product: windows
detection:
    selection_domains:
        EventType: SetValue
        TargetObject|contains: '\Software\Microsoft\Windows\CurrentVersion\Internet Settings'
    filter_dword:
        Details|startswith: 'DWORD'
    filter_office:
        Details:
            - 'Cookie:'
            - 'Visited:'
            - '(Empty)'
    filter_path:
        TargetObject|contains:
            - '\Cache'
            - '\ZoneMap'
            - '\WpadDecision'
    filter_binary:
        Details: 'Binary Data'
    condition: selection_domains and not 1 of filter_*
falsepositives:
    - Unknown
level: low # as unknow false positives
tags:
    - attack.defense_evasion
    - attack.t1112
