title: COM Hijacking For Persistence With Suspicious Locations
id: 3d968d17-ffa4-4bc0-bfdc-f139de76ce77
status: experimental
description: Detects potential COM object hijacking where the "Server" (In/Out) is pointing to a supsicious or unsuale location
references:
    - https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/ (idea)
author: Nasreddine Bencherchali
date: 2022/07/28
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|startswith:
            - 'HKCR\CLSID\'
            - 'HKEY_CLASSES_ROOT\CLSID\'
            - 'HKCU\Software\Classes\CLSID\'
            - 'HKEY_CURRENT_USER\Software\Classes\CLSID\'
        TargetObject|endswith:
            - '\InprocServer32\(Default)'
            - '\LocalServer32\(Default)'
        Details|contains: # Add more suspicious paths and locations
            - '\Users\Public\'
            - '\Desktop\'
            - '\AppData\Local\Temp\'
            - '\Downloads\'
            - '\Windows\Temp\'
            - '\Microsoft\Windows\Start Menu\Programs\Startup\'
            - '\System32\spool\drivers\color\' # as seen in the knotweed blog
            - '%temp%'
            - '%appdata%'
    condition: selection
falsepositives:
    - Probable legitimate applications. If you find these please add them to an exclusion list
level: high
tags:
    - attack.persistence
    - attack.t1546.015
