title: Hide User Account Via Special Accounts Reg Key
id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
description: Detects when an attacker set the registry key "HKLM\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" to "0" in order to hide user account.
author: Nasreddine Bencherchali
date: 2022/07/12
status: experimental
references:
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList
        Details: DWORD (0x00000000)
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
  - attack.defense_evasion
  - attack.t1564.002
