title: CHM Helper DLL Persistence
id: 976dd1f2-a484-45ec-aa1d-0e87e882262b
description: Detects when an attacker modifies the registry key "HtmlHelp Author" to achieve persistence
author: Nasreddine Bencherchali
date: 2022/07/21
status: experimental
references:
    - https://persistence-info.github.io/Data/htmlhelpauthor.html
    - https://www.hexacorn.com/blog/2018/04/22/beyond-good-ol-run-key-part-76/
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|contains:
            - '\Software\Microsoft\HtmlHelp Author\Location'
            - '\Software\WOW6432Node\Microsoft\HtmlHelp Author\Location'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
  - attack.persistence
