title: PowerShell Logging Disabled Via Registry Key Tampering
id: fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7
status: experimental
description: Detects changes to the registry for the currently logged-in user. In order to disable PowerShell module logging, script block logging or transcription and script execution logging
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled
author: frack113
date: 2022/04/02
modified: 2023/01/10
tags:
    - attack.defense_evasion
    - attack.t1564.001
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|endswith:
            # PowerShell
            - '\Microsoft\Windows\PowerShell\ModuleLogging\EnableModuleLogging'
            - '\Microsoft\Windows\PowerShell\ScriptBlockLogging\EnableScriptBlockLogging'
            - '\Microsoft\Windows\PowerShell\Transcription\EnableTranscripting'
            - '\Microsoft\Windows\PowerShell\EnableScripts'
            # PowerShell 7
            - '\Microsoft\PowerShellCore\ModuleLogging\EnableModuleLogging'
            - '\Microsoft\PowerShellCore\ScriptBlockLogging\EnableScriptBlockLogging'
            - '\Microsoft\PowerShellCore\Transcription\EnableTranscripting'
            - '\Microsoft\PowerShellCore\EnableScripts'
        Details: 'DWORD (0x00000000)'
    condition: selection
falsepositives:
    - Unknown
level: high
