title: Potential Persistence Via Outlook Home Page
id: ddd171b5-2cc6-4975-9e78-f0eccd08cc76
status: test
description: Detects potential persistence activity via outlook home pages.
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
    - https://support.microsoft.com/en-us/topic/outlook-home-page-feature-is-missing-in-folder-properties-d207edb7-aa02-46c5-b608-5d9dbed9bd04?ui=en-us&rs=en-us&ad=us
author: Tobias Michalski (Nextron Systems)
date: 2021/06/09
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.t1112
logsource:
    product: windows
    category: registry_set
detection:
    selection_1:
        TargetObject|contains:
            - '\Software\Microsoft\Office\'
            - '\Outlook\WebView\'
        TargetObject|endswith: '\URL'
    selection_2:
        TargetObject|contains:
            - '\Calendar\'
            - '\Inbox\'
    condition: all of selection_*
fields:
    - Details
falsepositives:
    - Unknown
level: high
