title: Register New IFiltre For Persistence
id: b23818c7-e575-4d13-8012-332075ec0a2b
description: Detects when an attacker register a new IFilter for an exntesion. Microsoft Windows Search uses filters to extract the content of items for inclusion in a full-text index. You can extend Windows Search to index new or proprietary file types by writing filters to extract the content, and property handlers to extract the properties of files
author: Nasreddine Bencherchali
date: 2022/07/21
status: experimental
references:
    - https://persistence-info.github.io/Data/ifilters.html
    - https://twitter.com/0gtweet/status/1468548924600459267
    - https://github.com/gtworek/PSBits/tree/master/IFilter
    - https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/IFilter/Dll.cpp#L281-L308
logsource:
    category: registry_set
    product: windows
detection:
    selection_ext:
        EventType: SetValue
        TargetObject|startswith:
            - 'HKLM\SOFTWARE\Classes\.'
            - 'HKEY_LOCAL_MACHINE\SOFTWARE\Classes\.'
        TargetObject|contains: '\PersistentHandler'
    selection_clsid:
        EventType: SetValue
        TargetObject|startswith:
            - 'HKLM\SOFTWARE\Classes\CLSID'
            - 'HKEY_LOCAL_MACHINE\SOFTWARE\Classes\CLSID'
        TargetObject|contains: '\PersistentAddinsRegistered\{89BCB740-6119-101A-BCB7-00DD010655AF}'
    condition: 1 of selection_*
falsepositives:
    - Legitimate registration of IFilters by the OS or software
level: medium
tags:
  - attack.persistence
