title: Lolbas Provlaunch.exe indirect command execution - REG
id: f7d31a1c-3902-4a6e-bccd-9a5f85e4b3ee
related:
    - id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
      type: derived
status: experimental
description: Detects potential "provisioning" registry value abuse for indirect command execution through Provlaunch.exe.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Swachchhanda Shrawan Poudel
date: 2023/08/02
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: registry_set
    product: windows
    definition: 'Requirements: Sysmon config that monitors \SOFTWARE\Microsoft\Provisioning\Commands\ subkey of the HKLM hives'
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: '\SOFTWARE\Microsoft\Provisioning\Commands\'
    condition: selection
fields:
    - TargetObject
    - Details
falsepositives:
    - Unlikely
level: high
