title: CrashControl CrashDump Disabled
id: 2ff692c2-4594-41ec-8fcb-46587de769e0
status: experimental
description: Detects disabling the CrashDump per registry (as used by HermeticWiper)
author: Tobias Michalski
date: 2022/02/24
modified: 2022/08/23
references:
    - https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/
logsource:
    product: windows
    category: registry_set
detection:
    selection:
        EventType: SetValue
        TargetObject|contains: 'SYSTEM\CurrentControlSet\Control\CrashControl'
        Details: 'DWORD (0x00000000)'
    condition: selection
falsepositives:
    - Legitimate disabling of crashdumps
level: medium
tags:
    - attack.t1564
    - attack.t1112