title: Disable Winevt Event Logging Via Registry
id: 2f78da12-f7c7-430b-8b19-a28f269b77a3
status: experimental
description: Detects tampering with the "Enabled" registry key in order to disable windows logging of a windows event channel
references:
    - https://twitter.com/WhichbufferArda/status/1543900539280293889
    - https://github.com/DebugPrivilege/CPP/blob/c39d365617dbfbcb01fffad200d52b6239b2918c/Windows%20Defender/RestoreDefenderConfig.cpp
author: frack113, Nasreddine Bencherchali
date: 2022/07/04
modified: 2022/10/11
tags:
    - attack.defense_evasion
    - attack.t1562.002
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|startswith: 'HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\WINEVT\Channels\'
        TargetObject|endswith: '\Enabled'
        Details: 'DWORD (0x00000000)'
    filter_wevutil:
        Image|endswith: '\Windows\system32\wevtutil.exe' #FP generated during installation of manifests via wevtutil
    filter_iis:
        Image|startswith: 'C:\Windows\winsxs\'
        Image|endswith: '\TiWorker.exe'  # many different TargetObjects
    filter_svchost:
        Image: 'C:\Windows\System32\svchost.exe'
        TargetObject|contains:
            - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-FileInfoMinifilter'
            - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-ASN1\'
            - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Kernel-AppCompat\'
            - '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Runtime\Error\'
    filter_trusted_installer:
        Image: C:\Windows\servicing\TrustedInstaller.exe
        TargetObject|contains: '\Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Compat-Appraiser'
    filter_empty: # This filter is related to aurora. Should be removed when fix is deployed. # TODO: Remove later
        Image:
            - ''
            - null
    condition: selection and not 1 of filter*
falsepositives:
    - Legitimate administrators disabling specific event log for troubleshooting
level: high
