title: Tamper Windows Event Log Access
id: ba226dcf-d390-4642-b9af-b534872f1156
status: experimental
description: Detects modification in windows event log channel, it changes the Security Descriptor Definition Language (SDDL) string, these modifications can restrict access to specific users or groups, potentially aiding in defense evasion by controlling who can view or modify a event log channel, upon execution, the user shouldn't be able to access the event log channel via the event viewer or via utilities such as "Get-EventLog" or "wevtutil".
references:
    - https://www.atomicredteam.io/atomic-red-team/atomics/T1562.002#atomic-test-8---modify-event-log-channel-access-permissions-via-registry---powershell
    - https://www.youtube.com/watch?v=uSYvHUVU8xY
author: X__Junior
date: 2025-01-16
tags:
    - attack.t1547.001
logsource:
    category: registry_set
    product: windows
detection:
    # O:SYG:SYD:(D;;0x1;;;WD)
    # O:BAG:SYD:(A;;0x2;;;S-1-15-2-1)(D;;0x1;;;WD)
    selection_key_1:
        TargetObject|contains: '\SYSTEM\CurrentControlSet\Services\EventLog\System'
        TargetObject|endswith: 'CustomSD'
    selection_key_2:
        TargetObject|contains: '\Policies\Microsoft\Windows\EventLog\Setup'
        TargetObject|endswith: 'ChannelAccess'
    selection_key_3:
        TargetObject|contains: '\Microsoft\Windows\CurrentVersion\WINEVT\Channels'
        TargetObject|endswith: 'ChannelAccess'
    selection_details:
        - Details|contains: 'D:(D;'
        - Details|contains|all:
                - 'D:('
                - ')(D;'
    condition: 1 of selection_key_* and selection_details
falsepositives:
    - Administrative activity, still unlikely
level: high
