title: UAC Bypass via Sdclt
id: 5b872a46-3b90-45c1-8419-f675db8053aa
status: experimental
description: Detects the pattern of UAC Bypass using registry key manipulation of sdclt.exe (e.g. UACMe 53)
references:
    - https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
    - https://github.com/hfiref0x/UACME
author: Omer Yampel, Christian Burkard
date: 2017/03/17
modified: 2022/06/26
logsource:
    category: registry_set
    product: windows
detection:
    selection1:
        EventType: SetValue 
        TargetObject|endswith: 'Software\Classes\exefile\shell\runas\command\isolatedCommand'
    selection2:
        EventType: SetValue 
        TargetObject|endswith: 'Software\Classes\Folder\shell\open\command\SymbolicLinkValue'
        Details|contains: '-1???\Software\Classes\'
    condition: 1 of selection*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1548.002
    - car.2019-04-001