title: New File Association Using Exefile
id: 44a22d59-b175-4f13-8c16-cbaef5b581ff
status: experimental
description: Detects the abuse of the exefile handler in new file association. Used for bypass of security products.
references:
    - https://twitter.com/mrd0x/status/1461041276514623491
author: Andreas Hunkeler (@Karneades)
date: 2021/11/19
modified: 2022/03/26
tags:
    - attack.defense_evasion
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: 'Classes\.'
        Details: 'exefile'
        EventType: SetValue
    condition: selection
falsepositives:
    - Unknown
level: high
