title: Modification of Netsh Registry Key
id: 56321594-9087-49d9-bf10-524fe8479454
related:
    - id: 56321594-9087-49d9-bf10-524fe8479452
status: experimental
description: Detects the registry modification of netsh after the execution of netsh “add helper” command to load a DLL file.
references:
    - https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
    - https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
author: Anish Bogati
date: 2023/11/07
modified: 2023/11/07
tags:
    - attack.persistence
    - attack.t1546.007
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        TargetObject|contains: '\SOFTWARE\Microsoft\NetSh'
        Details|contains: '.dll'
    condition: selection
falsepositives:
    - Unknown
level: high