title: Disable Windows Security Center Notifications
id: 3ae1a046-f7db-439d-b7ce-b8b366b81fa6
description: Detect set UseActionCenterExperience to 0 to disable the windows security center notification
author: frack113
date: 2022/08/19
status: experimental
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-36---disable-windows-security-center-notifications
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|endswith: Windows\CurrentVersion\ImmersiveShell\UseActionCenterExperience
        Details: DWORD (0x00000000)
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
  - attack.defense_evasion
  - attack.t1112 
