title: AutoLogger Sessions Tamper
id: f37b4bce-49d0-4087-9f5b-58bffda77316
status: experimental
description: Detects tampering of autologger trace sessions which is a technique used by attackers to disable logging
author: Nasreddine Bencherchali
references:
    - https://twitter.com/MichalKoczwara/status/1553634816016498688
date: 2022/08/01
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        EventType: SetValue
        TargetObject|startswith:
            - 'HKEY_LOCAL_MACHINE\System\CurrentControlSet\Control\WMI\Autologger\'
            - 'HKLM\System\CurrentControlSet\Control\WMI\Autologger\'
        TargetObject|contains: # We only care about some autologger to avoid FP. Add more if you need
            - '\EventLog-'
            - '\Defender'
        TargetObject|endswith:
            - '\Enabled'
            - '\Start'
        Details: DWORD (0x00000000)
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
