title: EDR Disabling through Image File Execution Options
id: 7c217021-17ef-4208-9f88-3c4cc3d049fb
status: experimental
description: Detects the creation of a new key under `HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Image File Execution Options` with a MitigationOptions value on a specific EDR process. This prevents the targeted process from loading non-Microsoft-signed DLLs, breaking EDR functionality that relies on vendor-signed DLL.
references:
    - https://www.orangecyberdefense.com/global/blog/cybersecurity/fairy-law
author: Chris Barros Henriques (Swiss Post Cybersecurity)
date: 2026-03-06
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: registry_set
    product: windows
detection:
    selection_registry_modification:
      TargetObject|startswith:
        - 'hklm\software\microsoft\windows nt\currentversion\image file execution options'
      TargetObject|contains:
        - 'mitigationoptions'
        - 'mitigationauditoptions'

    selection_edr_executable:
      registry.path|contains:
        - 'sentinelagent.exe'
        - 'sentinelagentworker.exe'
        - 'sentinelcleaner.exe'
        - 'sentinelctl.exe'
        - 'sentinelhelperservice.exe'
        - 'sentinelmemoryscanner.exe'
        - 'sentinelremediation.exe'
        - 'sentinelservicehost.exe'
        - 'sentinelstaticengine.exe'
        - 'sentinelstaticenginescanner.exe'
        - 'sentinelui.exe'
        # https://thrive.trellix.com/s/article/KB87791?language=en_US&page=content&id=KB87791&locale=nl_NL&viewlocale=nl_NL
        - 'mfetp.exe'
        - 'mfeatp.exe'
        - 'mfeesp.exe'
        - 'macomserver.exe'
        - 'mfemms.exe'
        - 'mfefire.exe'
        - 'mfehcs.exe'
        - 'mcshield.exe'
        - 'mfevtps.exe'
        - 'mfewc.exe'
        # https://support.sophos.com/support/s/article/KBA-000001467?language=en_US
        - 'hmpalert.exe'
        - 'sedservice.exe'
        - 'sedtelemetry.exe'
        - 'sldservice.exe'
        - 'sntpservice.exe'
        - 'sophos ui.exe'
        - 'sophosmainui.exe'
        - 'sophosamsitelemetrycollector.exe'
        - 'sophoscleanup.exe'
        - 'sophosesh.exe'
        - 'sophoseshtelemetry.exe'
        - 'sophosfilescanner.exe'
        - 'sophosfs.exe'
        - 'sophos.exe'
        - 'sophososquery.exe'
        - 'sspservice.exe'
        # https://www.bitdefender.com/business/support/en/77209-157497-install-security-agents---standard-procedure.html#id335747
        - 'bdredline.exe'
        - 'epconsole.exe'
        - 'epintegrationservice.exe'
        - 'epprotectedservice.exe'
        - 'epsecurityservice.exe'
        - 'epupdateservice.exe'
        - 'epupdateserver.exe'

    filter_main:
      - registry.value:
          - '-'
          - '(empty)'

    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Legitimate updates from the AV/EDR itself
level: high
regression_tests_path: regression_data/rules/windows/registry/registry_set/registry_set_edr_disabling_with_ifeo/info.yml
