title: Antivirus Hacktool Detection
id: fa0c05b6-8ad3-468d-8231-c1cbccb64fba
status: test
description: Detects a highly relevant Antivirus alert that reports a hack tool or other attack tool
references:
    - https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/
    - https://www.nextron-systems.com/?s=antivirus
author: Florian Roth, Arnim Rupp
date: 2021/08/16
modified: 2023/01/13
tags:
    - attack.execution
    - attack.t1204
logsource:
    category: antivirus
detection:
    selection:
        - Signature|startswith:
            - 'HTOOL'
            - 'HKTL'
            - 'SecurityTool'
        - Signature|contains: 
            - 'Hacktool'
            - 'ATK/'  # Sophos
    condition: selection
fields:
    - FileName
    - User
falsepositives:
    - Pentests or Red Teaming
    - Users using cracking license generators which are flagged by some AV vendors as hacktools
level: high
