title: Invoke-Obfuscation STDIN+ Launcher
id: de7fb680-6efa-4bf3-af2c-14b6d33c8e6e
related:
    - id: 72862bf2-0eb1-11eb-adc1-0242ac120002
      type: derived
description: Detects Obfuscated use of stdin to execute PowerShell
status: unsupported
author: Jonathan Cheong, oscd.community
date: 2020/10/15
modified: 2021/09/17
references:
     - https://github.com/SigmaHQ/sigma/issues/1009 #(Task 25)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImagePath|re: '.*cmd.{0,5}(?:\/c|\/r).+powershell.+(?:\$\{?input\}?|noexit).+\"'
    condition: selection 
falsepositives:
    - Unknown
level: high