title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION
id: 7b9a650e-6788-4fdf-888d-ec7c0a62810d
related:
    - id: 14bcba49-a428-42d9-b943-e2ce0f0f7ae6
      type: derived
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
status: unsupported
author: Timur Zinniatullin, oscd.community
date: 2020/10/13
modified: 2021/09/18
references:
    - https://github.com/SigmaHQ/sigma/issues/1009 #(Task27)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: driver_load
detection:
    selection:
        ImagePath|re: '(?i).*&&set.*(\{\d\}){2,}\\\"\s+?\-f.*&&.*cmd.*\/c' # FPs with |\/r
    condition: selection
falsepositives:
    - Unknown
level: high