title: Long Duration Connections
id: a5bcf38c-5165-4fcd-8f9f-64bad97d57b3
description: Detects connections that have long durations
status: experimental
author: Michael Wade @savvyspoon
date: 2020/09/01
logsource:
    product: Palo Alto Networks
detection:
    selection: 
        query: '*'
    condition: selection | duration > 1d
falsepositives:
    - Legitimate Services
    - Long running file transfers
level: high
