title: LibSSH Error Message CVE-2023-2283
id: 8b244735-5833-4517-a45b-28d8c63924c0
status: experimental
description: Detects potential exploitation attempt of CVE-2023-2283 in libSSH which causes an error message stating that keys for curve25519 couldn't be generated. It is an error message that is a sign of an exploitation attempt. It's not a sign of a successful exploitation.
references:
    - https://twitter.com/kevin_backhouse/status/1666459308941357056?s=20
    - https://nvd.nist.gov/vuln/detail/CVE-2023-2283
    - https://www.blumira.com/cve-2023-2283/
author: Florian Roth (Nextron Systems)
date: 2023/06/09
tags:
    - attack.t1190
logsource:
    product: linux
    service: sshd
detection:
    keywords:
        - 'Failed to generate curve25519 keys'
    condition: keywords
falsepositives:
    - Other unknown conditions that could lead to the generation of this error message
level: high
