title: Server Side Template Injection Strings
id: ada3bc4f-f0fd-42b9-ba91-e105e8af7342
status: experimental
description: Detects SSTI attempts sent via GET requests in access logs
author: Nasreddine Bencherchali
date: 2022/06/14
references:
    - https://book.hacktricks.xyz/pentesting-web/ssti-server-side-template-injection
    - https://github.com/payloadbox/ssti-payloads
logsource:
    category: webserver
detection:
    keywords:
        - '={{'
        - '=%7B%7B'
        - '=${'
        - '=$%7B'
        - '=<%='
        - '=%3C%25='
        - '=@('
        - 'freemarker.template.utility.Execute'
        - ".getClass().forName('javax.script.ScriptEngineManager')"
        - 'T(org.apache.commons.io.IOUtils)'
    condition: keywords
falsepositives:
    - User searches in search boxes of the respective website
level: high
