title: Log4j RCE CVE-2021-44228 in Fields
id: 9be472ed-893c-4ec0-94da-312d2765f654
status: experimental
description: Detects exploitation attempt against log4j RCE vulnerability reported as CVE-2021-44228 in different header fields found in web server logs (Log4Shell)
author: Florian Roth
date: 2021/12/10
modified: 2021/12/12
references:
   - https://www.lunasec.io/docs/blog/log4j-zero-day/
   - https://news.ycombinator.com/item?id=29504755
   - https://github.com/tangxiaofeng7/apache-log4j-poc
   - https://gist.github.com/Neo23x0/e4c8b03ff8cdf1fa63b7d15db6e3860b
   - https://github.com/YfryTchsGD/Log4jAttackSurface
   - https://twitter.com/shutingrz/status/1469255861394866177?s=21
tags:
   - attack.initial_access
   - attack.t1190
logsource:
   category: webserver
detection:
   selection:
      cs-User-Agent|contains:
         - '${jndi:ldap:/'
         - '${jndi:rmi:/'
         - '${jndi:ldaps:/'
         - '${jndi:dns:/'
         - '/$%7bjndi:'
         - '%24%7bjndi:'
         - '$%7Bjndi:'
         - '%2524%257Bjndi'
         - '%2F%252524%25257Bjndi%3A'
         - '${jndi:${lower:'
         - '${::-j}${'
         - '${jndi:nis'
         - '${jndi:nds'
         - '${jndi:corba'
         - '${jndi:iiop'
         - '${${env:BARFOO:-j}'
         - '${::-l}${::-d}${::-a}${::-p}'
         - '${base64:JHtqbmRp'
         - '${${env:ENV_NAME:-j}ndi${env:ENV_NAME:-:}${env:ENV_NAME:-l}dap${env:ENV_NAME:-:}//'
         - '${${lower:j}ndi:${lower:l}${lower:d}a${lower:p}://'
         - '${${upper:j}ndi:${upper:l}${upper:d}a${lower:p}://'
         - '${${::-j}${::-n}${::-d}${::-i}:'
      user-agent|contains:
         - '${jndi:ldap:/'
         - '${jndi:rmi:/'
         - '${jndi:ldaps:/'
         - '${jndi:dns:/'
         - '/$%7bjndi:'
         - '%24%7bjndi:'
         - '$%7Bjndi:'
         - '%2524%257Bjndi'
         - '%2F%252524%25257Bjndi%3A'
         - '${jndi:${lower:'
         - '${::-j}${'
         - '${jndi:nis'
         - '${jndi:nds'
         - '${jndi:corba'
         - '${jndi:iiop'
         - '${${env:BARFOO:-j}'
         - '${::-l}${::-d}${::-a}${::-p}'
         - '${base64:JHtqbmRp'
         - '${${env:ENV_NAME:-j}ndi${env:ENV_NAME:-:}${env:ENV_NAME:-l}dap${env:ENV_NAME:-:}//'
         - '${${lower:j}ndi:${lower:l}${lower:d}a${lower:p}://'
         - '${${upper:j}ndi:${upper:l}${upper:d}a${lower:p}://'
         - '${${::-j}${::-n}${::-d}${::-i}:'
      cs-uri|contains:
         - '${jndi:ldap:/'
         - '${jndi:rmi:/'
         - '${jndi:ldaps:/'
         - '${jndi:dns:/'
         - '/$%7bjndi:'
         - '%24%7bjndi:'
         - '$%7Bjndi:'
         - '%2524%257Bjndi'
         - '%2F%252524%25257Bjndi%3A'
         - '${jndi:${lower:'
         - '${::-j}${'
         - '${jndi:nis'
         - '${jndi:nds'
         - '${jndi:corba'
         - '${jndi:iiop'
         - '${${env:BARFOO:-j}'
         - '${::-l}${::-d}${::-a}${::-p}'
         - '${base64:JHtqbmRp'
         - '${${env:ENV_NAME:-j}ndi${env:ENV_NAME:-:}${env:ENV_NAME:-l}dap${env:ENV_NAME:-:}//'
         - '${${lower:j}ndi:${lower:l}${lower:d}a${lower:p}://'
         - '${${upper:j}ndi:${upper:l}${upper:d}a${lower:p}://'
         - '${${::-j}${::-n}${::-d}${::-i}:'
      cs-referrer|contains:
         - '${jndi:ldap:/'
         - '${jndi:rmi:/'
         - '${jndi:ldaps:/'
         - '${jndi:dns:/'
         - '/$%7bjndi:'
         - '%24%7bjndi:'
         - '$%7Bjndi:'
         - '%2524%257Bjndi'
         - '%2F%252524%25257Bjndi%3A'
         - '${jndi:${lower:'
         - '${::-j}${'
         - '${jndi:nis'
         - '${jndi:nds'
         - '${jndi:corba'
         - '${jndi:iiop'
         - '${${env:BARFOO:-j}'
         - '${::-l}${::-d}${::-a}${::-p}'
         - '${base64:JHtqbmRp'
         - '${${env:ENV_NAME:-j}ndi${env:ENV_NAME:-:}${env:ENV_NAME:-l}dap${env:ENV_NAME:-:}//'
         - '${${lower:j}ndi:${lower:l}${lower:d}a${lower:p}://'
         - '${${upper:j}ndi:${upper:l}${upper:d}a${lower:p}://'
         - '${${::-j}${::-n}${::-d}${::-i}:'
   condition: selection
falsepositives:
    - Vulnerability scanning
level: high
