title: Apache Segmentation Fault
id: 1da8ce0b-855d-4004-8860-7d64d42063b1
status: test
description: Detects a segmentation fault error message caused by a creashing apache worker process
author: Florian Roth
references:
  - http://www.securityfocus.com/infocus/1633
date: 2017/02/28
modified: 2021/11/27
logsource:
  service: apache
detection:
  keywords:
    - 'exit signal Segmentation Fault'
  condition: keywords
falsepositives:
  - Unknown
level: high
tags:
  - attack.impact
  - attack.t1499.004
