title: Rejetto HTTP File Server RCE
id: a133193c-2daa-4a29-8022-018695fcf0ae
status: experimental
description: Detects attempts to exploit a Rejetto HTTP File Server (HFS) via CVE-2014-6287
author: Nasreddine Bencherchali
date: 2022/07/19
references:
    - https://vk9-sec.com/hfs-code-execution-cve-2014-6287/
    - https://www.exploit-db.com/exploits/39161
    - https://github.com/Twigonometry/Cybersecurity-Notes/blob/c875b0f52df7d2c7a870e75e1f0c2679d417931d/Writeups/Hack%20the%20Box/Boxes/Optimum/10%20-%20Website.md
logsource:
    category: webserver
detection:
    selection_search:
        c-uri|contains: '?search=%00{.'
    selection_payload:
        c-uri|contains:
            - 'save|' # Indication of saving a file which shouldn't be tested by vuln scanners
            - 'powershell'
            - 'cmd.exe'
            - 'cmd /c'
            - 'cscript'
            - 'wscript'
            - 'python'
            - 'C:\Users\Public\'
            - '%comspec%'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.initial_access
    - attack.t1190
    - attack.t1505.003
    - cve.2014.6287
