title: Detects ADSelfService exploitation
id: 6702b13c-e421-44cc-ab33-42cc25570f11
status: experimental
description: Detects various logs that occur on explatiation of ADSelfService cve_2021_40539
author: Tobias Michalski, Max Altgelt
references:
    - https://us-cert.cisa.gov/ncas/alerts/aa21-259a
date: 2021/09/20
logsource:
    category: logfile
detection:
    keywords:
        - '/help/admin-guide/Reports/ReportGenerate.jsp'
        - '/ServletApi/../RestApi/LogonCustomization'
        - '/ServletApi/../RestAPI/Connection'
        - 'Keystore will be created for "admin"'
        - 'The status of keystore creation is Upload!'
    condition: keywords
falsepositives:
    - Unknown, Maybe initial installation of ADSelfService
level: low
