title: Apache Segmentation Fault
id: 1da8ce0b-855d-4004-8860-7d64d42063b1
description: Detects a segmentation fault error message caused by a creashing apache worker process
author: Florian Roth
date: 2017/02/28
modified: 2020/09/03
references:
    - http://www.securityfocus.com/infocus/1633
logsource:
    product: apache
detection:
    keywords:
        - 'exit signal Segmentation Fault'
    condition: keywords
falsepositives:
    - Unknown
level: high
tags:
    - attack.impact
    - attack.t1499 # an old one
    - attack.t1499.004