title: Apache Segmentation Fault
description: Detects a segmentation fault error message caused by a creashing apacke worker process 
author: Florian Roth
references:
    - http://www.securityfocus.com/infocus/1633
logsource:
    product: apache
detection:
    keywords:
        - 'exit signal Segmentation Fault'
    condition: keywords
falsepositives:
    - Unknown
level: high

