title: Apache Spark Shell Command Injection - Weblogs
id: 1a9a04fd-02d1-465c-abad-d733fd409f9c
status: experimental
description: Detects attempts to exploit an apache spark server via CVE-2014-6287 from a weblogs perspective
author: Nasreddine Bencherchali
date: 2022/07/19
references:
    - https://github.com/W01fh4cker/cve-2022-33891/blob/fd973b56e78bca8822caa3a2e3cf1b5aff5d0950/cve_2022_33891_poc.py
    - https://sumsec.me/2022/CVE-2022-33891%20Apache%20Spark%20shell%20command%20injection.html
    - https://github.com/apache/spark/pull/36315/files
logsource:
    category: webserver
detection:
    selection:
        c-uri|contains: '?doAs=`'
    condition: selection
falsepositives:
    - Web vulnerability scanners
level: high
tags:
    - attack.initial_access
    - attack.t1190
    - cve.2022.33891
