title: AWS RDS Master Password Change
id: 8a63cdd4-6207-414a-85bc-7e032bd3c1a2
status: experimental
author: faloker
date: 2020/02/12
description: Detects the change of database master password. It may be a part of data exfiltration.
references:
    - https://github.com/RhinoSecurityLabs/pacu/blob/master/modules/rds__explore_snapshots/main.py#L10
logsource:
    service: cloudtrail
detection:
    selection_source:
        - eventSource: rds.amazonaws.com
    selection_modified_values:
        - responseElements.pendingModifiedValues.masterUserPassword: "*"
    selection_eventname:
        - eventName: ModifyDBInstance
    condition: all of them
level: medium
falsepositives:
    - Benign changes to a db instance
tags:
    - attack.t1020
