title: RDP Originating From Domain Controller
id: fda34293-718e-4b36-b018-38caab0d1209
status: experimental
description: Detects a RDP connection originating from a domain controller
author: Josh Nickels
date: 2024/04/30
references:
    - internal research
logsource:
    product: windows
    category: network_connection
detection:
    selection_initiated:
        Initiated: 'True'
    selection_port:
        DestinationPort: 3389
    selection_hosts:
        Computer|expand: '%domain_controller_hostnames%'
    filter_app:
        Image: "Microsoft.Tri.Sensor.exe" ## Microsoft Defender for Identity service makes port 3389 connections to hosts
    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Legitimate administration activity
level: high
tags:
    - attack.lateral_movement
    - attack.t1021
