title: Rename Common File to DLL File
id: bbfd974c-248e-4435-8de6-1e938c79c5c1
status: experimental
description: Detects cases in which a file gets renamed to .dll, which often happens to bypass perimeter protection
references:
    - https://twitter.com/ffforward/status/1481672378639912960
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1036/T1036.md#atomic-test-1---system-file-copied-to-unusual-location
author: frack113
date: 2022/02/19
modified: 2023/01/02
logsource:
    product: windows
    category: file_rename
    definition: Use the WinEventLog:Microsoft-Windows-Kernel-File/KERNEL_FILE_KEYWORD_RENAME_SETLINK_PATH ETW source
detection:
    to_dll:
        TargetFilename|endswith: '.dll'
    filter_from_dll:
        - SourceFilename|endswith:
            - '.dll'
            - '.tmp'  # VSCode FP
        - SourceFilename|contains:
            - '.dll.'
            - '\SquirrelTemp\temp'
    filter_empty_source:
        SourceFilename: ''
    filter_non_existing_source:
        SourceFilename: null
    filter_tiworker:
        Image|startswith: 'C:\Windows\WinSxS\'
        Image|endswith: '\TiWorker.exe'
    filter_upgrade:
        - Image: 'C:\Windows\System32\wuauclt.exe'
        - TargetFilename|startswith: 'C:\$WINDOWS.~BT\Sources\'
    filter_program_files:
        Image|startswith:
            - 'C:\Program Files (x86)\'
            - 'C:\Program Files\'
    condition: to_dll and not 1 of filter*
falsepositives:
    - Application installation
level: medium
