title: AWS DeleteFlowLogs Command Monitoring
id: e386b9b5-af12-450e-afff-761730fb8a98
status: experimental
description: This search is important for security monitoring and auditing, as VPC and EC2 flow logs provide important information about traffic passing through network interfaces in your VPC and EC2 instances. Deleting these logs may indicate an attempt to hide unauthorized activity or a violation of security policy.
references:
    - https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DeleteFlowLogs.html
    - https://docs.aws.amazon.com/vpc/latest/userguide/working-with-flow-logs.html
author: Ivan Saakov
date: 2024-09-21
tags:
    - attack.defense-evasion
    - attack.t1070.002
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: DeleteFlowLogs
    condition: selection
falsepositives:
    - Legitimate use of the DeleteFlowLogs command by authorized administrators
level: medium
