title: AWS Console GetSigninToken Abuse
id: f8103686-e3e8-46f3-be72-65f7fcb4aa53
status: test
description: |
    Detects suspicious events involving GetSigninToken. This console API can be leveraged by an adversary to create temporary federated credential that help obfuscate which AWS credential is compromised (the original access key) and enables the adversary to pivot from the AWS CLI to console sessions without the need for MFA using the new access key issued in this request. An adversary using the aws_consoler tool will natively use GetSigninToken to leverage this functionality.
references:
    - https://github.com/NetSPI/aws_consoler
    - https://www.crowdstrike.com/blog/analysis-of-intrusion-campaign-targeting-telecom-and-bpo-companies/
author: Chester Le Bron (@123Le_Bron)
date: 2024/02/21
tags:
    - attack.lateral_movement
    - attack.t1021
    - attack.t1021.007
    - attack.t1550
    - attack.t1550.001
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: signin.amazonaws.com
        eventName: GetSigninToken
    filter:
      console_user_agents|contains: 'Jersey/${project.version}'
    condition: selection and not filter
falsepositives:
    - GetSigninToken events will occur when using AWS SSO portal to login and will generate false positives if you do not filter for the expected user agent(s), see filter. Non-SSO configured roles would be abnormal and should be investigated.
level: medium