title: AWS Bedrock PutUseCaseForModelAccess From Long Lived Access Key
id: 4f6e07b6-b3e4-48c7-a63f-8d5badee2de9
status: experimental
description: |
    Detects the usage of PutUseCaseForModelAccess.
    This API puts the use case for requesting model access on Amazon Bedrock.
    This is an API meant to be used only via the AWS Web Management Console.
    Long lived access keys should not be seen interacting with this API.
references:
    - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_PutUseCaseForModelAccess.html
    - https://permiso.io/blog/exploiting-hosted-models
author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-03-13
tags:
    - attack.defense_evasion
    - attack.t1578.005
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'PutUseCaseForModelAccess'
        userIdentity.accessKeyId|startswith: 'AKIA'
        eventSource: 'bedrock.amazonaws.com'
    condition: selection
falsepositives:
    - Unknown
level: medium
