title: CloudTrail detection of System Manager malicious usage
id: 38e7f511-3f74-41d4-836e-f57dfa18eead
status: experimental
description: |
    Detect when System Manager successfully executes commands against an instance
references:
    - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/initial_access_via_system_manager.toml
author: jamesc-grafana
date: 2024/03/28
modified: 2024/03/28
tags:
    - attack.privilege_escalation
    - attack.t1566
    - attack.t1566.002
logsource:
    category: cloud
    service: AWS
detection:
    selection:
        eventName: "SendCommand"
        eventSource: "ssm.amazonaws.com"
        responseElements.command.status: Success
    condition: selection
falsepositives:
    - There are legitimate uses of SSM to send commands to EC2 instances
    - Legitimate users may have to use SSM to perform actions against machines in the Cloud to update or maintain them
level: high
