title: AWS Bedrock CreateFoundationModelAgreement From Long Lived Access Key
id: 86e77d21-dbd2-4a43-84f6-517739b7f44f
status: experimental
description: |
    Detects the usage of CreateFoundationModelAgreement from a long lived access key.
    This API creates a foundation model agreement on Amazon Bedrock, which is a step in enabling model access.
    This is an API meant to be used only via the AWS Web Management Console.
    Long lived access keys should not be seen interacting with this API.
references:
    - https://permiso.io/blog/exploiting-hosted-models
author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-03-13
tags:
    - attack.defense_evasion
    - attack.t1578.005
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'CreateFoundationModelAgreement'
        userIdentity.accessKeyId|startswith: 'AKIA'
        eventSource: 'bedrock.amazonaws.com'
    condition: selection
falsepositives:
    - Unknown
level: medium
