title: Uncommon AWS Bedrock API Calls From Long Lived Access Keys
id: 7c98f381-fe34-47fe-bec3-4a255ab28870
status: experimental
description: |
    Detects the usage of uncommon AWS Bedrock APIs from long lived access keys.
    These are APIs meant to be used only via the AWS Web Management Console.
    Long lived access keys should not be seen interacting with this API.
references:
    - https://permiso.io/blog/exploiting-hosted-models
    - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_CreateFoundationModelAgreement.html
    - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_GetFoundationModelAvailability.html
    - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_GetUseCaseForModelAccess.html
    - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_PutUseCaseForModelAccess.html
author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-04-28
tags:
    - attack.defense-impairment
    - attack.t1578.005
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName:
            - 'CreateFoundationModelAgreement'
            - 'GetFoundationModelAvailability'
            - 'GetUseCaseForModelAccess'
            - 'PutFoundationModelEntitlement'
            - 'PutUseCaseForModelAccess'
        userIdentity.accessKeyId|startswith: 'AKIA'
        eventSource: 'bedrock.amazonaws.com'
    condition: selection
falsepositives:
    - Unknown
level: medium
