title: AWS Console Login Monitoring
id: 313e72de-0c0d-4d65-8c95-87f4d546eceb
status: experimental
description: Detects successful AWS console logins and filters out legitimate countries and IP addresses. This alert helps identify potential unauthorized access attempts by monitoring successful console logins and excluding known legitimate locations.
references:
    - https://docs.aws.amazon.com/awscloudtrail/latest/userguide/cloudtrail-event-reference-aws-console-sign-in-events.html
author: Ivan Saakov
date: 2024-09-21
tags:
    - attack.privilege-escalation
    - attack.t1078.004
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: ConsoleLogin
        status: success
    filter_country:
        src_country|expand: '%Legitimate_Countries%' # Add legitimate countries here
    filter_ip:
        src_ip|expand: '%Legitimate_IP_Ranges%' # Add legitimate src_ip ranges here
    condition: selection and not filter_country and not filter_ip
falsepositives:
    - Legitimate logins from trusted countries and IP addresses
level: medium
