title: AWS Successful Console Login Without MFA
id: c134e006-5aef-49dd-9386-62675a251585
status: experimental
description: |
    Detects successful AWS console logins that were performed without Multi-Factor Authentication (MFA).
    This alert can be used to identify potential unauthorized access attempts, as logging in without MFA can indicate compromised credentials or misconfigured security settings.
references:
    - https://docs.aws.amazon.com/awscloudtrail/latest/userguide/cloudtrail-event-reference-aws-console-sign-in-events.html
    - https://docs.aws.amazon.com/IAM/latest/UserGuide/id_credentials_mfa_lost-or-broken.html
author: Ivan Saakov
date: 2025-10-19
tags:
    - attack.defense-evasion
    - attack.t1078
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'ConsoleLogin'
        responseElements.ConsoleLogin: 'Success'
        additionalEventData.MFAUsed: 'No'
    condition: selection
falsepositives:
    - It is possible when the first login to the account may be without an MFA. It is required to inform the user about the need to configure the MFA.
level: medium
