title: AWS DeleteBucket Command Monitoring
id: 39c9f26d-6e3b-4dbb-9c7a-4154b0281112
status: experimental
description: This search is important for security monitoring and auditing, as deleting an S3 bucket can result in the loss of critical data. Monitoring this event helps identify potential unauthorized attempts to delete important data or a violation of security policy.
references:
    - https://docs.aws.amazon.com/AmazonS3/latest/API/API_DeleteBucket.html
author: Ivan Saakov
date: 2024-09-21
tags:
    - attack.defense-evasion
    - attack.t1070.004
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: DeleteBucket
        status: success
    condition: selection
falsepositives:
    - Legitimate use of the DeleteBucket command by authorized administrators
level: medium
