title: AWS Bedrock GetUseCaseForModelAccess From Long Lived Access Key
id: 4f6e07b6-b3e4-48c7-a63f-8d5badee2de9
status: experimental
description: |
    Detects the usage of GetUseCaseForModelAccess. This API returns
    the use case submitted for requesting model access on Amazon Bedrock.
    This is an API meant to be used only via the AWS Web Management Console.
    Long lived access keys should not be seen interacting with this API.
references:
    - https://docs.aws.amazon.com/bedrock/latest/APIReference/API_GetUseCaseForModelAccess.html
    - https://permiso.io/blog/exploiting-hosted-models
author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-03-13
tags:
    - attack.discovery
    - attack.t1580
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventName: 'GetUseCaseForModelAccess'
        userIdentity.accessKeyId|startswith: 'AKIA'
        eventSource: 'bedrock.amazonaws.com'
    condition: selection
falsepositives:
    - Unknown
level: medium
