title: AWS GuardDuty Detector Deleted Or Updated
id: d2656e78-c069-4571-8220-9e0ab5913f19
status: experimental
description: Detects successful deletion or disabling of an AWS GuardDuty detector, possibly by an attacker trying to avoid detection of its malicious activities or could be part of a legitimate security test. Upon deletion, GuardDuty stops monitoring the environment and all existing findings are lost. Verify with the user identity that this activity is legitimate.
references:
  - https://docs.aws.amazon.com/guardduty/latest/APIReference/API_DeleteDetector.html
  - https://docs.aws.amazon.com/guardduty/latest/APIReference/API_UpdateDetector.html
  - https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_suspend-disable.html
  - https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/aws-general-policies/ensure-aws-guardduty-detector-is-enabled
  - https://docs.stellarcyber.ai/5.2.x/Using/ML/Alert-Rule-Based-Potentially_Malicious_AWS_Activity.html
  - https://github.com/Azure/Azure-Sentinel/blob/master/Solutions/Amazon%20Web%20Services/Analytic%20Rules/AWS_GuardDutyDisabled.yaml
  - https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/defense_evasion_guardduty_detector_deletion.toml
  - https://help.fortinet.com/fsiem/Public_Resource_Access/7_4_0/rules/PH_RULE_AWS_GuardDuty_Detector_Deletion.htm
  - https://research.splunk.com/sources/5d8bd475-c8bc-4447-b27f-efa508728b90/
  - https://suktech24.com/2025/07/17/aws-threat-detection-rule-guardduty-detector-disabled-or-suspended/
  - https://www.atomicredteam.io/atomic-red-team/atomics/T156001#atomic-test-46---aws---guardduty-suspension-or-deletion
author: suktech24
date: 2025-07-20
modified: 2025-07-20
tags:
  - attack.defense-evasion
  - attack.t1562.001
  - attack.t1562.008
logsource:
  product: aws
  service: cloudtrail
  category: management
detection:
  selection_delete:
    eventSource: "guardduty.amazonaws.com"
    eventName: "DeleteDetector"
    errorCode: null
  selection_update:
    eventSource: "guardduty.amazonaws.com"
    eventName: "UpdateDetector"
    errorCode: null
    requestParameters.enable: "false"
  condition: selection_delete or selection_update
fields:
  - eventTime
  - userIdentity.type
  - userIdentity.arn
  - userIdentity.accountId
  - sourceIPAddress
  - awsRegion
  - requestParameters.detectorId
  - userAgent
falsepositives:
  - Legitimate detector deletion by an admin (e.g., during account decommissioning).
  - Temporary disablement for troubleshooting (verify via change management tickets).
  - Automated deployment tools (e.g., Terraform) managing GuardDuty state.
  - Security testing (e.g., Atomic Red Team T1562.001).
level: high
