title: Potential Suspicious Browser Native Messaging Host
    File Creation on macOS
id: 77000f35-d6e1-4b4f-ae7e-17c9ac6d7f7f
status: experimental
description: |
    Detects the creation of native messaging host manifest files
    in browser-specific directories on macOS. Native messaging
    allows browser extensions to communicate with local binaries
    via stdin/stdout, which can be abused to execute arbitrary
    commands and escape the browser sandbox.
references:
    - https://developer.chrome.com/docs/extensions/develop/concepts/native-messaging
    - https://learn.microsoft.com/en-us/microsoft-edge/extensions-chromium/developer-guide/native-messaging
    - https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/Native_manifests
    - https://github.com/praetorian-inc/ChromeAlone
author: PersonalRules
date: 2026-04-23
tags:
    - attack.persistence
    - attack.t1176.001
    - attack.execution
logsource:
    product: macos
    category: file_event
detection:
    selection_chrome:
        TargetFilename|contains: '/Library/Application Support/Google/Chrome/NativeMessagingHosts/'
    selection_edge:
        TargetFilename|contains: '/Library/Application Support/Microsoft Edge/NativeMessagingHosts/'
    selection_firefox:
        TargetFilename|contains: '/Library/Application Support/Mozilla/NativeMessagingHosts/'
    condition: 1 of selection_*
falsepositives:
    - Legitimate browser extensions installing native messaging
      hosts (password managers, screen readers, etc.)
    - Enterprise MDM tools deploying browser extensions
    - Browser updates that register new native messaging hosts
level: medium
