title: List RBAC Permissions
id: 84b777bd-c946-4d17-aa2e-c39f5a454325
status: experimental
author: Leo Tsaousis (@laripping)
date: 2024-01-25
description: |
    Detects identities attempting to enumerate their Kubernetes RBAC permissions.

    In the early stages of a breach, attackers will aim to list the permissions they have within the compromised environment. In a Kubernetes cluster, this can be achieved by interacting with the API server, and querying the SelfSubjectAccessReview API via e.g. a "kubectl auth can-i --list" command. This will enumerate the Role-Based Access Controls (RBAC) rules defining the compromised user's authorization.
logsource:
    product: kubernetes
    service: audit_logs
detection:
    selection:
        verb: create
        apiGroup: authorization.k8s.io
        resource: selfsubjectrulesreviews    
    condition: selection
level: low
tags:
- attack.T1069.003
- attack.T1087.004
references: 
    - https://www.elastic.co/guide/en/security/current/kubernetes-suspicious-self-subject-review.html
falsepositives:
    - Unknown
