title: HandleKatz Duplicating LSASS Handle
id: b1bd3a59-c1fd-4860-9f40-4dd161a7d1f5
description: Detects HandleKatz opening LSASS to duplicate its handle to later dump the memory without opening any new handles
references:
    - https://github.com/codewhitesec/HandleKatz
status: experimental
author: Bhabesh Raj (rule), @thefLinkk
date: 2022/06/27
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: '\lsass.exe' # Theoretically, can be any benign process holding handle to LSASS
        GrantedAccess: '0x1440' # Only PROCESS_DUP_HANDLE, PROCESS_QUERY_LIMITED_INFORMATION, PROCESS_QUERY_INFORMATION
        CallTrace|contains: '|UNKNOWN('
    filter:
        CallTrace|contains:
          - '\KERNEL32.DLL+'
          - '\KERNELBASE.DLL+'
          - '\WOW64.DLL+'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
tags:
    - attack.execution
    - attack.t1106
    - attack.defense_evasion
    - attack.t1003.001
