title: Mimikatz through Windows Remote Management
id: aa35a627-33fb-4d04-a165-d33b4afca3e8
status: stable
description: Detects usage of mimikatz through WinRM protocol by monitoring access to lsass process by wsmprovhost.exe.
references:
    - https://pentestlab.blog/2018/05/15/lateral-movement-winrm/
author: Patryk Prauze - ING Tech
date: 2019/05/20
modified: 2021/06/21
tags:
    - attack.credential_access
    - attack.execution
    - attack.t1003.001
    - attack.t1059.001
    - attack.lateral_movement
    - attack.t1021.006
    - attack.s0002
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: '\lsass.exe'
        SourceImage: 'C:\Windows\system32\wsmprovhost.exe'
    filter:
        GrantedAccess: '0x80000000'
    condition: selection and not filter
falsepositives:
    - Unlikely
level: high
