title: Direct Syscall of NtOpenProcess
id: 3f3f3506-1895-401b-9cc3-e86b16e630d0
status: experimental
description: Detects the usage of the direct syscall of NtOpenProcess which might be done from a CobaltStrike BOF.
references:
    - https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6
author: Christian Burkard (Nextron Systems), Tim Shelton
date: 2021/07/28
modified: 2023/10/11
tags:
    - attack.execution
    - attack.t1106
logsource:
    category: process_access
    product: windows
detection:
    selection:
        CallTrace|startswith: 'UNKNOWN'
    filter_main_1:
        TargetImage|endswith: ':\Program Files\Cylance\Desktop\CylanceUI.exe'
        SourceImage|endswith: ':\Windows\Explorer.EXE'
    filter_main_2:
        TargetImage|endswith: ':\Program Files (x86)\Microsoft\EdgeUpdate\MicrosoftEdgeUpdate.exe'
        SourceImage|contains: ':\Program Files (x86)\Microsoft\Temp\'
        SourceImage|endswith: '\MicrosoftEdgeUpdate.exe'
    filter_main_3:
        TargetImage|endswith: 'vcredist_x64.exe'
        SourceImage|endswith: 'vcredist_x64.exe'
    filter_main_4:
        TargetImage|endswith: ':\Windows\system32\systeminfo.exe'
        SourceImage|endswith: 'setup64.exe' #vmware
    filter_main_5:
        TargetImage|endswith: 'AmazonSSMAgentSetup.exe'
        SourceImage|endswith: 'AmazonSSMAgentSetup.exe'
    filter_main_6:
        TargetImage|endswith: ':\Program Files\Mozilla Firefox\firefox.exe'
        SourceImage|endswith:
            - ':\Program Files\Mozilla Firefox\firefox.exe'
            - ':\Program Files\Mozilla Firefox\plugin-container.exe'
    filter_main_7: # VsCode
        TargetImage|endswith: '\AppData\Local\Programs\Microsoft VS Code\Code.exe'
        SourceImage|endswith: '\AppData\Local\Programs\Microsoft VS Code\Code.exe'
    filter_main_8: # Google Chrome
        TargetImage|endswith: ':\Program Files\Google\Chrome\Application\chrome.exe'
        SourceImage|endswith: ':\Program Files\Google\Chrome\Application\chrome.exe'
    filter_main_9: # Google Chrome Update
        TargetImage|endswith: ':\Program Files (x86)\Google\Update\GoogleUpdate.exe'
        SourceImage|endswith: ':\Program Files (x86)\Google\Update\GoogleUpdate.exe'
    filter_main_10: # MS Teams
        TargetImage|endswith: '\AppData\Local\Microsoft\Teams\current\Teams.exe'
        SourceImage|endswith: '\AppData\Local\Microsoft\Teams\current\Teams.exe'
    filter_main_11:
        TargetImage: 'C:\Windows\System32\backgroundTaskHost.exe'
        SourceImage: 'C:\Windows\System32\backgroundTaskHost.exe'
    filter_main_12:
        TargetImage: 'C:\Program Files (x86)\CCleaner Browser\Application\CCleanerBrowser.exe'
        SourceImage: 'C:\Program Files (x86)\CCleaner Browser\Application\CCleanerBrowser.exe'
    filter_main_13: # Discord
        TargetImage|startswith: 'C:\Users\'
        TargetImage|contains: '\AppData\Local\Discord\'
        TargetImage|endswith: '\Discord.exe'
    filter_main_14:
        TargetImage: 'C:\WINDOWS\system32\AUDIODG.EXE'
    filter_main_15:
        SourceImage|startswith: 'C:\Users\'
        SourceImage|contains: '\AppData\Local\yammerdesktop\app-'
        SourceImage|endswith: '\Yammer.exe'
        TargetImage|startswith: 'C:\Users\'
        TargetImage|contains: '\AppData\Local\yammerdesktop\app-'
        TargetImage|endswith: '\Yammer.exe'
        GrantedAccess: '0x1000'
    filter_main_kerneltrace_edge:
        # Cases in which the CallTrace is just e.g. 'UNKNOWN(19290435374)' from Microsoft-Windows-Kernel-Audit-API-Calls provider
        Provider_Name: 'Microsoft-Windows-Kernel-Audit-API-Calls'
    filter_main_mixed:
        TargetImage|endswith: '\Evernote\Evernote.exe'
    filter_main_defender:
        SourceImage: 'C:\Program Files\Microsoft Security Client\MsMpEng.exe'
        TargetImage: C:\Windows\system32\svchost.exe
        GrantedAccess: '0x1000'
    condition: selection and not 1 of filter_main_*
filter_main_:
    - Unknown
level: high
