title: Potential Calc Injection
id: a24e5861-c6ca-4fde-a93c-ba9256feddf0
status: experimental
description: Detects potential Calc.exe injection
references:
    - https://learn.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
author: frack113
date: 2024/05/23
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1055.011
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: ':\WINDOWS\SYSTEM32\calc.exe'
        GrantedAccess: '0x1FFFFF' # All possible access rights for a process object.
    condition: selection
falsepositives:
    - Unknown
level: low
