title: LSASS Access from White-Listed Processes
id: 4be8b654-0c01-4c9d-a10c-6b28467fc651
status: experimental
description: Detects a possible process memory dump that uses the white-listed filename like TrolleyExpress.exe as a way to dump the lsass process memory without Microsoft Defender interference
author: Florian Roth
references:
  - https://twitter.com/_xpn_/status/1491557187168178176
  - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
  - https://twitter.com/mrd0x/status/1460597833917251595
date: 2022/02/10
tags:
    - attack.credential_access
    - attack.t1003.001
    - attack.s0002
logsource:
    category: process_access
    product: windows
detection:
    selection:
        TargetImage|endswith: '\lsass.exe'
        SourceImage|endswith: 
            - '\TrolleyExpress.exe'  # Citrix 
            - '\ProcessDump.exe'     # 
            - '\dump64.exe'          # Visual Studio
    condition: selection
falsepositives:
    - Unlikely, since these tools shouldn't access lsass.exe at all
level: high