title: LittleCorporal Generated Maldoc Injection
id: 7bdde3bf-2a42-4c39-aa31-a92b3e17afac
description: Detects the process injection of a LittleCorporal generated Maldoc.
references:
    - https://github.com/connormcgarr/LittleCorporal
status: experimental
author: Christian Burkard
date: 2021/08/09
logsource:
    category: process_access
    product: windows
detection:
    selection:
        SourceImage|endswith: 'winword.exe'
        CallTrace|contains|all:
            - ':\Windows\Microsoft.NET\Framework64\v2.'
            - 'UNKNOWN'
    condition: selection
falsepositives:
    - unknown
level: high
tags:
    - attack.execution
    - attack.t1204.002
    - attack.t1055.003
