title: Juniper BGP MD5 missing
status: test
description: Find authenticated BGP failures
author: Tim Brown
date: 2023/01/09
logsource:
    product: juniper
    service: bgp
detection:
    protocol:
        - ':179'
    keywords:
        - 'missing MD5 digest'
    condition: protocol and keywords
fields:
    - host
level: low
