action: global
title: High DNS Requests Rate
id: b4163085-4001-46a3-a79a-55d8bbbc7a3a
description: High DNS requests amount from host per short period of time
status: experimental
author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
tags:
    - attack.exfiltration
    - attack.t1048
falsepositives:
    - Legitimate high DNS requests rate to domain name which should be added to whitelist
level: medium
---
logsource:
    category: dns
detection:
    selection:
        query: '*'
    timeframe: 1m
    condition: selection | count() by src_ip > 1000
---
logsource:
    category: firewall
detection:
    selection:    
        dst_port: 53
    timeframe: 1m
    condition: selection | count() by src_ip > 1000
