title: Cobalt Strike DNS Beaconing
status: experimental
description: Detects suspicious DNS queries known from Cobalt Strike beacons
references:
    - https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
author: Florian Roth
date: 2018/05/10
logsource:
    category: dns
detection:
    selection:
        query:
            - 'aaa.stage.*' 
            - 'post.1*'
    condition: selection
falsepositives:
    - Unknown
level: high

