action: global
title: High DNS Bytes Out
status: experimental
description: High DNS queries bytes amount from host per short period of time
author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
modified: 2020/08/27
falsepositives:
    - Legitimate high DNS bytes out rate to domain name which should be added to whitelist
level: medium
tags:
    - attack.exfiltration
    - attack.t1048 # an old one
    - attack.t1048.003
---
id: 0f6c1bf5-70a5-4963-aef9-aab1eefb50bd
logsource:
    category: dns
detection:
    selection:
        query: '*'
    timeframe: 1m
    condition: selection | sum(question_length) by src_ip > 300000
---
id: 3b6e327d-8649-4102-993f-d25786481589
logsource:
    category: firewall
detection:
    selection:
        dst_port: 53
    timeframe: 1m
    condition: selection | sum(message_size) by src_ip > 300000
