title: Suspicious DNS Query with B64 Encoded String   
status: experimental
description: Detects suspicious DNS queries using base64 encoding
references:
    - https://github.com/krmaxwell/dns-exfiltration
author: Florian Roth
date: 2018/05/10
logsource:
    category: dns
detection:
    selection:
        query:
            - '*==.*'
    condition: selection
falsepositives:
    - Unknown
level: medium