id: a8322756-015c-42e7-afb1-436e85ed3ff5
title: DNS tor proxies
description: |
  'Identifies IPs performing DNS lookups associated with common Tor proxies.'
reference: Azure Sentinel
author: Saw Winn Naung
severity: Medium
logsource: 
    service: dns  
    product: zeek 
tags:
  - attack.t1048
detection:
    selection:
        query:
            - 'tor2web.*' 
            - 'onion.*'
            - '*tor-gateways*'
    condition: selection
fields:
    - clientip
