title: Okta Threat Detected By Suspicious Push Challenge
id: 0e530c09-2157-44a4-9cae-65ad2c441fdf
status: experimental
description: Detects when whether the source of a Push Challenge (the “source event” generated by the Okta SignIn Widget) comes from a different location than the Okta Verify client that accepts or rejects the challenge (destination event).
references:
    - https://sec.okta.com/pushfatigueworkflows
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
author: Austin Songer @austinsonger
date: 2023/05/07
tags:
    - attack.initial_access
    - attack.t1078
logsource:
    product: okta
    service: okta
detection:
    selection_1:
        action: system.push.send_factor_verify_push
    selection_2:
        action: user.authentication.auth_via_mfa
        okta.debug_context.debug_data.factor: OKTA_VERIFY_PUSH
    timeframe: 10m
    condition: selection_1 | near selection_2
falsepositives:
    - Unlikely
level: high


