title: Okta Policy Rule Modified or Deleted
id: 0c97c1d3-4057-45c9-b148-1de94b631931
description: Detects when an Policy Rule is Modified or Deleted.
author: Austin Songer @austinsonger
status: experimental
date: 2021/09/12
modified: 2021/09/22
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
logsource:
  service: okta
detection:
    selection:
        eventtype: 
            - policy.rule.update
            - policy.rule.delete
    condition: selection
level: medium
tags:
    - attack.impact
falsepositives:
 - Unknown
 
