title: Okta Password in AlternateID Field
id: 91b76b84-8589-47aa-9605-c837583b82a9
status: test
description: Detects when a user has potentially entered their password into the
  username field, which will cause the password to be retained in log files
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://www.mitiga.io/blog/how-okta-passwords-can-be-compromised-uncovering-a-risk-to-user-data
author: kelnage
date: 2023/04/03
modified: 2023/04/03
tags:
    - attack.credential_access
    - attack.t1552
logsource:
    product: okta
    service: okta
detection:
    selection:
        legacyeventtype: core.user_auth.login_failed
        actor_alternateid|re|all:
            # The following check for Okta's password complexity requirements
            # You may need to adapt them based on your specific Okta config
            - .*[a-z].*  # A lowercase character
            - .*[A-Z].*  # An uppercase character
            - .*\d.*     # A number
            - .*[\"!\#\$%\&'’\(\)\*\+,\-\./\\:;<=>\?@\[\]\^_`\{\|\}\~].*  # A symbol
    filters:
        actor_alternateid:
            - 0oa*  # Service account names start with 0oa
            # Uncomment the below check and set the Domain placeholder to your
            # Organisation's Okta login domain for more accurate defeat
            # - '*@%Domain%'
    condition: selection and not filters
falsepositives:
    - Failed login attempts with a valid username that meets the password
      complexity requirements
level: low
