title: Okta Network Zone Deactivated or Deleted
id: 9f308120-69ed-4506-abde-ac6da81f4310
description: Detects when an Network Zone is Deactivated or Deleted.
author: Austin Songer @austinsonger
status: experimental
date: 2021/09/12
modified: 2021/09/22
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
logsource:
  service: okta
detection:
    selection:
        eventtype: 
            - zone.deactivate
            - zone.delete
    condition: selection
level: medium
tags:
    - attack.impact
falsepositives:
 - Unknown
 
