title: Okta API Token Revoked
id: cf1dbc6b-6205-41b4-9b88-a83980d2255b
description: Detects when a API Token is revoked.
author: Austin Songer @austinsonger
status: experimental
date: 2021/09/12
modified: 2021/09/22
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
logsource:
  service: okta
detection:
    selection:
        eventtype: system.api_token.revoke
    condition: selection
level: medium
tags:
    - attack.impact
falsepositives:
 - Unknown
 
