title: Okta MFA Reset or Deactivated
id: 50e068d7-1e6b-4054-87e5-0a592c40c7e0
description: Detects when an attempt at deactivating  or resetting MFA.
author: Austin Songer @austinsonger
status: experimental
date: 2021/09/21
modified: 2021/09/22
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
logsource:
  service: okta
detection:
    selection:
        eventtype: 
            - user.mfa.factor.deactivate
            - user.mfa.factor.reset_all
    condition: selection
level: medium
tags:
    - attack.persistence
falsepositives:
 - If a MFA reset or deactivated was performed by a system administrator. 
