title: Okta User Account Locked Out
id: 14701da0-4b0f-4ee6-9c95-2ffb4e73bb9a
description: Detects when an user account is locked out.
author: Austin Songer
status: experimental
date: 2021/09/12
references:
    - https://developer.okta.com/docs/reference/api/system-log/
    - https://developer.okta.com/docs/reference/api/event-types/
logsource:
  service: okta
detection:
    selection:
        displaymessage: Max sign in attempts exceeded
    condition: selection
level: medium
tags:
    - attack.impact
falsepositives:
 - Unknown
