title: Wuauclt Network Connection
id: c649a6c7-cd8c-4a78-9c04-000fc76df954
status: test
description: |
  Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code and making a network connections.
  One could easily make the DLL spawn a new process and inject to it to proxy the network connection and bypass this rule.
references:
    - https://dtm.uk/wuauclt/
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/12
modified: 2022/12/15
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image|contains: wuauclt
    # "C:\WINDOWS\uus\AMD64\wuauclt.exe" /DeploymentHandlerFullPath \\?\C:\Windows\UUS\AMD64\UpdateDeploy.dll /ClassId aaa256e1-5b21-4993-9188-18f07ccb3b98 /RunHandlerComServer
    filter_ms_range:  # Sysmon
        DestinationIp|startswith: '51.10'  # Microsoft Range
    filter_cmdline:
        CommandLine|contains: '\UpdateDeploy.dll /ClassId '
    condition: selection and not 1 of filter*
falsepositives:
    - Legitimate use of wuauclt.exe over the network.
level: medium
