title: Download a File with IMEWDBLD.exe
id: 8d7e392e-9b28-49e1-831d-5949c6281228
status: experimental
description: Use IMEWDBLD.exe (built-in to windows) to download a file
author: frack113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md#atomic-test-10---windows---powershell-download
    - https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/
date: 2022/01/22
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: '\IMEWDBLD.exe'
    condition: selection
falsepositives:
    - Legitimate script
level: high
tags:
    - attack.command_and_control
    - attack.t1105
