title: Network Connection Initiated To Mega.nz From Non Mega Application
id: 1916a861-2716-4f7a-ba8e-45ff92fb781a
related:
    - id: fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
      type: derived
status: test
description: |
    Detects an executable other than MEGA initiating a network connection to "api.mega.co.nz".
    Attackers were seen abusing file sharing websites similar to "mega.nz" in order to upload/download additional payloads.
references:
    - https://megatools.megous.com/
    - https://www.mandiant.com/resources/russian-targeting-gov-business
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/01
tags:
    - attack.exfiltration
    - attack.t1567.001
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        DestinationHostname|endswith: 'api.mega.co.nz'
    filter_main_mega:
        Image|endswith:
            # Note: This is a basic/best effort filter in order to avoid FP with the MEGA installer and executable.
            #       In practice please apply exact path to avoid basic path bypass techniques.
            - '\MEGAsync.exe'
            - '\MEGAsyncSetup32_*RC.exe' # Beta versions
            - '\MEGAsyncSetup32.exe' # Installers 32bit
            - '\MEGAsyncSetup64.exe' # Installers 64bit
            - '\MEGAupdater.exe'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: high
