title: Suspicious Office Outbound Connections
id: 3b5ba899-9842-4bc2-acc2-12308498bf42
status: experimental
description: Detects office suit communicating to target systems on uncommon ports
references: https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
author: X__Junior (Nextron Systems)
date: 2023/07/12
tags:
    - attack.defense_evasion
    - attack.t1036.005
logsource:
   category: network_connection
   product: windows
detection:
    selection:
        Image|endswith:
            - '\winword.exe'
            - '\wordpad.exe'
            - '\wordview.exe'
            - '\powerpnt.exe'
            - '\excel.exe'
            - '\outlook.exe'
    filter_main_ports:
        DestinationPort:
            - 80
            - 445
            - 139
            - 443
    condition: selection and not 1 of filter_main_*
falsepositives:
    - other ports can be used , apply additional filter accordingly
level: medium