title: Unusual Connection to Active Directory Web Services
id: b3ad3c0f-c949-47a1-a30e-b0491ccae876
status: experimental
description: Detects unusual network connections to Active Directory Web Services (ADWS) from processes not typically associated with ADWS management.
references:
  - https://medium.com/falconforce/soaphound-tool-to-collect-active-directory-data-via-adws-165aca78288c
  - https://github.com/FalconForceTeam/FalconFriday/blob/master/Discovery/ADWS_Connection_from_Unexpected_Binary-Win.md
author: '@kostastsale'
date: 2024/01/26
tags:
  - attack.discovery
  - attack.t1087
logsource:
  category: network_connection
  product: windows
detection:
  timeframe: last 2 hours
  selection:
    Initiated: true
    DestinationPort: 9389
  filter:
    Image|endswith:
      - '\dsac.exe'
      - '\pwsh.exe'
      - 'c:\windows\system32\windowspowershell\*'
      - 'c:\windows\syswow64\windowspowershell\*'
      - 'c:\program files\microsoft monitoring agent\*'
  condition: selection and not filter
falsepositives:
  - ADWS is used by a number of legitimate applications that need to interact with Active Directory. These applications should be added to the allow-listing to avoid false positives.
level: medium