title: AddinUtil.exe Network Connection
id: 3f73cf20-daf9-48ec-ac4d-5e996096c9c0
status: experimental
description: Detects network connections made by the Add-In deployment cache updating utility (AddInutil.exe), which could indicate command and control.
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
tags:
    - attack.defense_evasion  
    - attack.t1218   
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)  
date: 2023/09/18
logsource:                      
    category: network_connection  
    product: windows           
detection:
    selection:
        Initiated: 'true'
        Image|endswith: '\addinutil.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium