title: Network Connection To Devtunnels Or VsCode Tunnels
id: 9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4
related:
    - id: b3e6418f-7c7a-4fad-993a-93b65027a9f1
      type: similar
status: experimental
description: |
    Detects an executable initiate a network connection to either a devtunnels or Visual Studio Code tunnel domains. Attackers can be abuse these features to establish a reverse shell.
references:
    - https://cydefops.com/vscode-data-exfiltration
    - https://cydefops.com/devtunnels-unleashed
author: Kamran Saifullah
date: 2023/11/20
modified: 2023/11/20
tags:
    - attack.exfiltration
    - attack.t1567.001
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        DestinationHostname|endswith:
            - '.tunnels.api.visualstudio.com'
            - '.devtunnels.ms'
    condition: selection
falsepositives:
    - Legitimate use of Devtunnels or Visual Studio Code tunnel will also trigger this
level: medium
