title: ConfigurationRemotingServer Initiated Uncommon Outbound Connection
id: 3652fadf-c7d8-4b41-8ceb-20f41b056cb3
status: experimental
description: |
    Detects ConfigurationRemotingServer.exe initiating outbound network connections to uncommon destinations.
    It might indicate abuse of DSC's remoting capabilities for command and control (C2) communication, especially if connections are made to external IPs or domains on non-standard ports.
references:
    - https://dylansec.com/DSCourier/
    - https://github.com/DylanDavis1/DSCourier
    - https://eclipsesec.com/posts/DSCourier/
    - https://blog.compass-security.com/2026/03/winget-desired-state-initial-access-established/
author: Richard Roy (@unresolvedhost)
date: 2026-04-21
tags:
    - attack.command-and-control
    - attack.t1571
    - attack.execution
    - attack.t1059.001
logsource:
  category: network_connection
  product: windows
detection:
    selection:
        Image|endswith: '\ConfigurationRemotingServer.exe'
        Initiated: 'true'
    filter_main_common_ports:
        DestinationPort:
            - 80
            - 443
            - 5985
            - 5986
    filter_main_local_destinations:
        DestinationIp|startswith:
            - '127.'
            - '::1'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: medium
