title: External IP address lookup by a non-browser process
id: edf3485d-dac4-4d50-90e4-b0e5813f7e60
status: experimental
description: External IP address lookup by non-browser process is indicative of potential post compromise internet test activity.
references:
    - https://github.com/rsp/scripts/blob/master/externalip-benchmark.md
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa20-302a
    - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
author: Janantha Marasinghe
date: 2023/04/11
tags:
    - attack.discovery
    - attack.t1016
logsource:
    category: network_connection
    product: windows
detection:
    selection_domains:
        DestinationHostname|contains:
            - 'ident.me'
            - 'ifconfig.me'
            - 'icanhazip.com'
            - 'wgetip.com'
            - 'ipaddressworld.com'
            - 'ifconfig.io'
            - 'ipinfo.io'
            - 'ipecho.net'
            - 'checkip.amazonaws.com'
            - 'eth0.me'
            - 'bot.whatismyipaddress.com'
            - 'api.ipify.org'
            - 'whatismyip.akamai.com'
            - 'ident.me'
            - 'checkip.dyndns.org'
            - 'curlmyip.com'
            - 'l2.io'
            - 'ipof.in'
            - 'ip.tyk.nu'
            - 'ip.anysrc.net'
            - 'wtfismyip.com'
            - 'myexternalip.com'
    selection_process:
        Image|endswith: 
           - '\Chrome\Application\chrome.exe'
           - 'Microsoft\Edge\Application\msedge.exe'
           - '\Internet Explorer\iexplore.exe'
           - '\Mozilla Firefox\firefox.exe'
    condition: selection_domains and not selection_process
falsepositives:
    - Legitimate use of the external websites for troubleshooting or network monitoring
level: medium
