title: Wuauclt Network Connection
id: c649a6c7-cd8c-4a78-9c04-000fc76df954
status: test
description: |
  Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code and making a network connections.
  One could easily make the DLL spawn a new process and inject to it to proxy the network connection and bypass this rule.
references:
    - https://dtm.uk/wuauclt/
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/12
modified: 2023/01/20
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image|contains: 'wuauclt'
    # "C:\WINDOWS\uus\AMD64\wuauclt.exe" /DeploymentHandlerFullPath \\?\C:\Windows\UUS\AMD64\UpdateDeploy.dll /ClassId aaa256e1-5b21-4993-9188-18f07ccb3b98 /RunHandlerComServer
    filter_msrange:  # Sysmon
        DestinationIp|startswith:
            # Subnet: 20.184.0.0/13
            - '20.184.'
            - '20.185.'
            - '20.186.'
            - '20.187.'
            - '20.188.'
            - '20.189.'
            - '20.190.'
            - '20.191.'
            - '23.79.'
            - '51.10.'
            # Subnet: 51.103.210.0/23
            - '51.103.'
            - '51.104.'
            - '51.105.'
            - '52.239.'
    filter_cmdline:
        CommandLine|contains: '\UpdateDeploy.dll /ClassId '
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate use of wuauclt.exe over the network.
level: medium
