title: Remote PowerShell Session (Network)
id: c539afac-c12a-46ed-b1bd-5a5567c9f045
status: test
description: Detects remote PowerShell connections by monitoring network outbound connections to ports 5985 or 5986 from a non-network service account.
author: Roberto Rodriguez @Cyb3rWard0g
references:
  - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
date: 2019/09/12
modified: 2022/08/24
logsource:
  category: network_connection
  product: windows
detection:
  selection:
    DestinationPort:
      - 5985
      - 5986
    Initiated: 'true'  # only matches of the initiating system can be evaluated
  filter:
    - User|contains: # covers many language settings for Network Service, please expand
      - 'NETWORK SERVICE'
      - 'NETZWERKDIENST'
      - 'SERVIZIO DI RETE'
      - 'SERVICIO DE RED'
    - User|contains|all:
        - 'SERVICE R'
        - 'SEAU'
    - SourceIp|startswith: '0:0:'
    - Image:
      - 'C:\Program Files\Avast Software\Avast\AvastSvc.exe'
      - 'C:\Program Files (x86)\Avast Software\Avast\AvastSvc.exe'
  filter_localhost:
    SourceIp: '::1'
    DestinationIp: '::1'
  condition: selection and not 1 of filter*
falsepositives:
  - Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.
  - Network Service user name of a not-covered localization
level: high
tags:
  - attack.execution
  - attack.t1059.001
  - attack.lateral_movement
  - attack.t1021.006
