title: Github Repo Compromise Domain MyJino RU
id: 3a9f4c77-8e2e-45eb-abc1-4754f670d3a9
status: test
description: Detects connections to the host used in a big repository compromise discovered in August 2022
references:
   - https://twitter.com/stephenlacy/status/1554697077430505473
date: 2022/08/03
author: Florian Roth
logsource:
   category: network_connection
   product: windows
detection:
   selection:
      Initiated: 'true'
      DestinationHostname: 'ovz1.j19544519.pr46m.vps.myjino.ru'
   condition: selection
falsepositives:
    - Users looking up that domain after reading the report (unlikely)
level: high
