title: Certutil Initiated Connection
id: 0dba975d-a193-4ed1-a067-424df57570d1
status: experimental
description: Attackers can abuse `certutil.exe` to download malware, offensive security tools
author: frack113
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
date: 2022/09/02
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Image|endswith: '\certutil.exe'
        Initiated: 'true'
        DestinationPort:
            - 80
            - 443
            - 135
            - 445
    condition: selection
falsepositives:
    - Legitimate certutil network connection
level: medium
tags:
    - attack.command_and_control
    - attack.t1105
