title: Cisco Duo Auth Attempt Marked Fraud
id: 3a0ec0b5-cae1-49eb-aab3-af6b6e8af2c3
status: experimental
description: |
    Detects when a user marks an authentication attempt is marked fraud.
references:
    - https://duo.com/docs/adminapi#authentication-logs
author: Mike Wade
date: 2025-08-23
tags:
    - attack.credential-access
    - attack.initial-access
logsource:
    product: cisco
    service: duo
detection:
    selection:
        event_type: authentication
        results: fraud
    condition: selection
falsepositives:
    - User accidentally marked fraud
level: high
