title: Cisco Duo Admin Sent Reset Password Email
id: 74a8df03-3cd4-406e-abac-0f4bcbf97438
status: experimental
description: |
    Detects when a duo admin is sent a password reset email.
references:
    - https://duo.com/docs/adminapi#administrator-logs
author: Mike Wade
date: 2025-08-23
tags:
    - attack.credential-access
    - attack.initial-access
logsource:
    product: cisco
    service: duo
detection:
    selection:
        action: admin_send_reset_password_email
    condition: selection
falsepositives:
    - Legitimate need to reset admin password
level: medium
