title: Duo Integration Secret Key Viewed
id: 70858a47-f588-4837-b40a-27bcf67f82a0
status: experimental
description: |
     Detects when an administrator **views or copies an application's secret key** in Duo. In the admin logs, this is recorded as `"integration_skey_view"` (or `_bulk_view` if multiple). The secret key is a sensitive credential used by applications to communicate with Duo; it's normally shown only at creation. If an admin is retrieving it later, it could indicate key compromise or malicious intent. An attacker with admin access might view a secret to use Duo's API illicitly. This rule triggers on any admin activity where an integration secret was revealed in plaintext. Such events should be rare and thus investigated.
references:
    - https://duo.com/docs/adminapi#administrator-logs
    - https://duo.com/docs/logs#administrator-actions
author: Mike Wade
date: 2025-08-24
tags:
    - attack.credential-access
    - attack.persistence
logsource:
    product: cisco
    service: duo
detection:
    selection:
        action.name:
        - integration_skey_view
        - integration_skey_bulk_view
    condition: selection
level: high
