title: Cisco Duo Admin Locked Out
id: e2140b4d-168c-4ff6-bbce-160134cab571
status: experimental
description: |
    Detects when an admin account is locked out due to failed login attempts.
references:
    - https://duo.com/docs/adminapi#administrator-logs
author: Mike Wade
date: 2025-08-23
tags:
    - attack.credential-access
    - attack.initial-access
logsource:
    product: cisco
    service: duo
detection:
    selection:
        event_type: administrator
        reason: admin_lockout
    condition: selection
falsepositives:
    - Admin locking themselves out
level: high
