title: Cisco Duo User Denied Auth Due to Location
id: d858ef94-3d42-4bc8-8251-b35f823a67d4
status: experimental
description: |
    Detects when a user is denied access due to their location being on a denylist.
references:
    - https://duo.com/docs/adminapi#authentication-logs
author: Mike Wade
date: 2025-08-23
tags:
    - attack.credential-access
    - attack.initial-access
logsource:
    product: cisco
    service: duo
detection:
    selection:
        event_type: authentication
        results: fraud
    condition: selection
falsepositives:
    - User on VPN
level: high
