title: Cisco Duo Admin Created
id: d0109b0b-6e84-45a5-8e1c-df350823e744
status: experimental
description: |
    Detects when a duo admin account is created.
references:
    - https://duo.com/docs/adminapi#administrator-logs
author: Mike Wade
date: 2025-08-23
tags:
    - attack.credential-access
    - attack.initial-access
logsource:
    product: cisco
    service: duo
detection:
    selection:
        action: admin_create
    condition: selection
falsepositives:
    - Legitimate admin account created
level: medium
