title: Cisco Duo MFA Bypass Code Created
id: d9c9a847-54af-4638-a14a-4c9992738bb6
status: experimental
description: |
    Detects when an MFAauthentication bypass code is created
    A bypass code is a temporary passcode created by an administrator for a specific user to access a Duo-protected application. These are generally used as "backup codes," so that enrolled users who are having problems with their mobile devices (e.g., mobile service is disrupted, the device is lost or stolen, etc.) or who temporarily can't use their enrolled devices (on a plane without mobile data services) can still access their Duo-protected systems.
references:
    - https://duo.com/docs/adminapi#logs
author: Mike Wade
date: 2025-08-23
tags:
    - attack.credential-access
    - attack.defense-evasion
    - attack.initial-access
logsource:
    product: cisco
    service: duo
detection:
    selection:
        event_type: authentication
        reason: bypass_create
    condition: selection
falsepositives:
    - Admin created bypass code for troubleshooting
level: medium
