title: Failure Caused by Encryption Type Used for TGS Request
id: b1e0b3f5-b62e-41be-886a-daffde446ad4
status: experimental
description: Detects error about the missmatch of the encryption types in the TGS request
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd348773(v=ws.10)
author: '@SerkinValery'
date: 2024/02/21
tags:
    - attack.credential_access
    - attack.t1558.003
logsource:
    product: windows
    service: system
detection:
    selection:
        Provider_Name: "Microsoft-Windows-Kerberos-Key-Distribution-Center"
        EventID: 27
    condition: selection
falsepositives:
    - Unknown
level: low
