title: Suspicious Cert Use With No Strong Mapping 
id: 993c2665-e6ef-40e3-a62a-e1a97686af79
status: experimental
description: Detects the exploitation of elevation of privilege vulnerability that can occur when the KDC allows spoofing by not requiring a strong mapping
references:
    - https://support.microsoft.com/en-us/topic/kb5014754-certificate-based-authentication-changes-on-windows-domain-controllers-ad2c23b0-15d8-4340-a468-4d4f3b188f16
author: Brady Stouffer
date: 2023/08/22
tags:
    - attack.privilege_escalation
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 39
        Provider_Name: 'Kerberos-Key-Distribution-Center'
    condition: selection
falsepositives:
    - If prevalent in the environment, isolate events where the AccountName and CN of the Subject do not reference the same user
level: medium
