title: Okta Password Health Report Query
id: 0d58814b-1660-4d31-8c93-d1086ed24cba
status: experimental
description: Detects Activity against endpoints like /reports/password-health/ should only be accessed via OKTA Admin Console UI.
author: Muhammad Faisal (@faisalusuf)
date: 2023/10/25
references:
    - https://www.beyondtrust.com/blog/entry/okta-support-unit-breach
tags:
    - attack.credential_access
logsource:
    category: okta
    product: okta
detection:
    selection:
        debugContext.debugData.requestUri: '*/reports/password-health/*'
    condition: selection
falsepositives:
    - OKTA Admin Activites via Web Console UI.
    - This rule is recommended to be used for threat hunting, especially in the context of OKTA support incident in OCT-2023.
    - This rule can be used to hunt the activity against endpoints like /reports/password-health/async_csv_download_schedule?, which are typically used from Okta Admin Console UI only, without any corresponding admin console login. See reference
level: informational
