title: Okta Svc Users Creation Query
id: 00a8e92a-776b-425f-80f2-82d8f8fab2e5
status: experimental
description: Detects if any new user accounts are created having keyword "svc". Please modify the rule to match the org specific naming convention that threat actor might use for their advantage.
author: Muhammad Faisal (@faisalusuf)
date: 2023/10/25
references:
    - https://www.beyondtrust.com/blog/entry/okta-support-unit-breach
tags:
    - attack.credential_access
logsource:
    category: okta
    product: okta
detection:
    selection1:
        eventtype:
            - user.lifecycle.create
            - user.lifecycle.activate
    selection2:
        target.user.display.name: '*svc*'
    condition: selection1 and selection2
falsepositives:
     - Valid user accounts.
level: informational
