title: Okta Admin Activity From Proxy Query
id: 9058ca8b-f397-4fd1-a9fa-2b7aad4d6309
status: experimental
description: "Detects Okta admin functions through proxy (isproxy: true in Okta log events)."
author: Muhammad Faisal @faisalusuf
date: 2023/10/25
references: 
    - https://www.beyondtrust.com/blog/entry/okta-support-unit-breach
    - https://dataconomy.com/2023/10/23/okta-data-breach/
    - https://blog.cloudflare.com/how-cloudflare-mitigated-yet-another-okta-compromise/
tags:
    - attack.credential_access
logsource:
    category: okta
    product: okta
detection:
    selection:
        debugContext.debugData.requestUri: '*admin*'
        securityContext.isProxy: true
    condition: selection
falsepositives:
     - Legitimate admin activities. Use this rule for threat hunting pruposes only if proxy useage is normal in the environment.
level: low