title: Kerberos Pre-Authentication Failure for Machine Accounts
id: f932f9f9-a6bd-45e3-9a0d-ca613fe7fc40
status: experimental
description: |
    Detects Kerberos pre-authentication failures for machine accounts, which may indicate attempts to brute-force service account passwords.
    This rule helps identify potential Golden dMSA attacks where attackers try multiple password combinations.
    When hunting, look for multiple 4771 failures for machine accounts in short succession with status code 0x18.
    The hypothesis is that an attacker is attempting to identify machine accounts with weak passwords for attacks like Golden dMSA.
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4771
    - https://ipurple.team/2025/09/02/golden-dmsa/
    - https://www.semperis.com/blog/golden-dmsa-what-is-dmsa-authentication-bypass/
author: Panos Gkatziroulis, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-09-11
tags:
    - attack.credential-access
    - attack.t1110.001
    - detection.threat-hunting
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4771
        TargetUserName|endswith: '$'
        Status: '0x18'
    condition: selection
falsepositives:
    - Legitimate authentication failures, such as misconfigured services or devices using outdated credentials.
level: medium
