title: Suspicius Setup16 Parent
id: 99c8be4f-3087-4f9f-9c24-8c7e257b442e
status: experimental
description: An adversary may use setup16 as lolbin
references:
    - https://www.hexacorn.com/blog/2024/10/12/the-sweet16-the-oldbin-lolbin-called-setup16-exe/
author: frack113
date: 2024-10-13
tags:
    - attack.defense-evasion
    - attack.t1574.005
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        ParentImage: 'C:\Windows\SysWOW64\setup16.exe'
        ParentCommandLine|contains|all:
            - ' -m '
            - '-QT'
    filter_valid_path:
        Image|startswith: 'C:\~MSSETUP.T\'
    condition: selection_img and not filter_valid_path
falsepositives:
    - Old setup application
level: medium
