title: Winscp Launch From Uncommon Folder
id: 7674f8ef-7141-4cf0-a311-ee359264c64c
status: experimental
description: Use Winscp from an uncommon folder
references:
    - https://blogs.blackberry.com/en/2024/07/akira-ransomware-targets-the-latam-airline-industry
author: frack113
date: 2024/07/30
tags:
    - attack.exfiltration
    - attack.t1048
    - detection.threat_hunting
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\WinSCP.exe'
        - OriginalFileName: 'winscp.exe'
    filter:
        Image|contains: ':\Program Files (x86)\WinSCP\'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
