title: Export Function 'DllRegisterServer' Called - by Rundll32
id: d81a9fc6-55db-4461-b962-0e78fea5b0ad
related:
    - id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed # Renamed rundll32
      type: similar
status: experimental
description: Detects when the DLL export function 'DllRegisterServer' is called in the commandline by Rundll32 (explicit). The DLL is located in a non-standard path. Executables are natively found in C:\Windows\system32 and C:\Windows\syswow64.
references:
    - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
    - https://www.virustotal.com/gui/file/94816439312563db982cd038cf77cbc5ef4c7003e3edee86e2b0f99e675ed4ed/behavior
    - https://learn.microsoft.com/en-us/windows/win32/api/olectl/nf-olectl-dllregisterserver
author: Andreas Braathen (mnemonic.io)
date: 2023/09/01
tags:
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_image:
        - Image|endswith: '\rundll32.exe'
        - OriginalFileName: 'RUNDLL32.EXE'
    selection_cmdline:
        CommandLine|contains: 'DllRegisterServer'
    filter_paths:
        CommandLine|contains:
            - ':\Program Files\'
            - ':\Program Files (x86)'
    condition: selection_image and selection_cmdline and not 1 of filter_*
falsepositives:
    - Is legitimately used as part of application install, but less likely from e.g. temporary paths.
    - Not every instance is considered malicious, but it will capture malicious use of it. 
level: medium
