title: Findstr to Find Plaintext Passwords
id: 1a0f6f16-2099-4753-9a02-43b6ac7a1fa5
status: experimental
description: Identify commandline usage of findstr.exe to search for passwords in a variety of different langauges
author: Josh Nickels
references:
  - https://steflan-security.com/windows-privilege-escalation-credential-harvesting/#:~:text=findstr%20%2Fsi%20password%20%2A.xml%20%2A.ini%20%2A.txt%20%2A.config%202%3Enul,%3D%3D%20%2Avnc%2A%20%3D%3D%20%2A.config%2A%20where%20%2FR%20C%3A%20user.txt
  - https://adsecurity.org/?p=2288
date: 2023/05/18
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image: "findstr.exe"
    CommandLine|contains:
      - "passw" # German, English
      - "passe" # French
      - "密碼" # Cantonese
      - "contraseña" # Spanish
      - "parola" # Italian
      - "senord" # Swedish
      - "hasło" # Polish
      - "senha" # Portuguese
      - "heslo" # Czech
  condition: selection
falsepositives:
  - Valid searching of these strings
level: medium
tags:
  - attack.credential_access
  - attack.t1552.001
