title: Successful Authentications From Countries You Do Not Operate Out Of
id: 8c944ecb-6970-4541-8496-be554b8e2846
status: test
description: Detect successful authentications from countries you do not operate out of.
references:
    - https://learn.microsoft.com/en-gb/entra/architecture/security-operations-user-accounts
    - https://ishitasingh724.medium.com/cracking-kql-how-a-suspicious-login-alert-led-me-into-the-world-of-threat-hunting-and-the-10-kql-4ea6366ff0b3
author: MikeDuddington, '@dudders1'
date: 2022-07-28
modified: 2026-05-08
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.initial-access
    - attack.credential-access
    - attack.stealth
    - attack.t1078.004
    - attack.t1110
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        resultType: 0
    filter:
        location|contains|expand: '%location%'
    condition: selection and not filter
falsepositives:
    - If this was approved by System Administrator.
level: medium
