title: Suspicious Task Added by Powershell
id: fe3a2d49-f255-4d10-935c-bda7391108eb
status: experimental
description: |
  Adversaries may abuse BITS jobs to persistently execute or clean up after malicious payloads.
  Windows Background Intelligent Transfer Service (BITS) is a low-bandwidth, asynchronous file transfer mechanism exposed through [Component Object Model](https://attack.mitre.org/techniques/T1559/001)
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md
author: frack113
date: 2022/03/01
logsource:
    product: windows
    service: bits-client
detection:
    selection:
        EventID: 3
        processPath|endswith: '\powershell.exe'
    condition: selection
falsepositives:
    - Administrator PowerShell scripts 
level: low
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1197