title: Microsoft Defender for Office365 Malicious URL Block Bypassed by User
id: 4b4d8640-fdec-4d28-a0a0-7272b689d8f8
status: experimental
description: |
    Detects instances where Microsoft Defender for Office 365 successfully blocked a user from accessing a malicious URL or held the user on a detonation pending page, but the user overrode the block to navigate to the URL.
    It indicates that user accessed a known malicious or unsafe URL, which may be part of phishing campaigns or other malicious activities, despite the security controls in place.
references:
    - https://learn.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-schema#microsoft-defender-for-office-365-and-threat-investigation-and-response-schema
    - https://learn.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-schema#urlclickaction
    - https://learn.microsoft.com/en-us/defender-office-365/safe-links-about
author: Tom Kluter
date: 2026-02-18
tags:
    - attack.initial-access
    - attack.execution
    - attack.command-and-control
    - attack.t1566.002
    - attack.t1071.001
    - attack.t1204.001
logsource:
    service: audit
    product: m365
detection:
    selection:
        Workload: 'ThreatIntelligence'
        Operation: 'TIUrlClickData'
        UrlClickAction:
            - 4 # BlockPageOverride (User blocked from navigating to the URL by Safe Links, but the user overrode the block to navigate to the URL)
            - 5 # PendingDetonationPageOverride (User presented with the detonation page by Safe Links, but the user overrode the page to navigate to the URL)
    condition: selection
falsepositives:
    - Controlled Red Team exercises or authorized security researchers.
level: high
