title: Microsoft Defender For Office365 Intra-Org Lateral Email
id: 56d25a6c-9426-4556-912c-423521367012
status: experimental
description: |
    Detects internal (Intra-Org) emails observed by Microsoft Defender for Office 365 within Microsoft 365.
    Since the direction is Intraorg, this can indicate a potential compromised internal account attempting to phish or spread malware laterally.
references:
    - https://learn.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-schema#microsoft-defender-for-office-365-and-threat-investigation-and-response-schema
    - https://learn.microsoft.com/en-us/defender-office-365/anti-phishing-protection-about
author: Tom Kluter
date: 2026-03-18
tags:
    - attack.initial-access
    - attack.t1566
    - attack.lateral-movement
    - attack.t1534
logsource:
    service: audit
    product: m365
detection:
    selection:
        Workload: 'ThreatIntelligence'
        Operation: 'TIMailData'
        Directionality: 'Intraorg'
    filter_main_blocked:
        DeliveryAction: 'Blocked'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Internal phishing simulations (Phishing drills) failing to bypass filter headers correctly.
    - False positives from Microsoft filtering engine regarding internal newsletters or automated reports.
level: high
