title: Rename File With a Double Extention
id: e3f673b3-65d1-4d80-9146-466f8b63fa99
status: experimental
description: ransomware rename file with a custom extention like  .CHAOS, .ggeo ...
references:
    - https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
author: frack113
date: 2022/07/16
logsource:
    product: windows
    category: file_rename
detection:
    selection:
        OriginalFilename|endswith:
            - '.lnk'
            - '.rtf'
            - '.pst'
            - '.jpg'
        TargetFilename|contains: 
            - '.lnk.'
            - '.rtf.'
            - '.pst.'
            - '.jpg.'
    filter:
        TargetFilename|endswith:
            - '.tmp'
            - '.bak'
    condition: selection and not filter
falsepositives:
    - Backup software
level: medium
