title: Suspicious File Rename With Double Extension
id: e3f673b3-65d1-4d80-9146-466f8b63fa99
status: experimental
description: Detects possible ransomware renaming files with a custom extension such as ".CHAOS", ".ggeo"...etc
references:
    - https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
author: frack113
date: 2022/07/16
logsource:
    product: windows
    category: file_rename
detection:
    selection:
        OriginalFilename|endswith:
            - '.lnk'
            - '.rtf'
            - '.pst'
            - '.docx'
            - '.jpg'
            - '.pdf'
        TargetFilename|contains: 
            - '.lnk.'
            - '.rtf.'
            - '.pst.'
            - '.docx.'
            - '.jpg.'
            - '.pdf'
    filter:
        TargetFilename|endswith:
            - '.tmp'
            - '.bak'
            - '.old'
    condition: selection and not filter
falsepositives:
    - Backup software
level: medium
