title: Suspicious Appended Extension
id: e3f673b3-65d1-4d80-9146-466f8b63fa99
status: experimental
description: Detects possible ransomware adding a custom extension to the encrypted files, such as ".jpg.crypted", ".docx.locky" etc.
references:
    - https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
    - https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/
author: frack113
date: 2022/07/16
modified: 2022/08/31
tags:
    - attack.impact
    - attack.t1486
logsource:
    product: windows
    category: file_rename
detection:
    selection:
        OriginalFilename|endswith:
            - '.lnk'
            - '.rtf'
            - '.pst'
            - '.docx'
            - '.xlsx'
            - '.jpg'
            - '.jpeg'
            - '.png'
            - '.pdf'
        TargetFilename|contains: 
            - '.lnk.'
            - '.rtf.'
            - '.pst.'
            - '.docx.'
            - '.xlsx.'
            - '.jpg.'
            - '.jpeg.'
            - '.png.'
            - '.pdf.'
    filter:
        TargetFilename|endswith:
            - '.tmp'
            - '.bak'
            - '.old'
            - '.orig'
            - '.backup'
            - '.temp'
    condition: selection and not filter
falsepositives:
    - Backup software
level: medium
