title: CVE-2026-41940 cPanel Service Daemon Suspicious Child Process
id: 984a21f0-4d82-4fdc-a2b7-a0e6a1e51c03
related:
    - id: 77964729-4b1b-49e3-a21d-996d335b85d1
      type: derived
    - id: 7aca0427-7e19-4859-af17-40157e2f1f7d
      type: derived
status: experimental
description: Detects post-exploitation command execution from CVE-2026-41940, a critical authentication bypass in cPanel and WHM (CVSS 9.8). After bypassing authentication via CRLF injection into cpsrvd session files, attackers execute arbitrary commands through the cpsrvd or cpdavd daemon running as root. Spawning shells, recon tools, download utilities, or interpreters as direct children of these daemons is strongly anomalous.
references:
    - https://support.cpanel.net/hc/en-us/articles/40073787579671
    - https://labs.watchtowr.com/the-internet-is-falling-down-falling-down-falling-down-cpanel-whm-authentication-bypass-cve-2026-41940/
    - https://www.rapid7.com/blog/post/etr-cve-2026-41940-cpanel-whm-authentication-bypass/
    - https://nvd.nist.gov/vuln/detail/CVE-2026-41940
author: MahmoudSwelam
date: 2026-05-01
modified: 2026-05-10
tags:
    - attack.execution
    - attack.t1059.004
    - attack.discovery
    - attack.t1033
    - attack.persistence
    - attack.t1505.003
logsource:
    product: linux
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - '/cpsrvd'
            - '/cpsrvd-ssl'
            - '/cpdavd'
            - '/cpdavd-ssl'
    selection_shell:
        Image|endswith:
            - '/bash'
            - '/sh'
            - '/dash'
            - '/zsh'
            - '/ksh'
            - '/tcsh'
    selection_recon:
        Image|endswith:
            - '/whoami'
            - '/id'
            - '/uname'
            - '/hostname'
            - '/ifconfig'
            - '/ip'
            - '/netstat'
            - '/ss'
            - '/ps'
            - '/ls'
    selection_download:
        Image|endswith:
            - '/curl'
            - '/wget'
            - '/fetch'
            - '/tftp'
            - '/ftp'
    selection_interpreter:
        Image|endswith:
            - '/python'
            - '/python2'
            - '/python3'
            - '/perl'
            - '/ruby'
            - '/php'
            - '/node'
    condition: selection_parent and (selection_shell or selection_recon or selection_download or selection_interpreter)
falsepositives:
    - Custom cPanel plugins or hooks that legitimately invoke shell scripts as cpsrvd children
    - Administrative cPanel update processes that temporarily spawn interpreters
    - Monitoring agents operating under the cPanel process context
level: critical
