title: Container Residence Discovery
id: 9e902369-0eab-4234-bbbd-828328ce8454
status: experimental
description: Detects common methods for a user to determine if their shell resides within a Linux container.  
references:
    - https://blog.skyplabs.net/posts/container-detection/
    - https://stackoverflow.com/questions/20010199/how-to-determine-if-a-process-runs-inside-lxc-docker
tags:
    - attack.discovery
    - attack.t1082      # discovery of system information
author: Seth Hanford
date: 2023/07/31
logsource:  
    category: process_creation
    product: linux
detection:
    selection_dockerenv:
        Image|endswith:
            - '/ls'
            - '/find'
        CommandLine|endswith: ' /.dockerenv'
    selection_inode:            # inode outside containers low, inside high
        Image|endswith: 
            '/ls'
        CommandLine|contains|all:
            - ' -*i'              # -i finds inode number
            - ' -*d'              # -d gets directory itself, not contents
        CommandLine|endswith: 
            ' /'
    selection_file_content_commands:
        Image|endswith:
            - 'awk'
            - '/cat'
            - 'grep'
            - '/head'
            - '/less'
            - '/more'
            - '/nl'
            - '/tail'
    selection_procfs_kthreadd:  # ouside containers, PID 2 == kthreadd
        CommandLine|contains: 
            '/proc/2/'
    selection_procfs_target:
        CommandLine|contains: 
            - '/proc/*/cgroup'  # cgroups end in ':/' outside containers
            - '/proc/*/sched'   # PID mismatch when run in containers    
    condition: selection_dockerenv or selection_inode or (selection_file_content_commands and 1 of selection_procfs_*)
falsepositives:
    - Legitimate system administrator usage of these commands
    - Some container tools or deployments may use these techniques natively to determine how they proceed with execution, and will need to be filtered
level: low