title: Potential Linux Groups Discovery
id: 6d506805-389e-4370-8270-da7fd947a0da
status: experimental
description: This rule detects adversaries attempting to discover group and permission settings.
    It looks for process execution related to `groups`, `getent`, or `netstat` commands which could indicate an attempt to gather information on available user accounts and groups, including elevated permissions.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
author: Milad Cheraghi
date: 2024-12-01
tags:
    - attack.discovery
    - attack.t1069
logsource:
    product: linux
    category: process_creation
detection:
    selection_getent:
        Image|endswith: '/getent'
        CommandLine|contains: 'group'
    selection_netstat:
        Image|endswith: '/netstat'
        CommandLine|contains: 'localgroup'
    selection_groups:
        Image|endswith: '/groups'
    condition: 1 of selection_*
falsepositives:
    - Administrative users running these commands for legitimate purposes
level: medium
