title: Browser Information Discovery - Linux
id: 53f9703e-abc5-4eff-945e-2ab75c206c63
status: test
description: Adversaries may enumerate information about browsers to learn more about compromised environments.Data saved by browsers (such as bookmarks, accounts, and browsing history) may reveal a variety of personal information about users (e.g., banking sites, relationships/interests, social media) and details about internal network resources like servers, tools, dashboards, or other infrastructure.
references:
    - https://medium.com/@jsaxena017/web-browser-forensics-part-2-firefox-browser-3dc6ef104607
    - https://renenyffenegger.ch/notes/development/web/browser/Firefox/profile-folder/index
    - https://medium.com/@s12deff/steal-firefox-passwords-from-windows-linux-9d9a87906c7d
author: CheraghiMilad
date: 2024-12-08
tags:
    - attack.discovery
    - attack.t1217
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '/cat'
            - '/ed'
            - '/head'
            - '/more'
            - '/nano'
            - '/tail'
            - '/vi'
            - '/vim'
            - '/less'
            - '/sqlite3'
        CommandLine|contains:
            - 'cert*.db'
            - 'places.sqlite'
            - 'cookies.sqlite'
            - 'logins.json'
            - 'prefs.js'
    condition: selection
level: medium
