title: Steganography Hide Files with Steghide - Process Creation
id: 42c32a80-eb08-4732-90d8-2547e5c137eb
related:
    - id: ce446a9e-30b9-4483-8e38-d2c9ad0a2280
      type: derived
status: test
description: Detects embedding of files with usage of steghide binary, the adversaries may use this technique to prevent the detection of hidden information.
references:
    - https://vitux.com/how-to-hide-confidential-files-in-images-on-debian-using-steganography/
author: 'Pawel Mazur'
date: 2021-10-27
tags:
    - attack.defense-evasion
    - attack.t1027.003
logsource:
    product: linux
    category: process_creation
detection:
    selection:
      Image|endswith: 'steghide'
      CommandLine|contains|all:
        - 'embed'
        - '-cf'
        - '-ef'
    condition: selection
falsepositives:
    - Unknown
level: medium
