title: Potential Amazon SSM Agent Hijacking
id: f9b3edc5-3322-4fc7-8aa3-245d646cc4b7
status: experimental
description: Detects potential Amazon SSM agent hijack attempts as outlined in the Mitiga research reoport.
author: Muhammad Faisal
date: 2023/08/03
references:
    - https://www.mitiga.io/blog/mitiga-security-advisory-abusing-the-ssm-agent-as-a-remote-access-trojan
    - https://www.bleepingcomputer.com/news/security/amazons-aws-ssm-agent-can-be-used-as-post-exploitation-rat-malware/
    - https://www.helpnetsecurity.com/2023/08/02/aws-instances-attackers-access/
tags:
    - attack.command_and_control
    - attack.persistence
    - attack.t1219
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        ParentImage|endswith: '/amazon-ssm-agent'
        CommandLine|contains|all:
            - '-register'
            - '-code'
            - '-id'
            - '-region'
    condition: selection
falsepositives:
    - Legitimate activity of system administrators
level: medium