title: Detect Execution of Common Linux Attack Tools
id: b952740a-799f-45fa-987c-b5f872af6a52
status: experimental
description: Detects execution of common attack tools like nmap, masscan, socat, ncat, netcat, etc.
author: David Burkett, @signalblur
date: 2024/06/21
tags:
    - attack.t1059.004
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /masscan
            - /nmap
            - /socat
            - /ncat
            - /netcat
            - /hydra
            - /john
            - /sqlmap
            - /aircrack-ng
            - /wireshark
            - /ettercap
            - /metasploit
            - /nikto
            - /tcpdump
            - /hping3
            - /chisel
            - /zenmap
            - /nc
    condition: selection
fields:
    - Image
    - CommandLine
falsepositives:
    - Legitimate usage of the listed tools for administrative or testing purposes.
level: high
