title: Potential Container Discovery Via Inodes Listing
id: 43e26eb5-cd58-48d1-8ce9-a273f5d298d8
status: test
description: Detects listing of the inodes of the "/" directory to determine if the we are running inside of a container.
references:
    - https://blog.skyplabs.net/posts/container-detection/
    - https://stackoverflow.com/questions/20010199/how-to-determine-if-a-process-runs-inside-lxc-docker
tags:
    - attack.discovery
    - attack.t1082
author: Seth Hanford
date: 2023-08-23
modified: 2025-11-20
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        # inode outside containers low, inside high
        Image|endswith: '/ls'
        CommandLine|endswith: ' /'
    re_inode:
        CommandLine|re: '\s-[^-\s]{0,20}i'  # -i finds inode number
    re_dir:
        CommandLine|re: '\s-[^-\s]{0,20}d'  # -d gets directory itself, not contents
    mix1:
        CommandLine|re: '\s-[^-\s]{0,20}i'  # -i finds inode number
        CommandLine|contains: '--directory '
    mix2:
        CommandLine|re: '\s-[^-\s]{0,20}d'  # -d gets directory itself, not contents
        CommandLine|contains: '--inode '
    mix3:
        CommandLine|contains|all:
            - '--inode '
            - '--directory '
    condition: (selection and re_inode and re_dir) or selection and 1 of mix*
falsepositives:
    - Legitimate system administrator usage of these commands
    - Some container tools or deployments may use these techniques natively to determine how they proceed with execution, and will need to be filtered
level: low
