title: Detect Renaming of Common Attack Tools and System Binaries
id: 5754d641-08e1-4eef-8187-279c44c3b5bf
status: experimental
description: Detects attempts to rename common attack tools and commonly abused system binaries like wget and curl.
author: David Burkett, @signalblur
date: 2024/06/21
tags:
    - attack.t1036.003
    - attack.t1072
    - attack.t1059.004
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - /mv
            - /rename
        CommandLine|contains:
            - masscan
            - nmap
            - socat
            - ncat
            - netcat
            - hydra
            - john
            - sqlmap
            - aircrack-ng
            - wireshark
            - ettercap
            - metasploit
            - nikto
            - tcpdump
            - hping3
            - wget
            - curl
    condition: selection
fields:
    - Image
    - CommandLine
falsepositives:
    - Legitimate administrative or maintenance tasks involving renaming of binaries.
level: high
