title: File Time Attribute Change - Process Creation
id: 324b1672-7ebf-4465-97f9-850ba0d14a52
related:
    - id: b3cec4e7-6901-4b0d-a02d-8ab2d8eb818b
      type: derived
status: experimental
description: Detect file time attribute change to hide new or changes to existing files.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md
author: 'Igor Fits, oscd.community'
date: 2024-10-27
tags:
    - attack.defense-evasion
    - attack.t1070.006
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith: '/touch'
        CommandLine|contains:
            - '-t'
            - '-acmr'
            - '-d'
            - '-r'
    condition: selection
falsepositives:
    - Unknown
level: medium
