title: Detection of Password Groups Discovery
id: 2b7d6524-c142-435a-ae96-be23543b9883
status: test
description: |
    This rule detects adversaries attempting to discover group and permission settings.
    It looks for process execution related to `groups`, `getent`, or `netstat` commands which could indicate an attempt to gather information on available user accounts and groups, including elevated permissions.
author: Milad Cheraghi
date: 2024-12-01
tags:
    - attack.discovery
    - attack.t1069
    - attack.linux
logsource:
    product: linux
    category: process_creation
detection:
    selection_getent:
        Image|endswith: '/getent'
        CommandLine|contains: 'group'
    selection_netstat:
        Image|endswith: '/netstat'
        CommandLine|contains: 'localgroup'
    selection_groups:
        Image|endswith: '/groups'
    condition: 1 of selection_*
falsepositives:
    - Administrative users running these commands for legitimate purposes
level: medium
