title: Discovery Information About Operantig System in Silent Mode
id: d27ab432-2199-483f-a297-03633c05bae6
status: experimental
description: Detects the use of grep to identify information about the system using the parameter -q to do it in silent mode
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2023/30/05
tags:
    - attack.discovery
    - attack.t1082
logsource:
    category: process_creation
    product: linux
detection:
    selection_process:
        Image|endswith: '/grep'
        CommandLine|contains: '-iq'
    selection_architecture:
        CommandLine|contains:
            - 'aarch64'
            - 'armv7'
            - 'x86_64'
            - 'arm*'
            - 'mips*'
            - 'i386'
            - 'i686'
            - 'AArch64'
            - 'ARMv7'
            - 'arm'
            - 'mips'
            - 'mipsel'
            - 'mips64'
            - 'mips64el'
    condition: all of selection_*
falsepositives:
    - Unknown
level: low
