title: Edit Linux Text
status: stable
description: Detects suspicious commands for edit text using sed
author: TuanLe (GTSC)
date: 2022/03/14
references:
    - https://www.geeksforgeeks.org/sed-command-in-linux-unix-with-examples/
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith:
            - 'sed'
        CommandLine|contains:
            - '-i'
    condition: selection
falsepositives:
    - Legitimate administration activities
level: medium
tags:
    - attack.privilege_escalation

