title: Edit Linux Texts
id: ea3fgcdf3-db86-9f48-hgb3-659a29d4db89
status: test
description: Detects suspicious commands for edit text using sed
author: TuanLe (GTSC)
date: 2022/03/14
references:
    - https://www.geeksforgeeks.org/sed-command-in-linux-unix-with-examples/
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|contains:
            - '/sed'
        CommandLine|contains:
            - '-i'
    condition: selection
falsepositives:
    - Legitimate administration activities
level: medium
tags:
    - attack.privilege_escalation