title: Possible Perl Reverse Shell
id: 259df6bc-003f-4306-9f54-4ff1a08fa38e
status: experimental
description: Detects some of most common reverse shell techniques on Linux systems.
references:
      - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
      - https://www.revshells.com/
author: '@d4ns4n_'
date: 2023/04/07
tags:
   - attack.initial_access
   - attack.t1133
logsource:
   category: process_creation
   product: linux
detection:
    selection:
        Image|contains: 'perl'
        CommandLine|contains|all:
            - ' -e '
            - 'Socket'
            - 'connect'
            - 'open'
            - 'exec'
    condition: selection
falsepositives:
    - Legitimate use of these patterns
level: medium