title: History File Deletion
id: 1182f3b3-e716-4efa-99ab-d2685d04360f
status: experiemntal
description: Detects events in which a history file gets deleted, e.g. the ~/bash_history to remove traces of malicious activity
author: Florian Roth
references:
  - https://github.com/sleventyeleven/linuxprivchecker/
date: 2022/06/20
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith: '/rm'
  selection_history:
    - CommandLine|contains: '/.bash_history'
    - CommandLine|endswith: '_history'
  condition: selection
falsepositives:
  - Legitimate administration activities
level: high
tags:
  - attack.impact
  - attack.t1565.001
