title: Possible Python Reverse Shell
id: 32e62bc7-3de0-4bb1-90af-532978fe42c0
status: experimental
description: Detects some of most common reverse shell techniques on Linux systems.
references:
      - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
      - https://www.revshells.com/
author: '@d4ns4n_'
date: 2023/04/07
tags:
   - attack.initial_access
   - attack.t1133
logsource:
   category: process_creation
   product: linux
detection:
    selection:
        Image|contains: 'python'
        CommandLine|contains|all:
            -  '-c '
            -  'connect'
    condition: selection
falsepositives:
    - Legitimate use of these patterns
level: medium