title: Detecting Reverse Shell on Linux System
id: 6104e693-a7d6-4891-86cb-49a258523559
status: experimental
description: Detects some of most common reverse shell techniques on Linux systems.
references:
      - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
      - https://www.revshells.com/
author: '@d4ns4n_'
date: 2023/04/07
tags:
   - attack.initial_access
   - attack.t1133      
logsource:
   category: process_creation
   product: linux
detection:
    # The selections can easly integrated with others techniques
    selection_bs:
        Image|endswith: 'bin/bash'
        CommandLine: '-i'
    selection_py:
        Image|contains: 'python'
        CommandLine: '-c'
        CommandLine|contains: 'connect'
    selection_php:
        Image|contains: 'php'
        CommandLine: '-r'
        CommandLine|contains: 'fsockopen'
    selection_nc:
        Image|contains: 'nc'
        CommandLine: 
            - '-r'
            - '-e'
        CommandLine|contains: '/bin/sh'
    selection_pl:
        Image|contains: 'perl'
        CommandLine: '-e'
        CommandLine|contains|all: 
            - 'Socket'
            - '$p='
        CommandLine|contains:
            - '$i='
            - 'PeerAddr'
    selection_rb:
        Image|contains: 'ruby'
        CommandLine|startswith: '-rsocket -e'
        CommandLine|contains:
            - 'TCPSocket.new'
            - 'TCPSocket.open'
    selection_xt:
        Image|contains: 'xterm'
        CommandLine|contains: '-display'
        CommandLine|endswith: ':1'
    condition: 1 of selection*
falsepositives:
    - Legitimate use of these patterns
level: high