title: ESXi Firewall Default Action Set to Pass
id: e0f2e697-0352-49a3-b488-11b3dcf1c9fd
status: experimental
description: Detects when the ESXi firewall default action is set to PASS instead of DROP
references:
    - 
author: Nathan Burns
date: 2024-11-20
tags:
    - attack.t1562.004
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        
    condition: selection
falsepositives:
    - Unknown
level: critical
