title: Possible Php Reverse Shell
id: c6714a24-d7d5-4283-a36b-3ffd091d5f7e
status: experimental
description: Detects some of most common reverse shell techniques on Linux systems.
references:
      - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
      - https://www.revshells.com/
author: '@d4ns4n_'
date: 2023/04/07
tags:
   - attack.initial_access
   - attack.t1133
logsource:
   category: process_creation
   product: linux
detection:
    selection:
        Image|contains: 'php'
        CommandLine|contains|all:
            -  '-r '
            -  'fsockopen'
    condition: selection
falsepositives:
    - Legitimate use of these patterns
level: medium