title: Suspicious SSHD Children Processes
id: 9aa27839-e8ba-4d7a-ac1a-746c22c3d1e5
status: experimental
description: Detects sshd process spawning suspicious children, potentially CVE-2024-3094 exploitation
references:
    - https://github.com/amlweems/xzbot?tab=readme-ov-file#backdoor-demo
author: Arnim Rupp
date: 2024/04/01
tags:
    - attack.execution
logsource:
    category: process_creation
    product: linux
detection:
    selection_1:
        ParentImage|endswith: 'sshd'
        User: root
        CommandLine|startswith:
            'sh -c'
    selection_2:
        ParentImage|endswith: 'sshd'
        User: sshd
        CommandLine|startswith:
            'sshd'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
