title: Nice GTFOBin Abuse - Linux
id: 093d68c7-762a-42f4-9f46-95e79142571a
status: experimental
description: Detects usage of "nice" as a GTFOBin Linux binary abuse to break out from restricted environments by spawning an interactive system shell.
references:
    - https://gtfobins.github.io/gtfobins/nice/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: 2024-08-05
tags:
    - attack.discovery
    - attack.t1083
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: '/nice'
        CommandLine|endswith:
            - '/bin/sh'
            - '/bin/bash'
            - '/bin/dash'
            - '/bin/zsh'
            - '/bin/fish'
    condition: selection
falsepositives:
    - Unknown
level: high