title: Possible Bash Reverse Shell
id: 6104e693-a7d6-4891-86cb-49a258523559
status: experimental
description: Detects some of most common reverse shell techniques on Linux systems.
references:
      - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
      - https://www.revshells.com/
author: '@d4ns4n_'
date: 2023/04/07
tags:
   - attack.initial_access
   - attack.t1133
logsource:
   category: process_creation
   product: linux
detection:
    selection:
        Image|endswith: 'bin/bash'
        CommandLine: '-i '
    condition: selection
falsepositives:
    - Legitimate use of these patterns
level: medium