title: Process Execution From Root Web Directory
id: 3b3d279e-a97a-4c5c-8be0-64b21ead5fa1
description: Detects processes where the executable or image path contains common web root directories to identify potential webshells.
status: experimental
author: David Burkett, @signalblur
tags:
    - attack.t1505.003
date: 2024/06/28
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|contains:
            - '/var/www/'
            - '/usr/share/nginx/'
            - '/srv/http/'
            - '/home/*/public_html/'
            - '/usr/local/nginx/'
    condition: selection
fields:
    - Image
    - CommandLine
falsepositives:
    - System administrators or developers running scripts or commands within web directories for legitimate purposes or as part of an applications functionality.
level: medium
