title: GTFOBIN PYTHON SHELL
id: 2d2f44ff-4611-4778-a8fc-323a0e9850cc
status: experimental
description: Detects usage of Python a GTFOBin Linux binary abuse to break out from restricted environments by spawning an interactive system shell.
references:
    - https://gtfobins.github.io/gtfobins/python/#shell
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: 2024/08/05
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: linux
detection:
    selection_python:
        Image|contains: 'python'
    selection_cli:
        CommandLine|contains|all:
            - ' -c '
            - 'import' 
            - 'os'
            - 'os.system('
        CommandLine|contains:
            - '/bin/sh'
            - '/bin/bash'
            - '/bin/dash'
            - '/bin/zsh'
            - '/bin/fish'
    condition: selection_python and selection_cli
falsepositives:
    - Unknown
level: high