title: Bpfdoor TCP Ports Redirect - Process Creation
id: 2e258051-0dcb-4790-b824-92d844abe9cf
related:
    - id: 70b4156e-50fc-4523-aa50-c9dddf1993fc
      type: derived
status: experimental
description: |
    All TCP traffic on particular port from attacker is routed to different port. ex. '/sbin/iptables -t nat -D PREROUTING -p tcp -s 192.168.1.1 --dport 22 -j REDIRECT --to-ports 42392'
    The traffic looks like encrypted SSH communications going to TCP port 22, but in reality is being directed to the shell port once it hits the iptables rule for the attacker host only.
references:
    - https://www.sandflysecurity.com/blog/bpfdoor-an-evasive-linux-backdoor-technical-analysis/
    - https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor
author: Rafal Piasecki
date: 2022-10-27
tags:
    - attack.defense-evasion
    - attack.t1562.004
logsource:
    category: process_creation
    product: linux
detection:
    selection_cmd:
        Image|endswith: 'iptables'
        CommandLine|contains: '-t nat'
    selection_keywords:
        CommandLine|contains:
            - '--to-ports 42'
            - '--to-ports 43'
    condition: selection_cmd and selection_keywords
falsepositives:
    - Legitimate port redirects
level: medium
