title: Execution of Script In Tmp Folder
id: 30bcce26-51c5-49f2-99c8-7b59e3af36c7
status: experimental
description: Detects executions of scripts stored in tmp folder using bash or sh
references:
    - https://blogs.jpcert.or.jp/en/2023/05/gobrat.html
    - https://www.virustotal.com/gui/file/60bcd645450e4c846238cf0e7226dc40c84c96eba99f6b2cffcd0ab4a391c8b3/detection
    - https://www.virustotal.com/gui/file/3e44c807a25a56f4068b5b8186eee5002eed6f26d665a8b791c472ad154585d1/detection
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2023/30/05
logsource:
    product: linux
    category: process_creation
detection:
    selection_shell:
        CommandLine|contains: 
          - '/bin/bash'
          - '/bin/sh'
    selection_parameters:
        CommandLine|contains|all: 
          - '/tmp/'
          - '-c'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
