title: Linux Network Service Scanning
id: 3e102cd9-a70d-4a7a-9508-403963092f31
status: test
description: Detects enumeration of local or remote network services.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
    - https://github.com/projectdiscovery/naabu
    - https://github.com/Tib3rius/AutoRecon
author: Alejandro Ortuno, oscd.community, Georg Lauenstein (sure[secure])
date: 2020/10/21
modified: 2023/10/25
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: process_creation
    product: linux
detection:
    netcat:
        Image|endswith:
            - '/nc'
            - '/netcat'
            - '/ncat'
            - '/socat'
    network_scanning_tools:
        Image|endswith:
            - '/telnet' # could be wget, curl, ssh, many things. basically everything that is able to do network connection. consider fine tuning
            - '/nmap'
            - '/hping'
            - '/hping2'
            - '/hping3'
            - '/nping'
            - '/naabu'
            - '/autorecon'
    netcat_listen_flag:
        CommandLine|contains: 'l'
    condition: (netcat and not netcat_listen_flag) or network_scanning_tools
falsepositives:
    - Legitimate administration activities
level: low
