title: File Integrity Linux
id: 7405066c-2b5e-44d7-93fa-7ca6c4660ad9
status: test
description: Detects the changes of sensitive and critical files Monitor files that you don’t expect to change without planning on Linux system. 
references:
    - https://docs.microsoft.com/en-us/azure/defender-for-cloud/file-integrity-monitoring-overview#which-files-should-i-monitor
author: '@d4ns4n_ (Wuerth-Phoenix)'
date: 2023/05/24
tags:
    - attack.impact
    - attack.t1565.001
logsource:
    category: process_creation
    product: linux
detection:
    selection_1:
        Image|endswith:
            - 'echo'
            - '/cat'
            - 'grep'
            - '/head'
            - '/tail'
            - '/more'
        CommandLine|contains: 
            - ' >'
            - ' >>'
    selection_2:
        Image|endswith:
            - '/nano'
            - '/vim'
            - '/vi'
            - '/sed'
            - '/emacs'
    selection_args:
        CommandLine|contains:
            - ' /etc/sudoers'
            - ' /etc/hosts'
            - ' /bin/login'
            - ' /bin/passwd'
            - ' /etc/*.conf'
            - ' /usr/bin'
            - ' /usr/sbin'
            - ' /bin'
            - ' /sbin'
            - ' /boot'
            - ' /usr/local/bin'
            - ' /usr/local/sbin'
            - ' /opt/bin'
            - ' /opt/sbin'
            - ' /etc/crontab'
            - ' /etc/init.d'
            - ' /etc/cron.hourly'
            - ' /etc/cron.daily'
            - ' /etc/cron.weekly'
            - ' /etc/cron.monthly'
    condition: 1 of selection_* and selection_args
falsepositives:
    - Legitimate administration activities
level: medium