title: Possible Coin Miner CPU Priority Param - Process Creation
id: 6ac275ba-dd70-449b-ba17-fd6c6d5fc77c
related:
    - id: 071d5e5a-9cef-47ec-bc4e-a42e34d8d0ed
      type: similar
status: experimental
description: Detects command line parameter very often used with coin miners
references:
    - https://xmrig.com/docs/miner/command-line-options
author: Florian Roth (Nextron Systems)
date: 2024-10-22
tags:
    - attack.privilege-escalation
    - attack.t1068
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        CommandLine|contains: '--cpu-priority'
    condition: selection
falsepositives:
    - Other tools that use a --cpu-priority flag
level: critical
