title: GCC GTFOBin Abuse - Linux
id: 9b5de532-a757-4d70-946c-1f3e44f48b4d
status: experimental
description: Detects usage of GCC compilers as a GTFOBin Linux binary abuse to break out from restricted environments by spawning an interactive system shell.
references:
    - https://gtfobins.github.io/gtfobins/gcc/#shell
    - https://gtfobins.github.io/gtfobins/c89/#shell
    - https://gtfobins.github.io/gtfobins/c99/#shell
    - https://www.elastic.co/guide/en/security/current/linux-restricted-shell-breakout-via-linux-binary-s.html
author: Li Ling, Andy Parkidomo, Robert Rakowski, Blake Hartstein (Bloomberg L.P.)
date: 2024/08/05
tags:
    - attack.discovery
    - attack.t1083
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith:
            - '/gcc'
            - '/c89'
            - '/c99'
        CommandLine|contains: '-wrapper'
    selection_cli:
        CommandLine|contains:
            - '/bin/sh,-s'
            - '/bin/bash,-s'
            - '/bin/dash,-s'
            - '/bin/zsh,-s'
            - '/bin/fish,-s'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high