title: HackTool - BloodyAD Execution - Linux
id: b7dda640-9d81-4e5d-b8c5-8dbf17f3d5f0
related:
    - id: d392b07c-ebbb-40bf-aae0-8b325593480c
      type: similar
status: experimental
description: |
    Detects execution of bloodyAD, an Active Directory privilege escalation framework that supports
    DACL manipulation, password resets, group membership changes, RBCD configuration, UAC flag
    modification, and computer account creation.
references:
    - https://github.com/CravateRouge/bloodyAD
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2026-04-21
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1098
    - attack.t1484.001
logsource:
    product: linux
    category: process_creation
detection:
    selection_img:
        Image|contains: '/bloodyAD'
    selection_python_img:
        - Image|contains: '/python'
        - OriginalFileName|contains: 'python'
    selection_python_cli:
        CommandLine|contains: 'bloodyAD'
    condition: selection_img or all of selection_python_*
falsepositives:
    - Unlikely
level: high
