title: Potential Password Spray Using Legacy Authentication Via UserAgent Strings
id: 45c44cda-46ce-4304-a44a-90fb2337ae54
status: experimental
description: Detect password spray attempts from potential clients using legacy authentication via UserAgent strings. This could be a sign of MFA bypass using a password
    - https://blooteem.com/march-2022
    - https://www.microsoft.com/en-us/security/blog/2021/10/26/protect-your-business-from-password-sprays-with-microsoft-dart-recommendations/
author: Harjot Singh, '@cyb3rjy0t'
date: 2023/03/20
tags:
    - attack.initial_access
    - attack.credential_access
    - attack.t1078.004
    - attack.t1110
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Count > 20
        duration < 24h
        userAgent|contains: 
            - 'BAV2ROPC'
            - 'CBAinPROD'
            - 'CBAinTAR'
    condition: selection
falsepositives:
    - Known Legacy Accounts that are allowed to login
level: medium
