title: Privilege Role Sign-In Outside Expected Controls
id: cf1e5687-84e1-41af-97a9-158094efef53
status: experimental
description: Detects when an account fails a sign-in when it doesn't meet expected controls for admins
author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: 2022/08/11
references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor
logsource:
    product: azure
    service: signinlogs
detection:
    # You have to tune the rule for your environnement before use it
    selection:
        Status: failure
        Location: '<Countries you do NOT operate out of e,g GB, use OR for mulitple>'
        IPaddress: '<unapproved IP>'
        DeviceInfo: '<unapproved browser, operating system'
    condition: selection
falsepositives:
     - A legit admin not following proper processes
tags:
    - attack.valid_accounts
    - attack.t1078
level: high
