title: User Access Blocked by Azure Conditional Access
id: 9a60e676-26ac-44c3-814b-0c2a8b977adf
status: experimental
author: AlertIQ
date: 2021/10/10  
description: Detect access has been blocked by Conditional Access policies. The access policy does not allow token issuance which might be sights≈ of unauthorizeed login to valid accounts.
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ResultType: 53003
  condition: selection 
level: medium
falsepositives:
  - Unknown
tags:
  - attack.credential_access
  - attack.t1110
