title: Account Disabled or Blocked for Sign in Attempts
id: 4afac85c-224a-4dd7-b1af-8da40e1c60bd
description: Alert on when a disabled or blocked for sign in users attempts to login
author: Yochana Henderson, '@Yochana-H'
date: 2022/06/17
references:
    - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-privileged-accounts
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        ResultType: 50057
        ResultDescription: Failure
    condition: selection
level: low
falsepositives:
    - Account disabled or blocked in error
    - Automation account has been blocked or disabled
status: experimental
tags:
    - attack.credential_access
    - attack.t1110
