title: Disabled MFA to Bypass Authentication Mechanisms
id: 7ea78478-a4f9-42a6-9dcd-f861816122bf
status: experimental
description: Detection for when multi factor authentication has been disabled, which might indicate a malicious activity to bypass authentication mechanisms.
author: '@ionsor'
date: 2022/02/08
references:
    - https://attack.mitre.org/techniques/T1556/
    - https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates
logsource:
    product: azure
    service: activitylogs
detection:
    selection:
        eventSource: AzureActiveDirectory
        eventName: 'Disable Strong Authentication.'
        status: success
    condition: selection
falsepositives:
    - Authorized modification by administrators
level: medium
tags:
    - attack.persistence
    - attack.t1556
