title: Measurable Increase Of Sucessful Authentications
id: 67d5f8fc-8325-44e4-8f5f-7c0ac07cb5ae
status: experimental
description: Detects when sucessful sign-ins increased by 10% or greater.
author: Mark Morowczynski '@markmorow', MikeDuddington, '@dudders1'
date: 2022/08/11
references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-successful-unusual-sign-ins
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: Sucess
        Count: "<10%"
    condition: selection
falsepositives:
     - Increase of users in the environment
tags:
    - attack.valid_accounts
    - attack.t1078
level: low