title: User State Changed From Guest To Member
id: 8dee7a0d-43fd-4b3c-8cd1-605e189d195e
status: experimental
author: MikeDuddington, '@dudders1'
date: 2022/06/30
description: Detects the change of user type from "Guest" to "Member" for potential elevation of privilege.
references:
  - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-external-user-sign-ins
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    Category: 'UserManagement'
    OperationName: 'Update user'
    properties.message: '"displayName":"UserType","oldValue":"[\"Guest\"]","newValue":"[\"Member\"]"'
  condition: selection
level: medium
falsepositives:
  - If this was approved by System Administrator.
tags:
  - attack.t1078