title: Sign-ins from Non-Compliant Devices
id: 5afa454e-030c-4ab4-9253-a90aa7fcc581
description: Monitor and alert for sign-ins where the device was non-compliant.
author: Michael Epping, '@mepples21'
date: 2022/06/28
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#non-compliant-device-sign-in
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    DeviceDetail.isCompliant: 'false'
  condition: selection
falsepositives:
  - Unknown
level: high
status: experimental
tags:
  - attack.valid_accounts
  - attack.t1078
