title: Authentication Occuring Outside Normal Business Hours
id: 160f24f3-e6cc-496d-8a3d-f5d06e4ad526
status: experimental
description: Detects when an a user signs in outside of normal business hours. 
author: Mark Morowczynski '@markmorow', MikeDuddington, '@dudders1'
date: 2022/08/11
references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        properties.message|contains|all:
        Status: Sucess
        Location: '<Countries you DO operate out of e,g GB, use OR for mulitple>'
        Date: '<outside normal working hours>'
    condition: selection
falsepositives:
     - User doing actual work outside of normal business hours.
tags:
    - attack.persistence
    - attack.t1078
level: low