title: End User Consent
id: 9b2cc4c4-2ad4-416d-8e8e-ee6aa6f5035a
description: Detects when an end user consents to an application
author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: 2022/07/28
references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#end-user-consent
logsource:
    product: azure
    service: auditlogs
detection:
    selection:
        ConsentContext.IsAdminConsent: 'false'
    condition: selection
falsepositives:
    - Unknown
level: low
status: experimental
tags:
    - attack.privilege_escalation