title: Authentications To Important Apps Using Single Factor Authentication
id: f272fb46-25f2-422c-b667-45837994980f
status: experimental
author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detect when authentications to important application(s) only required single-factor authentication
references:
  - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: 'Success'
    AppId: 'Insert Application ID use OR for multiple'
    AuthenticationRequirement: 'singleFactorAuthentication'
  condition: selection
level: medium
falsepositives:
  - If this was approved by System Administrator.
tags:
  - attack.t1078