title: New CA Policy by Non-approved Actor
id: 0922467f-db53-4348-b7bf-dee8d0d348c6
description: Monitor and alert on conditional access changes.
author: Corissa Koopmans, '@corissalea'
date: 2022/07/18
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-infrastructure
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message: Add conditional access policy
  condition: selection
falsepositives:
  - Misconfigured role permissions
  - Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.
level: medium
status: experimental
tags:
  - attack.defense_evasion
  - attack.t1548
