title: Account Lockout 
id: 2b7d6fc0-71ac-4cf7-8ed1-b5788ee5257a
status: experimental
author: AlertIQ
date: 2021/10/10  
description: Identifies user account which has been locked because the user tried to sign in too many times with an incorrect user ID or password.
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ResultType: 50053
  condition: selection
level: medium
falsepositives:
  - Unknown
tags:
  - attack.credential_access
  - attack.t1110
