title: Failed Authentications From Countries You Do Not Operate Out Of
id: 28870ae4-6a13-4616-bd1a-235a7fad7458
status: experimental
author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detect failed authentications from countries you do not operate out of.
references:
  - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: 'Success'
  selection1:
    Location|contains: '<Countries you DO operate out of e,g GB, use OR for multiple>'
  condition: not selection and not selection1
level: low
falsepositives:
  - If this was approved by System Administrator.
tags:
  - attack.t1078
