title: Azure AD Only Single Factor Authentication Required
id: 28eea407-28d7-4e42-b0be-575d5ba60b2c
status: experimental
author: MikeDuddington, '@dudders1'
date: 2022/07/27
description: Detect when users are authenticating without MFA being required.
references:
  - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: 'Success'
    AuthenticationRequirement: 'singleFactorAuthentication'
  condition: selection
level: low
falsepositives:
  - If this was approved by System Administrator.
tags:
  - attack.t1078