title: Added credentials to existing application
id: cbb67ecc-fb70-4467-9350-c910bdf7c628
description: Any additional credentials added outside of expected processes could be a malicious actor using those credentials.  
author: Mark Morowczynski, @markmorow
date: 2022/04/21
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-credentials
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    properties.message: 
      - Update Application-Certificates and secrets management
      - Update Service principal/Update Application
  condition: selection
falsepositives:
  - When credentials are added/removed as part of the normal working hours/workflows
level: High
status: expiramental