title: CA Policy Updated by Non Approved Actor
id: 50a3c7aa-ec29-44a4-92c1-fce229eef6fc
status: experimental
description: Monitor and alert on conditional access changes. Is Initiated by (actor) approved to make changes? Review Modified Properties and compare "old" vs "new" value.
author: Corissa Koopmans, '@corissalea'
date: 2022/07/19
references:
  - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-infrastructure#conditional-access
logsource:
  product: azure
  service: auditlogs
detection:
  keywords:
    - Update conditional access policy
  condition: keywords
falsepositives:
  - Misconfigured role permissions
  - Verify whether the user identity, user agent, and/or hostname should be making changes in your environment.
tags:
  - attack.defense_evasion
  - attack.t1548
level: medium
