title: Account Created And Deleted By Non Approved Users
id: c98184ba-4a27-4e10-b7b7-da48e71f4d25
status: experimental
description: Detects when accounts are created and deleted by non-approved users. 
author: Mark Morowczynski '@markmorow', MikeDuddington, '@dudders1'
date: 2022/08/11
references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-user-accounts#short-lived-accounts
logsource:
    product: azure
    service: auditlogs
detection:
    # You have to tune the rule for your environnement before use it
    selection:
       properties.message: 
            - Add user
            - Delete user
        Status: Sucess
    valid_admin:
           Initiatied.By: 'approved user UPN' 
    condition: selection and not valid_admin
falsepositives:
     - Legit administrative action
tags:
    - attack.defense_evasion
    - attack.t1078
level: medium
