title: Successful Authentications From Countries You Do Not Operate Out Of
id: 8c944ecb-6970-4541-8496-be554b8e2846
status: experimental
author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detect successful authentications from countries you do not operate out of.
references:
  - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    Status: 'Success'
  filter:
      Location|contains: '<Countries you DO operate out of e,g GB, use OR for multiple>'
  condition: selection and not filter
level: medium
falsepositives:
  - If this was approved by System Administrator.
tags:
  - attack.t1078
