title: Discovery using AzureHound
id: 35b781cc-1a08-4a5a-80af-42fd7c315c6b
status: experimental
description: AzureHound is a BloodHound data collector for Microsoft Azure. This detects AzureHound activity via the default User-Agent that is used during its operation after successful authentication.
references:
    - https://github.com/BloodHoundAD/AzureHound
author: Janantha Marasinghe
date: 2022/11/27
tags:
    - attack.t1087.004
    - attack.t1526
    - attack.discovery
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        userAgent|startswith: 'azurehound'
        ResultType: 0
    condition: selection
falsepositives:
    - Unknown
level: high
