title: Guest Users Invited To Tenant By Non Approved Inviters
id: 4ad97bf5-a514-41a4-abd3-4f3455ad4865
status: experimental
author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detects guest users being invited to tenant by non-approved inviters
references:
  - https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-external-user-sign-ins
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    Category: 'UserManagement'
    OperationName: 'Invite external user'
  filter:
    InitiatedBy|contains: '<approved guest inviter use OR for multiple>'
  condition: selection and not filter 
level: medium
falsepositives:
  - If this was approved by System Administrator.
tags:
  - attack.t1078
