  title: Password Reset By User Account
  id: 340ee172-4b67-4fb4-832f-f961bdc1f3aa
  status: experimental
  author: YochanaHenderson, '@Yochana-H'
  date: 2022/08/03
  description: Detect when a user has reset their password in Azure AD
  references:
    - https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
  logsource:
    product: azure
    service: auditlogs
  detection:
    selection:
      Category: 'UserManagement'
      Status: 'Success'
      Initiatedby: 'UPN'
    filter:
        Target|contains: 'UPN'
        ActivityType|contains: 'Password reset'
    condition: selection and filter
  level: medium
  falsepositives:
    - If this was approved by System Administrator or confirmed user action.
  tags:
    - attack.t1078
