title: Suspicious Sign In Bypassing MFA
id: 53bb4f7f-48a8-4475-ac30-5a82ddfdf6fc
status: experimental
description: Detect successful authenication by bypassing MFA using known Legacy Authentication User Agents 
references:
    - https://blooteem.com/march-2022
author: Harjot Singh, '@cyb3rjy0t'
date: 2023/03/20
tags:
    - attack.initial_access
    - attack.credential_access
    - attack.t1078.004
    - attack.t1110
logsource:
    product: azure
    service: signinlogs
detection:
    selection:
        Status: 'Success'
        userAgent|contains: 
            - 'BAV2ROPC'
            - 'CBAinPROD'
            - 'CBAinTAR'
    condition: selection
falsepositives:
    - Known Legacy Accounts
level: high
