title: Delete Log from Application
id: b1decb61-ed83-4339-8e95-53ea51901720
status: experimental
description: Deletion of log files is a known anti-forensic technique
author: frack113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
date: 2022/01/16
logsource:
    product: windows
    category: file_delete
detection:
    selection_teamviewer:
        TargetFilename|endswith: '.log'
        TargetFilename|contains: '\TeamViewer_'
    filter:
        Image: C:\Windows\system32\svchost.exe
    condition: selection_teamviewer and not filter
falsepositives:
    - Unknown
level: low
tags:
    - attack.defense_evasion
    - attack.t1070.004
