title: Access To Chromium Sensitive Files By Uncommon Application
id: c5f37810-a85f-4186-81e9-33f23abb4141
status: experimental
description: |
    Detects file access requests to chromium based browser sensitive files by uncommon processes.
    Could indicate potential attempt of stealing senitive information.
    Requires heavy baselining before usage
references:
    - Internal Research
author: X__Junior
date: 2024/07/26
tags:
    - attack.t1003
    - attack.credential_access
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    selection_chromium:
        FileName|contains:
            - '\User Data\Default\Network\Cookies'
            - '\User Data\Default\Cookies'
            - '\User Data\Default\History'
            - '\User Data\Default\Web Data'
    filter_main_system:
        Image: System
    filter_main_generic:
        # This filter is added to avoid large amount of FP with 3rd party software. You should remove this in favour of specific filter per-application
        Image|contains:
            - ':\Program Files (x86)\'
            - ':\Program Files\'
            - ':\Windows\system32\'
            - ':\Windows\SysWOW64\'
    filter_optional_defender:
        Image|contains: ':\ProgramData\Microsoft\Windows Defender\'
        Image|endswith:
            - '\MpCopyAccelerator.exe'
            - '\MsMpEng.exe'
    condition: 1 of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
    - Antivirus, Anti-Spyware, Anti-Malware Software
    - Backup software
    - Legitimate software installed on partitions other than "C:\"
    - Searching software such as "everything.exe"
level: medium
