title: Access to Registry File Exports
id: 337a31c6-46c4-46be-886a-260d7aa78cac
status: experimental
description: |
  Detects access to exported  Windows Registry files with a .hive or .reg extension.
  Adversaries may interact with the Windows Registry to gather information about the system, configuration or installed software.
references:
    - https://github.com/tccontre/Reg-Restore-Persistence-Mole
author: frack113
date: 2023/08/26
tags:
    - attack.t1112 
    - attack.defense_evasion
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    selection:
        FileName|endswith:
            - '.hive'
            - '.reg'
    filter_system_folders:
        Image|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
            - 'C:\Windows\system32\'
            - 'C:\Windows\SysWOW64\'
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate software accessing these files (for any reason).
level: medium
