title: Suspicious Access To Windows Credential History File
id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
status: experimental
description: |
  Detects suspicious processes based on name and location that access the Windows Credential History File.
  Which can be a sign of credential stealing. Example case would be usage of mimikatz "dpapi::credhist" function
references:
    - https://tools.thehacker.recipes/mimikatz/modules/dpapi/credhist
    - https://www.passcape.com/windows_password_recovery_dpapi_credhist
author: Nasreddine Bencherchali
date: 2022/10/17
tags:
    - attack.credential_access
    - attack.t1555.004
logsource:
    category: file_access
    product: windows
    definition: file_access rules are using the Microsoft-Windows-Kernel-File ETW provider
detection:
    selection:
        FileName|endswith: '\Microsoft\Protect\CREDHIST'
    filter_system_folders:
        Image|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
            - 'C:\Windows\system32\'
            - 'C:\Windows\SysWOW64\'
    filter_processes:
        Image: 'C:\Windows\explorer.exe'
    condition: selection and not 1 of filter_*
falsepositives:
    - Unknown
# Increase level after false positives filters are good enough
level: medium
