title: Access To Cryptocurrency Files By Uncommon Application
id: f41b0311-44f9-44f0-816d-dd45e39d4bc8
status: experimental
description: |
    Detects file access requests to cryptocurrency files by uncommon processes.
    Could indicate potential attempt of cryptocurrency stealing.
    Requires heavy baselining before usage
references:
    -  Internal Research
author: X__Junior
date: 2024/07/26
tags:
    - attack.t1003
    - attack.credential_access
logsource:
    category: file_access
    product: windows
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
detection:
    selection_cryptocurrency:
        FileName|contains:
            - '\AppData\Roaming\Bitcoin\wallet.dat'
            - '\AppData\Roaming\Litecoin\wallet.dat'
            - '\AppData\Roaming\DogeCoin\wallet.dat'
            - '\AppData\Roaming\DashCore\wallet.dat'
            - '\AppData\Roaming\Zcash\wallet.dat'
            - '\AppData\Roaming\Ripple\wallet.dat'
            - '\AppData\Roaming\BitcoinABC\wallet.dat'
            - '\AppData\Roaming\BitcoinSV\wallet.dat'
            - '\AppData\Roaming\Ethereum\keystore\'
            - '\AppData\Roaming\EthereumClassic\keystore\'
            - '\AppData\Roaming\monero\wallets\'
    filter_main_system:
        Image: System
    filter_main_generic:
        # This filter is added to avoid large amount of FP with 3rd party software. You should remove this in favour of specific filter per-application
        Image|contains:
            - ':\Program Files (x86)\'
            - ':\Program Files\'
            - ':\Windows\system32\'
            - ':\Windows\SysWOW64\'
    filter_optional_defender:
        Image|contains: ':\ProgramData\Microsoft\Windows Defender\'
        Image|endswith:
            - '\MpCopyAccelerator.exe'
            - '\MsMpEng.exe'
    condition: 1 of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
falsepositives:
    - Antivirus, Anti-Spyware, Anti-Malware Software
    - Backup software
    - Legitimate software installed on partitions other than "C:\"
    - Searching software such as "everything.exe"
level: medium