title: Remote Thread Creation Via PowerShell
id: eeb2e3dc-c1f4-40dd-9bd5-149ee465ad50
related:
    - id: 99b97608-3e21-4bfe-8217-2a127c396a0e
      type: derived
status: test
description: Detects the creation of a remote thread from a Powershell process to another process
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
author: Nikita Nazarov, oscd.community
date: 2020-10-06
modified: 2023-11-10
tags:
    - attack.execution
    - attack.t1059.001
    - detection.threat-hunting
logsource:
    product: windows
    category: create_remote_thread
detection:
    selection:
        SourceImage|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
    filter_main_compattelrunner:
        SourceParentImage|endswith: ':\Windows\System32\CompatTelRunner.exe'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: medium
