title: Certificate Exported
id: e2b5163d-7deb-4566-9af3-40afea6858c3
status: experimental
description: Detects when a user or mimikatz exports a certificate (and possibly the private key as well) from the local Windows certificate store.
references:
    - https://www.splunk.com/en_us/blog/security/breaking-the-chain-defending-against-certificate-services-abuse.html
author: Zach Mathis
date: 2023/05/13
tags:
    - attack.credential_access
    - attack.t1649
logsource:
    product: windows
    definition: 'The CAPI2/Operational log needs to be enabled as it is disabled by default. Powershell ScriptBlock logging should also be enabled.'
detection:
    selection_CAPI_log:
        Channel: Microsoft-Windows-CAPI2/Operational
        EventID: 70 # "Acquire Certificate Private Key"
    selection_CS_client_log:
        Channel: Microsoft-Windows-CertificateServicesClient-Lifecycle-System/Operational
        EventID: 1007 # "A certificate has been exported"
    selection_PwSh_log:
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
        EventID: 4104
        ScriptBlockText|contains:
            - 'Export-Certificate'
            - 'Export-PFXCertificate'
    condition: 1 of selection_*
falsepositives:
    - A user exporting their certificate.
level: medium
