title: Failed DNS Zone Transfer
id: e2b5163d-7deb-4566-9af3-40afea6858c3
status: experimental
description: Detects when there is a failed DNS zone transfer.
references:
author: Zach Mathis
date: 2023/05/14
modified: 2023/05/14
tags:
    - attack.reconnaissance
    - attack.t1590.002
logsource:
    product: windows
    service: dns-server
detection:
    selection:
        EventID: 6004
    selection_bad_zone_transfer:
        - 'DNS_EVENT_BAD_ZONE_TRANSFER_REQUEST'
    condition: all of selection*
falsepositives: 
level: medium