title: OGNL Injection in JVM
id: 4d0af518-828e-4a04-a751-a7d03f3046ad
status: experimental
description: Detects potential OGNL Injection exploitation, which may lead to RCE. OGNL is an expression language that is supported in many JVM based systems. OGNL Injection is the reason for some high profile RCE's such as Apache Struts (CVE-2017-5638) and Confluence (CVE-2022-26134)
references: 
    - https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-5638
    - https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-26134
author: Moti Harmats
date: 2023/02/11
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: jvm
    definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR and above)'
detection:
    keywords:
        - org.apache.commons.ognl.OgnlException
        - ExpressionSyntaxException
    condition: keywords
falsepositives:
    - Application bugs
level: high
