title: Server Side Template Injection - Velocity
id: 16c86189-b556-4ee8-b4c7-7e350a195a4f
status: experimental
description: Detects exceptions in velocity template renderer, this most likely happens due to dynamic rendering of user input and may lead to RCE.
references: 
    - https://antgarsil.github.io/posts/velocity/
author: Moti Harmats
date: 2023/02/11
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: velocity
    definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR and above)'
detection:
    keywords:
        - ParseErrorException
        - VelocityException
        - TemplateInitException
    condition: keywords
falsepositives:
    - Application bugs or missing .vm files
level: high
