title: JNDI Injection in JVM
id: bb0e9cec-d4da-46f5-997f-22efc59f3dca
status: experimental
description: Detects potential JNDI Injection exploitation. Often coupled with Log4Shell exploitation.
references: 
    - https://www.shiftleft.io/blog/log4shell-jndi-injection-via-attackable-log4j/
author: Moti Harmats
date: 2023/02/11
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: JVM
    definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR and above)'
detection:
    keywords:
        - com.sun.jndi.ldap.
        - org.apache.logging.log4j.core.net.JndiManager
    condition: keywords
falsepositives:
    - Application bugs
level: high
