title: Local File Read in JVM
id: e032f5bc-4563-4096-ae3b-064bab588685
status: experimental
description: Detects potential local file read vulnerability in JVM based apps. If the exceptions are caused due to user input and contain path traversal payloads then it's a red flag.
references: 
author: Moti Harmats
date: 2023/02/11
modified: 2023/02/11
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: NodeJS
detection:
    selection:
        contains:
            - FileNotFoundException
            - /../../../
    condition: all of selection*
falsepositives:
    - Application bugs  
level: critical
