title: Process Execution Error in JVM
id: d65f37da-a26a-48f8-8159-3dde96680ad2
status: experimental
description: Detects process execution related exceptions in JVM based apps, often relates to RCE
references: 
author: Moti Harmats
date: 2023/02/11
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: JVM
    definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR and above)'
detection:
    keywords:
        - Cannot run program
        - java.lang.Runtime.exec
        - java.lang.UNIXProcess
        - java.lang.ProcessImpl
        - java.lang.ProcessBuilder
    condition: keywords
falsepositives:
    - Application bugs
level: high
