title: XXE in JVM
id: c4e06896-e27c-4583-95ac-91ce2279345d
status: experimental
description: Detects XML parsing issues, if the application expects to work with XML make sure that the parser is initialized safely.
references: 
    - Code examples for vulnerable & safe XML parser initialization - https://rules.sonarsource.com/java/RSPEC-2755
    - Explanation regarding XXE - https://owasp.org/www-community/vulnerabilities/XML_External_Entity_(XXE)_Processing
author: Moti Harmats
date: 2023/02/11
modified: 2023/02/11
tags:
    - attack.initial_access
    - attack.t1190
logsource:
    category: application
    product: JVM
detection:
    keywords:
        - SAXParseException
        - DOMException
    condition: keywords
falsepositives:
    - If the application expects to work with XML there may be parsing issues that don't neccecarily mean XXE. 
level: high
