title: Possible Advanced IP Scanner Download Attempt (via proxy)
status: stable
description: Adversaries may try to download advanced ip scanner tool in order to perfom enumeration.
references:
    - https://twitter.com/Famatech/status/540491342515044353
    - https://cert.gov.ua/article/2394117
tags:
    - attack.t1105
    - attack.command_and_control
author: SOC Prime Team
logsource:
    category: proxy
detection:
    selection:
        c-uri|contains|all:
            - 'advanced'
            - 'ip'
            - 'scanner'
            - 'download'
    condition: selection
falsepositives:
    - unknown
level: high
id: 8f11d9a7-3cf2-488f-9c72-3c23bfa676e3