title: CobaltStrike Execute-Assembly command detect
description: Cobalt Strike’s in-memory threat emulation and evasion capabilities, adds a means to run .NET executable assemblies without touching disk, and implements the Token Duplication UAC bypass attack. For CobaltStrike version 3.12-3.14 
references:
    - https://blog.cobaltstrike.com/2018/04/09/cobalt-strike-3-11-the-snake-that-eats-its-tail/
tags:
    - attack.defense_evasion
    - attack.t1055
status: experimental
author:  Aleksey Potapov, oscd.community
date: 2019/10/22
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 8
        TargetProcessAddress:
         - '*0B80'
         - '*0C7C'
         - '*0C88'
    condition: selection
falsepositives:
    - unknown
level: critical