    author: Sreeman
    description: HxTsr.exe is a Microsoft compressed executable file called "Microsoft Outlook Communications." It establishes and maintains contact between the Outlook 2013 or 2016 app from the Windows Store on the user's computer and Microsoft's Outlook.com, Outlook.office365.com, or Exchange e-mail and calendar websites. When attachments are downloaded from email, hxtsr.exe is creates the file on the user machine. These files may be from phishing activities. 
    detection:
       condition: selection
        selection:
            EventID: 11
            ActionType: FileCreated
            ParentProcessName matches regex: (?i)c:\\program files\\windowsapps\\microsoft\.windowscommunicationsapps_.*\\hxtsr\.exe
            FolderPath matches regex: "(?i).*\\users\\.*\\Appdata\\local\\packages\\microsoft.windowscommunicationsapps.*" 
     falsepositives:
    - legitimate files being downloaded from email messages
    level: medium
    logsource:
        product: windows
        service: sysmon
    status: experimental
    tags:
    - attack.initial.access
    - attack.t1566
    title: Detects malicious files being downloaded from Outlook due to phishing attempts via hxtsr.exe
    Reference: Personal observation from investigations