title: Silenttrinity Stager Msbuild Activity
id: c4f2d4b1-ca0f-42e4-9b7b-a69790524fab
description: Detects a possible remote connections to Silenttrinity c2
references:
    - https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
tags:
    - attack.t1127.001
    - attack.t1127
status: experimental
author: Kiran kumar s, oscd.community
date: 2020/10/11
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        EventID: 3
        ParentImage|endswith: '*\msbuild.exe'
    condition: selection
fields:
    - ParentImage
falsepositives:
    - unknown
level: high
