title: Silenttrinity Stager Msbuild Activity
description: Detects a possible remote connections to Silenttrinity c2
references:
    - https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
tags:
    - T1127.001
    - attack.defense_evasion
status: experimental
author: Kiran kumar s, oscd.community
date: 2020/10/11
logsource:
    category: sysmon
    product: windows
detection:
    selection:
        EventID: 3
        ParentImage|endswith: '*\msbuild.exe'
    condition: selection
fields: fields:
    - ParentImage
falsepositives:
    - unknown
level: high
