title: Silenttrinity Stager Communication To C2
description: Detects a possible remote connections to Silenttrinity c2
references:
    - https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
tags:
    - T1127.001
    - Tactic: Defense Evasion
status: experimental
author: Kiran kumar s
date: 11/10/2020
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 3
        ParentImage: '*\msbuild.exe'
    condition: selection
falsepositives:
    - unknown
level: high
