title: PowerShell Network Connections
status: experimental
description: Detetcs a Powershell process that opens network connections - check for suspicious target ports and target systems
author: Florian Roth
reference: https://www.youtube.com/watch?v=DLtJTxMWZ2o
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 3
        Image: '*\powershell.exe'
    condition: selection
falsepositives:
    - Administrative scripts
level: low

