title: Taskmgr as LOCAL_SYSTEM
status: experimental
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
author: Florian Roth
date: 2018/03/18
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        User: 'NT AUTHORITY\SYSTEM'
        Image: '*\taskmgr.exe'
    condition: selection
falsepositives:
    - Unkown
level: high
