title: Microsoft Office Persistence
status: experimental
description: Detect File Deletion Technique
author: Lep
references:
  - https://attack.mitre.org/techniques/T1107/
  - https://labs.mwrinfosecurity.com/blog/add-in-opportunities-for-office-persistence/
date: 2019/08/20
tags:
  - attack.defense_evasion
  - attack.t1107
  - attack.g0050
logsource:
  service: sysmon
  product: windows
detection:
  sdelete:
    Image: '*sdelete.exe'
    CommandLine_lc: '*remove-item*'
  fsulti:
    Image: '*fsutil.exe'
    CommandLine_lc: '*deletejournal*'
  wbadmin:
    Image: '*wbadmin.exe'
    CommandLine_lc: '*delete*'
  condition: sdelete or fsulti or wbadmin
falsepositives:
    - Uninstall programs,..
level: low
