title: MSHTA Spawning Windows Shell
status: experimental
description: Detects a Windows command line executable started from MSHTA.
reference: https://www.trustedsec.com/july-2015/malicious-htas/
author: Michael Haag
logsource:
    product: sysmon
detection:
    selection:
        EventID: 1
        ParentImage:
            - '*\mshta.exe'
        Image:
            - '*\cmd.exe'
            - '*\powershell.exe'
            - '*\wscript.exe'
            - '*\cscript.exe'
            - '*\sh.exe'
            - '*\bash.exe'
    condition: selection
falsepositives:
    - Minimal FPs.
level: high
