title: Suspicious Timestomp
description: Detects a suspicious execution of csc.exe, which uses a source in a suspicious folder (e.g. AppData)
status: experimental
references:
    - https://securityboulevard.com/2019/08/agent-tesla-evading-edr-by-removing-api-hooks/
    - https://app.any.run/tasks/c6993447-d1d8-414e-b856-675325e5aa09/
author: Florian Roth
date: 2019/08/24
tags:
    - attack.defense_evasion
    - attack.t1099
logsource:
    product: windows
detection:
    windows:
        CommandLine_lc:
            - '*Get-ChildItem*'
            - '*$_.LastAccessTime*'
            - '*$_.LastWriteTime*'
            - '*$_.CreationTime*'
    linux:
        CommandLine_lc: '*touch*'
    condition: linux or windows
falsepositives:
    - Unkown
level: high