title: DLL Execution via Rasautou.exe
id: cd3d1298-eb3b-476c-ac67-12847de55813
description: Detects using Rasautou.exe for loading arbitrary .DLL specified in -d option and executes the export specified in -p. 
status: experimental
references:
    - https://github.com/fireeye/DueDLLigence
    - https://www.fireeye.com/blog/threat-research/2019/10/staying-hidden-on-the-endpoint-evading-detection-with-shellcode.html
author: Julia Fomina, oscd.community
date: 2020/10/09
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    product: windows
    service: sysmon
    category: process_creation
detection:
    use_rasautou:
        Image|endswith: '\rasautou.exe'
    remaned_rasautou:
        OriginalFileName: 'rasdlui.exe'
    special_keys:
        CommandLine|contains|all: 
            - '-d'
            - '-p'
    condition: (use_rasautou or remaned_rasautou) and special_keys
level: medium
falsepositives:
    - Unlikely. Options '-d' and '-p' removed in Windows 10.
