title: Narrator's Feedback-Hub Persistence
description: Detects abusing Windows 10 Narrator's Feedback-Hub
references:
    - https://giuliocomi.blogspot.com/2019/10/abusing-windows-10-narrators-feedback.html
tags:
    - attack.persistence
author: Dmitriy Lifanov, oscd.community
status: experimental
date: 2019/10/25
logsource:
    product: windows
    service: sysmon
detection:
    condition: 1 of them
    # Registry Object Delete
    selection1:
        EventID: 12
        EventType: DeleteValue
        TargetObject: '*\AppXypsaf9f1qserqevf0sws76dx4k9a5206\Shell\open\command\DelegateExecute'
    # Registry Object Value Set
    selection2:
        EventID: 13
        TargetObject: '*\AppXypsaf9f1qserqevf0sws76dx4k9a5206\Shell\open\command\(Default)'
falsepositives:
    - unknown
level: high
