title: Modify Existing Service
description: Detect persistence technique by modifying existing services
author: Lep
date: 2019/08/17
tags:
    - attack.persistence
    - attack.t1031
    - attack.g0050
logsource:
    product: windows
    service: sysmon
detection:
    process_creation:
        EventID: 1
    sc:
        Image_lc:
            -'*\sc.exe'
        CommandLine_lc: '*config*'
    reg:
        Image_lc: 
            -'*\reg.exe'
        CommandLine_lc: '*hklm\system\currentcontrolset\services*'
    registry_edit:
        EventID: 13
        TargetObject: 'HKLM\SYSTEM\CurrentControlSet\Services*'
    condition: (process_creation and sc) or (process_creation and reg) or registry_edit
falsepositives:
    - Real service edit
level: low
