Windows 10 scheduled task SandboxEscaper 0-day 
status: experimental
description: Detects Task Scheduler .job import arbitrary DACL write\par
references:
   - https://github.com/SandboxEscaper/polarbearrepo/tree/master/bearlpe
author: Olaf Hartong
date: 2019/05/22
logsource:
    product: windows
    service: sysmon
detection:
   selection:
       EventID: 1
       Image: 'schtasks.exe'
       CommandLine: '*/change*/TN*/RU*'
   filter:
   condition: selection
falsepositives:
   - Unknown
tags:
    - attack.privilege_escalation
    - attack.execution
    - attack.t1053
level: high