title: Suspicious Execution from Outlook 
status: experimental
description: Detects EnableUnsafeClientMailRules used for Script Execution from Outlook
references:
    - https://github.com/sensepost/ruler
    - https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
author: Markus Neis
date: 2018/12/27
logsource:
    product: windows
    service: sysmon
detection:
    clientMailRules:
        EventID: 1
        CommandLine: '*EnableUnsafeClientMailRules*' # EnableUnsafeClientMailRules used for Script Execution from Outlook
    outlookExec:
        EventID: 1
        ParentImage: '*\outlook.exe'
        CommandLine: '\\\\*\\*.exe'  # UNC Path required for Execution 

    condition: clientMailRules OR outlookExec
falsepositives:
    - unknown
level: high
