title: Control Panel Items
status: stable
description: Control Panel Items T1196
reference: https://attack.mitre.org/techniques/T1196/
tags: 
  - attack.execution
  - attack.t1196
  - attack.defense_evation
author: Kyaw Min Thein
date: 2019/08/27
level: critical
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    CommandLine:
      - '*.cpl'
  filter:
    CommandLine:
      - '*\System32\*'
  condition: selection and not filter
falsepositives:
  - No
