title: RedMimicry Winnti Playbook Inject
id: 51c1c141-efef-4686-88d6-50b8da6d5562
description: Detects actions caused by the RedMimicry Winnti playbook
references:
    - https://redmimicry.com
author: Alexander Rausch
date: 2020/06/24
tags:
    - attack.defense_evasion
    - attack.t1055
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 8
        SourceImage|contains: rundll32.exe
        TargetImage|contains: svchost.exe
    condition: selection
falsepositives:
    - Unknown
level: high
