title: Raw disk access using illegitimate tools
description: Raw disk access using illegitimate tools, possible defence evasion
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
tags:
    - attack.defense_evasion
    - attack.t1006
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 9
    filter_1:
        Device|contains: floppy
    filter_2:
        Image:
            - '*\wmiprvse.exe'
            - '*\sdiagnhost.exe'
            - '*\searchindexer.exe'
            - '*\csrss.exe'
            - '*\defrag.exe'
            - '*\smss.exe'
            - "*system*"
            - '*\vssvc.exe'
            - '*\compattelrunner.exe'
            - '*\wininit.exe'
            - '*\autochk.exe'
            - '*\taskhost.exe'
            - '*\dfsrs.exe'
            - '*\vds.exe'
            - '*\lsass.exe'
    condition: selection and not filter_1 and not filter_2
falsepositives:
    - Legitimate Administrator using tool for raw access or ongoing forensic investigation
level: medium
status: experimental
