title: Exploit for CVE-2017-0261
description: Detects Winword starting uncommon sub process FLTLDR.exe as used in exploits for CVE-2017-0261 and CVE-2017-0262 
references:
  - https://www.fireeye.com/blog/threat-research/2017/05/eps-processing-zero-days.html
author: Florian Roth
date: 2018/02/22
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        ParentImage: '*\WINWORD.EXE'
        Image: '*\FLTLDR.exe*'
    condition: selection
falsepositives:
    - Unknown
level: critical
