title: MSHTA spwaned by SVCHOST as seen in LethalHTA 
status: experimental
description: Detects MSHTA.EXE spwaned by SVCHOST described in report
references:
    - https://codewhitesec.blogspot.com/2018/07/lethalhta.html
author: Markus Neis
date: 2018/06/07
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        ParentImage: '*\svchost.exe'
        Image: '*\mshta.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
