title: T1086 PowerShell Execution
id: d32b53ce-2a41-4db0-a42a-fb574d819d97
description: Detects execution of PowerShell
status: experimental
date: 2019/09/12
modified: 2019/11/10
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/basic_powershell_execution.md
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 17
        PipeName|startswith: '\PSHost'
    condition: selection
falsepositives:
    - Unknown
level: critical