title: Suspicious RUN Key Creation
status: experimental
description: Detects the creation of suspicious RUN keys
references:
    - https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/
author: Florian Roth
date: 2019/10/01
tags:
    - attack.persistence
    - attack.t1060
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 13
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\\*'
        Details: 
            - '%Public%\\*'
            - 'C:\Users\Public\\*'
            - 'wscript*'
            - 'cscript*'
    condition: selection
falsepositives:
    - Likely but software developers should be ashamed
level: high