title: Sysmon Process Hollowing Detection
id: c4b890e5-8d8c-4496-8c66-c805753817cd
status: experimental
description: Detects when a memory process image does not match the disk image, indicative of process hollowing.
author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Sittikorn S
date: 2022/01/25
modified: 2022/02/01
references:
  - https://twitter.com/SecurePeacock/status/1486054048390332423?s=20 
  - https://www.bleepingcomputer.com/news/microsoft/microsoft-sysmon-now-detects-malware-process-tampering-attempts/
tags:
    - attack.process_injection
    - attack.t1055.012
logsource:
    product: windows
    category: process_tampering
detection:
    selection:
        Type: Image is replaced
    filters:
        Image|contains: 
            - ':\Program Files\'
            - ':\Program Files (x86)'
        Image|endswith:
            - '\chrome.exe'
            - '\opera.exe'
            - '\firefox.exe'
            - '\MicrosoftEdge.exe'
    condition: selection and not filters
falsepositives:
    - There are no known false positives at this time
level: high
