title: XSL Script Processing
status: experimental
description: Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files, rule detects when adversaries abuse this functionality to execute arbitrary files while potentially bypassing application whitelisting defenses
author: Timur Zinniatullin, oscd.community
references:
    - https://attack.mitre.org/techniques/T1220/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1220/T1220.yaml
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        EventID: 1
        ParentImage:
          - '*\wmic.exe'
        ParentCommandLine:
          - '*/FORMAT*' # wmic process list /FORMAT /?
    selection2:
        EventID: 1
        Image:
          - '*\msxsl.exe*'
    condition:
        selection1 or selection2
falsepositives:
    - WMIC.exe FP depend on scripts and administrative methods used in the monitored environment
    - msxsl.exe is not installed by default so unlikely.
level: medium
tags:
    - attack.persistence
    - attack.t1220
