title: File Permissions Modification
status: experimental
description: Detect File Permissions modification
author: Lep
references:
  - https://attack.mitre.org/techniques/T1222/  
date: 2019/08/21
tags:
  - attack.defense_evasion
  - attack.t1222
  - attack.g0050
logsource:
  service: sysmon
  product: windows
detection:
  window:
    - Image_lc: 
      - '*cacls.exe'
      - '*takeown.exe'
      - '*icacls.exe'
      - '*attrib.exe'
    - CommandLine_lc: '*Set-Acl*'
# Use for unix, change log sources
  unix:
    CommandLine_lc:
      - '*chmod*'
      - '*chowm*'  
      - '*chattr*'
  condition: window or unix
falsepositives:
    - Uninstall programs,..
level: low
