title: RDP Session Hijacking
status: experimental
description: Detects RDP Session Hijacking on Windows systems
reference: https://twitter.com/Moti_B/status/909449115477659651
author: juju4
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image: 'tscon.exe'
        IntegrityLevel: 'SYSTEM'
    condition: selection
fields:
    - Image
    - IntegrityLevel
falsepositives:
    - Penetration tests
    - Administrative activity
level: medium
