title: vssadmin delete shadow copies
status: experimental
description: Detects malicious usage of vssadmin deleting volume shadows
reference: https://securingtomorrow.mcafee.com/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
author: Michael Haag
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image:
            - '*\vssadmin.exe'
        CommandLine:
            - 'Delete Shadows /All /Quiet'
    condition: selection
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
