title: Service Creation in Registry Detection
description: Detect Service Creation in Registry
author: Lep
date: 2019/08/16
tags:
    - attack.execution
    - attack.t1035
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 13
        Image_lc: '*\services.exe'
    condition: selection
falsepositives:
    - n/a
level: low
