title: T1086 Non Interactive PowerShell Execution
description: Detects execution of PowerShell with not explorer.exe as a parent.
status: experimental
date: 2019/09/12
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/basic_powershell_execution.md
logsource:
    product: windows
    service: sysmon
detection:
    selection: 
        EventID: 1
        Image: '*\powershell.exe'
    filter:
        ParentImage: '*\explorer.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: critical