title: T1086 Remote PowerShell Session
description: Detects remote PowerShell seccions by monitoring for wsmprovhost as a parent or child process (sign of an active ps remote sessionn)
status: experimental
date: 2019/09/12
modified: 2019/11/10
author: Roberto Rodriguez @Cyb3rWard0g
references:
    - https://github.com/Cyb3rWard0g/ThreatHunter-Playbook/tree/master/playbooks/windows/02_execution/T1086_powershell/powershell_remote_session.md
logsource:
    product: windows
    service: sysmon
detection:
    selection_1: 
        EventID: 1
        Image|endswith: '\wsmprovhost.exe'
    selection_2:
        EventID: 1
        ParentImage|endswith: '\wsmprovhost.exe'
    condition: selection_1 or selection_2
falsepositives:
    - Unknown
level: critical