title: UAC Bypass via Event Viewer
status: experimental
description: Detects UAC bypass method using Windows event viewer
reference: 
    - https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
    - https://www.hybrid-analysis.com/sample/406c3d9277e69011abe7c02214aa205a466696d656ab3cdeaa9235cdc1826018
author: Florian Roth
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        ParentImage: '*\eventvwr.exe'
        Image: '*\mmc.exe'
    condition: selection
falsepositives:
    - unknown
level: high
