title: Suspicious AdFind Execution
status: Experimental
description: Detects the execution of a AdFind for Active Directory enumeration
references:
    - https://center-for-threat-informed-defense.github.io/summiting-the-pyramid/analytics/adfind/
    - https://learn.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-createprocessa
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90001
    - https://github.com/SigmaHQ/sigma/blob/30bee7204cc1b98a47635ed8e52f44fdf776c602/rules/windows/process_creation/win_susp_adfind.yml
author: Center for Threat Informed Defense (CTID) Summiting the Pyramid Team
date: 2023/08/30
tags:
    - attack.discovery
    - attack.t1018
    - attack.t1087.002
    - attack.t1482
    - attack.t1069.002
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        EventID: 
            - 1
        CommandLine|contains:
            - ‘objectcategory’
            - ‘trustdmp’
            - ‘dcmodes’
            - ‘dclist’
            - ‘computers_pwdnotreqd’
        OriginalFileName|endswith: 
            - ‘\adfind.exe’
    condition: selection
falsepositives:
    - Administrative activity
level: medium