title: Logon Scripts (UserInitMprLogonScript)
status: experimental
description: Detects creation or execution of UserInitMprLogonScript persistence method
references:
    - https://attack.mitre.org/techniques/T1037/
tags:
    - attack.t1037
    - attack.persistence
    - attack.lateral_movement
author: Tom Ueltschi (@c_APT_ure)
logsource:
    product: windows
    service: sysmon
detection:
    exec_selection:
        EventID: 1 # Migration to process_creation requires multipart YAML
        ParentImage: '*\userinit.exe'
    exec_exclusion:
        Image: '*\explorer.exe'
        CommandLine: '*\netlogon.bat'
    create_selection_cli:
        EventID:
            - 1
    create_selection_reg:
        EventID:
            - 11
            - 12
            - 13
            - 14
    create_keywords_reg:
        TargetObject:
            - '*UserInitMprLogonScript*'
    create_keywords_cli:
        CommandLine:
            - '*UserInitMprLogonScript*'
    condition: (exec_selection and not exec_exclusion) or (create_selection_reg and create_keywords_reg) or (create_selection_cli and create_keywords_cli)
falsepositives:
    - exclude legitimate logon scripts
    - penetration tests, red teaming
level: high
