title: DNS HybridConnectionManager Service Bus
id: 7bd3902d-8b8b-4dd4-838a-c6862d40150d
description: Detects Azure Hybrid Connection Manager services querying the Azure service bus service
status: experimental
date: 2021/04/12
modified: 2021/06/10
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.persistence
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
logsource:
    product: windows
    category: dns_query
detection:
    selection:
        QueryName|contains: servicebus.windows.net
        Image|contains: HybridConnectionManager
    condition: selection
falsepositives:
    - Legitimate use of Azure Hybrid Connection Manager and the Azure Service Bus service
level: high
