title: Suspicious Timestomp
description: Detects a massive change timestamp
status: experimental
author: lep
date: 2019/08/24
tags:
    - attack.defense_evasion
    - attack.t1099
logsource:
    product: windows
detection:
    windows:
        CommandLine:
            - '*Get-ChildItem*'
            - '*$_.LastAccessTime*'
            - '*$_.LastWriteTime*'
            - '*$_.CreationTime*'
    linux:
        CommandLine: '*touch*'
    condition: linux or windows
falsepositives:
    - Unkown
level: high
