---
action: global
title: Modify Existing Service
description: Detect persistence technique by modifying existing services
author: Lep
date: 2019/08/17
tags:
  - attack.persistence
  - attack.t1031
  - attack.g0050
logsource:
  category: process_creation
  product: windows
detection:
    sc:
        Image:
            -'*\sc.exe'
        CommandLine: '*config*'
    reg:
        Image: 
            -'*\reg.exe'
        CommandLine: '*hklm\system\currentcontrolset\services*'
    condition: 1 of them
---
detection:
    registry_edit:
        EventID: 12
        TargetObject: 'HKLM\SYSTEM\CurrentControlSet\Services*'
falsepositives:
    - Real service edit
level: low
