title: Disable security events logging adding reg key MiniNt
status: experimental
description: Detects the addition of a key 'MiniNt' to the registry. Upon a reboot, Windows Event Log service will stopped write events.
references:
    - https://twitter.com/0gtweet/status/1182516740955226112
tags:
    - attack.defense_evasion
    - attack.t1089
author: Ilyas Ochkov, oscd.community
date:  2019/10/25
detection:
    condition: 1 of them
fields:
    - EventID
    - Image
    - TargetObject
    - NewName
falsepositives:
    - Unkown
level: high
---
logsource:
    product: windows
    service: sysmon
detection:
    key_create:
        EventID: 12
        TargetObject: 
            - '*\SYSTEM\*\Control\MiniNt'
---
logsource:
    product: windows
    service: sysmon
detection:
    key_rename:
        EventID: 14
        NewName: 
            - '*\SYSTEM\*\Control\MiniNt'
