action: global
title: Pingback Backdoor
id: 2bd63d53-84d4-4210-80ff-bf0658f1bf78
status: experimental
description: Detects the use of Pingback backdoor that creates ICMP tunnel for C2 as described in the trustwave report
author: Bhabesh Raj
date: 2021/05/05
falsepositives:
    - Very unlikely
level: high
references:
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel
    - https://app.any.run/tasks/4a54c651-b70b-4b72-84d7-f34d301d6406
tags:
    - attack.persistence
    - attack.t1574.001
---
logsource:
    product: windows
    category: file_event
detection:
    selection: 
        Image|endswith: updata.exe
        TargetFilename: 'C:\Windows\oci.dll'
    condition: selection
---
logsource:
    product: windows
    category: image_load
detection:
    selection:
        Image|endswith: 'msdtc.exe'
        ImageLoaded: 'C:\Windows\oci.dll'
    condition: selection
---
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        ParentImage|endswith: 'updata.exe'
        CommandLine|contains|all:
            - 'config'
            - 'msdtc'
            - 'start'
            - 'auto'
    condition: selection
