title: Usage of Sysinternals Tools 
status: experimental
description: Detects the usage of Sysinternals Tools due to accepteula key beeing added to Registry 
references:
    - https://twitter.com/Moti_B/status/1008587936735035392
date: 2017/08/28
author: Markus Neis
logsource:
    product: windows
    service: sysmon
detection:
    selection1:
        EventID: 13
        TargetObject: '*\EulaAccepted'
    selection2:
        EventID: 1
        CommandLine: '* -accepteula*'
    condition: selection1 or selection2
falsepositives:
    - Legitimate use of SysInternals tools
    - Programs that use the same Registry Key
level: low

