---
action: global
title: Executables Started in Suspicious Folder
status: experimental
description: Detects process starts of binaries from a suspicious folder
author: Florian Roth
date: 2017/10/14
modfied: 2019/02/21
references:
    - https://github.com/mbevilacqua/appcompatprocessor/blob/master/AppCompatSearch.txt
    - https://www.secureworks.com/research/bronze-butler-targets-japanese-businesses
    - https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/
falsepositives:
    - Unknown
level: high
detection:
    condition: selection
---
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image:
            - 'C:\PerfLogs\\*'
            - 'C:\$Recycle.bin\\*'
            - 'C:\Intel\Logs\\*'
            - 'C:\Users\Default\\*'
            - 'C:\Users\Public\\*'
            - 'C:\Users\NetworkService\\*'
            - 'C:\Windows\Fonts\\*'
            - 'C:\Windows\Debug\\*'
            - 'C:\Windows\Media\\*'
            - 'C:\Windows\Help\\*'
            - 'C:\Windows\addins\\*'
            - 'C:\Windows\repair\\*'
            - 'C:\Windows\security\\*'
            - '*\RSA\MachineKeys\\*'
            - 'C:\Windows\system32\config\systemprofile\\*'
---
logsource:
    product: windows
    service: security
    description: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection:
        EventID: 4688
        NewProcessName:
            - 'C:\PerfLogs\\*'
            - 'C:\$Recycle.bin\\*'
            - 'C:\Intel\Logs\\*'
            - 'C:\Users\Default\\*'
            - 'C:\Users\Public\\*'
            - 'C:\Users\NetworkService\\*'
            - 'C:\Windows\Fonts\\*'
            - 'C:\Windows\Debug\\*'
            - 'C:\Windows\Media\\*'
            - 'C:\Windows\Help\\*'
            - 'C:\Windows\addins\\*'
            - 'C:\Windows\repair\\*'
            - 'C:\Windows\security\\*'
            - '*\RSA\MachineKeys\\*'
            - 'C:\Windows\system32\config\systemprofile\\*' 


