title: Certutil Decode in AppData
status: experimental
description: Detetcs a Microsoft certutil execution with the 'decode' sub command on files in the AppData folder, which is sometimes used to decode malicious code with the built-in certutil utility
author: Florian Roth
reference: https://twitter.com/JohnLaTwC/status/835149808817991680
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        Image: '*\certutil.exe'
        CommandLine: '* -decode *\AppData\*'
    condition: selection
falsepositives:
    - unknown
level: high


