title: Suspicious WMI persistence
status: experimental
description: Detects WMI persistence
reference: 
    - https://rawsec.lu/blog/posts/2017/Sep/19/sysmon-v610-vs-wmi-persistence/
author: '@0xrawsec, juju4'
tags:
    - attack.execution
    - attack.t1047
falsepositives:
    - Will need to be tuned
level: medium
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID:
            - 19
            - 20
            - 21
    condition: selection
