title: "suspicious use of findstr"
id: e11fc78e-8aab-4dfc-8998-cd9678a4f1fc
description: "potentially malicious use of findstr from commandLine - LOLBAS windows"
author: "pooch11"
status: "experimental"
references:
 - https://lolbas-project.github.io/lolbas/Binaries/Findstr/
 - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
date: 2021/09/13
tags:
 - attack.lateral_movement
 - attack.defense_evasion
logsource:
 product: "windows"
 category: "process_creation"
detection:
 fromcmdline:
  parentImage|endswith:
   cmd.exe
 findcommand:
  commandLine|contains|all:
   - findstr
   - /V
   - /L
 findcommand_pwd:
  commandLine|contains|all:
   - findstr
   - /S
   - /I
 findtarget:
  commandLine|contains:
   - *.dll
   - *.exe
   - *.xml 
 condition: findtarget and fromcmdline and (findcommand or findcommand_pwd)
fields:
 - "CommandLine"
 - "ParentImage"
 - "User"
falsepositives:
 - "rare cases from power users or admins"
level: "high"
