title: Detect AS-REP Roasting via Kerberos TGT Requests
id: 3e2f1b2c-4d5e-11ee-be56-0242ac120002
status: experimental
description: Detects potential AS-REP Roasting attacks by identifying Kerberos TGT requests (Event ID 4768) with pre-authentication disabled (Pre-Authentication Type = 0) and RC4-HMAC encryption (Ticket Encryption Type = 0x17).
references:
  - https://medium.com/system-weakness/detecting-as-rep-roasting-attacks-b5b3965f9714
  - https://www.picussecurity.com/resource/blog/as-rep-roasting-attack-explained-mitre-attack-t1558-004
author: ANosir
date: 2025-05-22
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4768
    TicketEncryptionType: '0x17'
  condition: selection
falsepositives:
  - Legacy systems or applications that legitimately use RC4 encryption
  - Misconfigured accounts with pre-authentication disabled
level: high
tags:
  - attack.credential_access
  - attack.t1558.004
