title: Security Or System Event Log Cleared
id: 66afe85e-6b57-415c-9b10-7f409884d83e
related:
- id: 100ef69e-3327-481c-8e5c-6d80d9507556
  type: similar
- id: a62b37e0-45d3-48d9-a517-90c1a1b0186b
  type: similar
- id: d99b79d2-0a6f-4f46-ad8b-260b6e17f982
  type: similar
status: experimental
description: Detects clearing of the Windows Security or System event logs. Log clearing is often used to hide attacker activity
  and should be rare outside administrator maintenance.
references:
- https://attack.mitre.org/techniques/T1070/001/
author: David Sarkisyan
date: 2026/05/31
tags:
- attack.defense-impairment
- attack.t1685.005
logsource:
  product: windows
detection:
  selection_security:
    EventID: 1102
    Channel: Security
  selection_system:
    EventID: 104
    Channel: System
  condition: 1 of selection_*
falsepositives:
- Administrator troubleshooting or log maintenance
- Automated log rotation workflows in lab or kiosk systems
- System image preparation or reset procedures
level: high
