title: LSA User With Admin Group SID
id: 7ac407cc-0f48-4328-aede-de1d2e6fef41
status: experimental
description: Detect login of a normal user with a admin group SID
references:
    - https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-identifiers
    - https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
    - https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWProvidersManifests/Windows11/22H2/W11_22H2_Pro_20221220_22621.963/WEPExplorer/LsaSrv.xml
author: frack113
date: 2023/01/13
tags:
    - attack.credential_access
    - attack.privilege_escalation
logsource:
    product: windows
    service: lsa-server
    definition: 'Requirements: Microsoft-Windows-LSA/Operational ({199FE037-2B82-40A9-82AC-E1D46C792B99}) Event Log must be collected in order to receive the events.'
detection:
    selection:
        EventID: 300 
        TargetUserSid|startswith: 'S-1-5-21-' # normal user
        SidList|contains:
            - 'S-1-5-32-544'    # Local admin
            - '-500}'           # doamin admin
            - '-518}'           # Shema admin
            - '-519}'           # enterprise admin
    filter_admin:
        TargetUserSid|endswith:
            - '-500'           # domain admin
            - '-518'           # Shema admin
            - '-519'           # enterprise admin
    condition: selection and not filter_admin
falsepositives:
    - Unknown
level: high
