title: Powershell
id: 960116ac-d502-47fd-a493-c21e49228d3e
status: experimental
description: Macro for detecting cmd.exe
author: Tareq M. AlKhatib
date: 2021/12/27
# A definition that fits most log sources
logsource:
  category: generic
  product: generic
detection:
  ImageName:
    Image|endswith:
      - '\cmd.exe'
  condition: ImageName
---
logsource:
  category: process_creation
  product: windows
detection:
  OrgFileName:
    OriginalFileName:
      - "Cmd.exe"
  ImageName:
    Image|endswith:
      - '\cmd.exe'
  condition: OrgFileName or ImageName
