title: Powershell
id: adee5595-6839-4fb8-ae7a-2a0809383b99
status: experimental
description: Macro for detecting Powershell
author: Tareq M. AlKhatib
date: 2021/12/27
# A definition that fits most log sources
logsource:
  category: generic
  product: generic
detection:
  ImageName:
    Image|endswith:
      - '\powershell.exe'
  condition: ImageName
---
logsource:
  category: process_creation
  product: windows
detection:
  OrgFileName:
    OriginalFileName:
      - "powershell.exe"
  ImageName:
    Image|endswith:
      - '\powershell.exe'
  condition: OrgFileName or ImageName
