title: Show Commands Input
status: experimental
description: See what commands are being input into the device by other people, full credentials can be in the history
references:
    - https://attack.mitre.org/techniques/T1056/
    - https://attack.mitre.org/techniques/T1139/
author: Austin Clark
date: 2019/08/11
tags:
    - attack.collection
    - attack.credential_access
    - attack.t1139
    - attack.t1056
logsource:
    product: cisco
    service: aaa
    category: accounting
fields:
    - CmdSet
detection:
    keywords:
        - 'show history'
        - 'show history all'
        - 'show logging'
    condition: keywords
falsepositives:
    - Not commonly run by administrators, especially if remote logging is configured.
level: medium