title: Query to Ammyy Remote Access Software Domain
id: 71ba22cb-8a01-42e2-a6dd-5bf9b547498f
status: experimental
description: |
  An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
  These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land) 
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1219/T1219.md#atomic-test-6---ammyy-admin-software-execution
author: frack113
date: 2022/04/04
logsource:
    product: windows
    category: dns_query
detection:
    selection:
        QueryName|endswith: '.ammyy.com'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.command_and_control
    - attack.t1219