title: DNS Query To MEGA Hosting Website - Sysmon
id: 7baf868f-6fe9-42f8-ae4a-32baa38d9673
related:
    - id: 613c03ba-0779-4a53-8a1f-47f914a4ded3
      type: similar
    - id: 66474410-b883-415f-9f8d-75345a0a66a6
      type: similar
status: test
description: Detects DNS queries for subdomains related to MEGA sharing website
references:
    - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
author: '@d4ns4n_ (Wuerth-Phoenix)'
date: 2024/04/03
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    category: dns_query
    service: sysmon
    definition: 'Requirements: Sysmon must be installed and Microsoft-Windows-Sysmon/Operational Event Log must be enabled/collected in order to receive the events.'
detection:
    selection:
        EventID: 22
        QueryName|contains: 'userstorage.mega.co.nz'
    condition: selection
falsepositives:
    - Legitimate DNS queries and usage of Mega
level: medium
