title: DNS Query for anonfiles.com Upload Domain
id: 065cceea-77ec-4030-9052-fc0affea7110
description: Detects DNS queries for subdomains used for upload to anonfiles.com
status: experimental
date: 2022/07/15
author: pH-T
references:
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
tags:
    - attack.exfiltration
    - attack.t1567.002
falsepositives:
    - Legitimate anonfiles.com upload
level: high
logsource:
    product: windows
    category: dns_query
detection:
    selection:
        QueryName|contains: .anonfiles.com
    condition: selection