title: DNS Query for Ufile.io Upload Domain
id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
status: experimental
description: Detects DNS queries for subdomains used for upload to ufile.io
references:
    - https://thedfirreport.com/2021/12/13/diavol-ransomware/
author: yatinwad and TheDFIRReport
date: 2022/06/23
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    category: dns_query
detection:
    selection:
        QueryName|contains: ufile.io
    condition: selection
falsepositives:
    - Legitimate Ufile upload
level: high
