title: DNS Query to Ligolo-ng WebUI Domain
id: 2a4f57b2-3c8e-4d91-a6f4-8b7e1c9d0f3a
status: experimental
description: |
    Detects DNS queries to the Ligolo-ng WebUI domain, which may indicate the use of the Ligolo-ng tunneling tool's web interface for managing reverse tunnels.
    This might indicate potential command-and-control activity or unauthorized use of the Ligolo-ng tool within the network, as the WebUI is commonly used for controlling and monitoring tunnels established by Ligolo-ng.
    Threat actors may leverage Ligolo-ng for network pivoting and lateral movement, and DNS queries to its WebUI domain could be a sign of such activity.
references:
    - https://docs.ligolo-ng.io/
    - https://github.com/nicocha30/ligolo-ng
author: MAB, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2026-02-19
tags:
    - attack.command-and-control
    - attack.t1572
    - attack.t1090
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName: 'webui.ligolo.ng'
    condition: selection
falsepositives:
    - Legitimate use of Ligolo-ng for remote management; should be rare in enterprise environments
level: high
