title: DNS Query for Anonfiles.com Domain
id: 065cceea-77ec-4030-9052-fc0affea7110
description: Detects DNS queries for anonfiles.com, which is an anonymous file upload platform often used for malicious purposes
status: experimental
date: 2022/07/15
author: pH-T
references:
    - https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    category: dns_query
detection:
    selection:
        QueryName|contains: .anonfiles.com
    condition: selection
falsepositives:
    - Legitimate access to anonfiles.com
level: high
