title: Suspicious Ldap Domain Access
id: a21bcd7e-38ec-49ad-b69a-9ea17e69509e
description: Detect suspicious ldap request from non Windows application
status: experimental
date: 2022/08/20
modified: 2022/09/08
author: frack113
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
logsource:
    product: windows
    category: dns_query
detection:
    dns_request:
        QueryName|startswith: '_ldap.'
    filter_windows:
        Image|startswith: 'C:\Windows\'
    filter_defender:
        Image|startswith: 'C:\ProgramData\Microsoft\Windows Defender\Platform\'
        Image|endswith: '\MsMpEng.exe'
    filter_unknown:
        Image: '<unknown process>'
    condition: dns_request and not 1 of filter_*
falsepositives:
    - Programs that also lookup the observed domain
level: medium
tags:
    - attack.discovery
    - attack.t1482
