title: Suspicious DNS Query To Visual Studio Code Tunnel
id: ef343956-5e9b-4507-a90c-3d0c3190c4de
status: experimental
description: Detects Visual Studio Code tunnel that can be used as a reverse shell 
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
    - https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/security
tags:
    - attack.command_and_control
    - attack.t1071.001
author: ipfyx (blog post),citron_ninja (rule)
date: 2023/09/28
logsource:                      
    category: dns_query  
    product: windows            
detection:
    selection:
        QueryName|endswith: 
            - '.tunnels.api.visualstudio.com'
            - '.devtunnels.ms'
    condition: selection
falsepositives:
    - legitimate use of Visual Studio Code tunnel
level: medium
