title: DNS Query To Devtunnels Or VsCode Tunnels
id: b3e6418f-7c7a-4fad-993a-93b65027a9f1
related:
    - id: 9501f8e6-8e3d-48fc-a8a6-1089dd5d7ef4
      type: similar
status: experimental
description: |
    Detects DNS query to Devtunnels and Visual Studio Code tunnel domains. Attackers can be abuse these features to establish a reverse shell.
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
    - https://blueteamops.medium.com/detecting-dev-tunnels-16f0994dc3e2
    - https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/security
author: citron_ninja
date: 2023/10/25
modified: 2023/11/20
tags:
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|endswith:
            - '.tunnels.api.visualstudio.com'
            - '.devtunnels.ms'
    condition: selection
falsepositives:
    - Legitimate use of Visual Studio Code tunnel will also trigger this
level: medium
