title: Suspicious Non-Browser Network Communication With Reddit API - DNS
id: 47e939f5-a4c1-4467-b8ae-242dd0a195c1
related:
    - id: d7b09985-95a3-44be-8450-b6eadf49833e # Using Sysmon
      type: similar
status: experimental
description: Detects an a non-browser process interacting with the Reddit API which could indicate use of a covert C2 such as RedditC2
references:
    - https://github.com/kleiton0x00/RedditC2
    - https://twitter.com/kleiton0x7e/status/1600567316810551296
    - https://www.linkedin.com/posts/kleiton-kurti_github-kleiton0x00redditc2-abusing-reddit-activity-7009939662462984192-5DbI/?originalSubdomain=al
author: Gavin Knapp
date: 2023/02/16
tags:
    - attack.command_and_control
    - attack.t1102
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationHostname|contains: 'reddit.com/api'
    filter:
        Image|endswith:
            # Other browsers or apps known to use reddit should be added
            - '\brave.exe'
            - '\chrome.exe'
            - '\ExpressConnectNetworkService.exe'
            - '\firefox.exe'
            - '\iexplorer.exe'
            - '\maxthon.exe'
            - '\msedge.exe'
            - '\opera.exe'
            - '\safari.exe'
            - '\seamonkey.exe'
            - '\vivaldi.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate applications communicating with the Reddit API e.g. web browsers not in exclusion list, app with an RSS  etc.
level: low
