title: Python SQL Exceptions
description: Generic rule for SQL exceptions in Python according to PEP 249
author: Thomas Patzke
references:
    - https://www.python.org/dev/peps/pep-0249/#exceptions
logsource:
    category: application
    product: python
detection:
    exceptions:
        - DataError
        - IntegrityError
        - ProgrammingError
        - OperationalError
    condition: exceptions
falsepositives:
    - Application bugs
    - Penetration testing
level: medium

