title: Apache Segmentation Fault
id: 1da8ce0b-855d-4004-8860-7d64d42063b1
status: test
description: Detects a segmentation fault error message caused by a creashing apache worker process
references:
    - http://www.securityfocus.com/infocus/1633
author: Florian Roth
date: 2017/02/28
modified: 2023/01/07
tags:
    - attack.impact
    - attack.t1499.004
logsource:
    product: apache
    service: errorlog
detection:
    keywords:
        - 'exit signal Segmentation Fault'
    condition: keywords
falsepositives:
    - Unknown
level: high
