title: Remove immutable file attribute
description: Detects removing immutable file attribute
status: experimental
tags:
    - attack.defense_evasion
    - attack.t1222
author: Jakob Weinzettl, oscd.community
date: 2019/09/23
logsource:
    product: linux
detection:
    selection1:
        - 'chattr'
    selection2:
        - '-i'
    condition: selection1 and selection2
falsepositives:
    - Administrator interracting with immutable files (for instance backups)
level: medium
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222/T1222.yaml
