title: Systemd Service Reload or Start
id: 2625cc59-0634-40d0-821e-cb67382a3dd7
description: Detects a reload or a start of a service
status: experimental
tags:
    - attack.persistence
    - attack.t1501
    - attack.t1543.002
author: Jakob Weinzettl, oscd.community
date: 2019/09/23
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
        a0|contains: 'systemctl'
        a1|contains:
            - 'daemon-reload'
            - 'start'
    condition: selection
falsepositives:
    - Installation of legitimate service
    - Legitimate reconfiguration of service
level: low
references:
    - https://attack.mitre.org/techniques/T1501/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1501/T1501.yaml
