title: Remote File Copy
id: 7a14080d-a048-4de8-ae58-604ce58a795b
description: Detects using remote file copy tools
references:
    - https://attack.mitre.org/techniques/T1105/
author: Ömer Günal
date: 2020/06/18
tags:
    - attack.command_and_control
    - attack.lateral_movement
    - attack.t1105
level: low
logsource:
    product: linux
detection:
    keywords:
        - Scp|contains:
          - 'scp * *@*:*'
          - 'scp *@*:* *'
        - Rsync|contains:
          - 'rsync -r *@*:* *'
          - 'rsync -r * *@*:*'
        - Sftp|contains:
          - 'sftp *@*:* *'
          - 'sftp *@*:* *'
    condition: keywords
falsepositives:
    - Legitimate administration activities
