title: Local System Accounts Discovery
id: b45e3d6f-42c6-47d8-a478-df6bd6cf534c
status: experimental
description: Detects enumeration of local systeam accounts
author: Alejandro Ortuno, oscd.community
date: 2020/10/08
references:
  - https://attack.mitre.org/techniques/T1087/001/
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1087.001/T1087.001.md
logsource:
  product: linux
detection:
  selection:
    CommandLine|contains:
      - 'lastlog'
  condition: selection
falsepositives:
  - Legitimate administration activities
level: low
tags:
  - attack.discovery
  - attack.t1087.001
