title: Process Discovery
id: 4e2f5868-08d4-413d-899f-dc2f1508627b
status: stable
description: Detects process discovery commands
author: Ömer Günal, oscd.community
date: 2020/10/06
references:
    - https://attack.mitre.org/techniques/T1057/
logsource:
    product: linux
detection:
    selection:
        - CommandLine|contains:
          - 'ps '
          - 'top'
    condition: selection
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
    - attack.t1057
