title: Overwriting the File with Dev Zero or Null
id: 37222991-11e9-4b6d-8bdf-60fbe48f753e
date: 2019/10/23
description: Detects overwriting (effectively wiping/deleting) the file
author: Jakob Weinzettl, oscd.community
tags:
    - attack.impact
    - attack.t1485
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
        a0|contains: 'dd'   
        a1|contains:
            - 'if=/dev/null'    
            - 'if=/dev/zero'    
    condition: selection
falsepositives:
    - Appending null bytes to files
    - Legitimate overwrite of files
level: low
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.yaml
