title: Guacamole Two Users Sharing Session Anomaly
status: experimental
id: 1edd77db-0669-4fef-9598-165bda82826d
description: Detects suspicious session with two users present
references:
    - https://research.checkpoint.com/2020/apache-guacamole-rce/
author: Florian Roth
date: 2020/07/03
logsource:
    product: linux
    service: guacamole
detection:
    selection:
        - '(2 users now present)'
    condition: selection
falsepositives:
    - Unknown
level: high

