title: Clear Linux Logs
id: 80915f59-9b56-4616-9de0-fd0dea6c12fe
status: stable
description: Detects clear logs
author: Ömer Günal, oscd.community
date: 2020/10/07
references:
    - https://attack.mitre.org/techniques/T1070/002/
logsource:
    product: linux
    category: process_creation
detection:
    selection1:
      - ProcessName|endswith: 
        - '/rm'
        - 'shred'
        - 'echo'
        - 'rmdir'
    selection2:
        CommandLine|contains: 
          - '/var/log'
          - '/private/var/audit'
          - '/private/var/log/'
    condition: selection1 and selection2
falsepositives:
    - Legitimate administration activities
level: medium
tags:
    - attack.defense_evasion
    - attack.t1070.002
