title: Overwriting the file with dev zero or null
description: Detects overwriting (effectively wiping/deleting) the file
author: Jakob Weinzettl, oscd.community
tags:
    - attack.impact
    - attack.t1485
logsource:
    product: linux
detection:
    keywords1:
        - 'dd'   
    keywords2:
        - 'if=/dev/null'    
        - 'if=/dev/zero'    
    condition: keywords1 and keywords2
falsepositives:
    - Unknown
level: low
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.yaml
