title: Overwriting the file with dev zero or null
description: Detects overwriting (effectively wiping/deleting) the file
author: Jakob Weinzettl, oscd.community
tags:
    - attack.impact
    - attack.t1485
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
        a0|contains: 'dd'   
        a1|contains:
            - 'if=/dev/null'    
            - 'if=/dev/zero'    
    condition: selection
falsepositives:
    - Unknown
level: low
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.yaml
