title: SSHD Error Message CVE-2018-15473
description: Detects exploitation attempt using public exploit code for CVE-2018-15473
references:
    - https://github.com/Rhynorater/CVE-2018-15473-Exploit
author: Florian Roth
date: 2017/08/24
logsource:
    product: linux
    service: sshd
detection:
    keywords:
        - 'error: buffer_get_ret: trying to get more bytes 1907 than in buffer 308 [preauth]'
    condition: keywords
falsepositives:
    - Unknown
level: medium
