title: System Information Discovery
id: 42df45e7-e6e9-43b5-8f26-bec5b39cc239
status: stable
description: Detects system information discovery commands
author: Ömer Günal, oscd.community
date: 2020/10/08
references:
    - https://attack.mitre.org/techniques/T1082/
logsource:
    product: linux
detection:
    selection:
        CommandLine|contains:
          - 'uname'
          - '/proc/version'
          - '/etc/*-release'
          - 'hostname'
          - '/etc/issue'
          - 'uptime'
          - 'lspci'
          - 'dmidecode'
          - 'lscpu'
          - 'lsmod'
    selection2:
      type: 'PATH'
      name:
          - '/sys/class/dmi/id/bios_version'
          - '/sys/class/dmi/id/product_name'
          - '/sys/class/dmi/id/chassis_vendor'
          - '/proc/scsi/scsi'
          - '/proc/ide/hd0/model'
    condition: selection or selection2
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
    - attack.t1082
