title: File or folder permissions change
description: Detects 
status: experimental
tags:
    - attack.defense_evasion
    - attack.t1222
author: Jakob Weinzettl, oscd.community
date: 2019/09/23
logsource:
    product: linux
detection:
    keywords:
        - 'chmod'
        - 'chown'
    condition: keywords
falsepositives:
    - User interracting with files permissions (normal/daily behaviour)
level: low
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222/T1222.yaml
