title: Process Discovery
id: 4e2f5868-08d4-413d-899f-dc2f1508627b
status: stable
description: Detects process discovery commands
author: Ömer Günal
date: 2020/10/06
references:
    - https://attack.mitre.org/techniques/T1057/
logsource:
    product: linux
detection:
    keywords:
        - commands|contains:
          - 'ps *'
          - 'top'
    condition: keywords
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
