title: Local Groups
id: 0d68a143-a178-4aa6-b3f5-e441aceca810
status: stable
description: Detects group enumeration
author: Ömer Günal, oscd.community
date: 2020/10/06
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
logsource:
    product: linux
detection:
    selection:
        - CommandLine|contains:
          - 'groups'
          - '/etc/passwd'
          - '/etc/group'
          - 'getent group'
          - 'id'
    condition: selection
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
    - attack.t1069.001
