title: Relevant ClamAV Message
id: 36aa86ca-fd9d-4456-814e-d3b1b8e1e0bb
status: stable
description: Detects relevant ClamAV messages
author: Florian Roth
date: 2017/03/01
references:
    - https://github.com/ossec/ossec-hids/blob/master/etc/rules/clam_av_rules.xml
logsource:
    product: linux
    service: clamav
detection:
    keywords|contains:
        - 'Trojan'
        - 'VirTool'
        - 'Webshell'
        - 'Rootkit'
        - 'Htran'
    filter:
        - 'FOUND'
    condition: keywords and filter
falsepositives:
    - Unknown
level: high
