title: Connection Proxy
id: 72f4ab3f-787d-495d-a55d-68c2ff46cf4c
description: Detects setting proxy
references:
    - https://attack.mitre.org/techniques/T1090/
author: Ömer Günal
date: 2020/06/17
tags:
    - attack.defense_evasion
level: low
logsource:
    product: linux
detection:
    keyword:
        - 'http_proxy=*'
        - 'https_proxy=*'
    condition: keyword
falsepositives:
    - Legitimate administration activities
