title: System Network Discovery - Linux
id: 71da9e5a-fb1e-46a8-abc1-28c80173af4c
status: experimental
description: Detects enumeration of firewall configuration
author: remotephone, oscd.community
date: 2020/10/06
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md
logsource:
    category: process_creation
    product: unix
detection:
    selection:
        ProcessName:
            - '/usr/bin/firewall-cmd'
            - '/usr/sbin/ufw'
            - '/usr/sbin/iptables'
            - '/usr/bin/netstat'
            - '/usr/bin/ss'
            - '/usr/sbin/ip'
            - '/usr/sbin/ifconfig'
    condition: selection
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
    - attack.t1016