title: Local Groups
id: 0d68a143-a178-4aa6-b3f5-e441aceca810
status: stable
description: Detects group enumeration
author: Ömer Günal
date: 2020/10/06
references:
    - https://attack.mitre.org/techniques/T1069/001/
logsource:
    product: linux
detection:
    keywords:
        - keys|contains:
          - 'groups'
          - '/etc/passwd'
          - '/etc/group'
          - 'getent group'
        - command:
          - 'id'
          - 'id *'
    condition: keywords
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
