title: 'Split A File Into Pieces'
id: 7f2bb9d5-6395-4de5-969c-70c11fbe6b12
status: experimental
description: 'Detection use of the command "split" to split files into parts and possible transfer.'
    # For this rule to work you must enable audit of process execution in OpenBSM, see link
    # https://osquery.readthedocs.io/en/stable/deployment/process-auditing/#macos-process-socket-auditing
author: 'Igor Fits, Mikhail Larin, oscd.community'
date: 2020/10/15
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1030/T1030.md
logsource:
    product: macos
    category: process_creation
detection:
    selection:
        Image|endswith: '/split'
    condition: selection
falsepositives:
    - 'Legitimate administrative activity'
level: low
tags:
    - attack.exfiltration
    - attack.t1030
