title: Credentials from Password Stores - Keychain
id: b120b587-a4c2-4b94-875d-99c9807d6955
status: experimental
description: Detects passwords' dumps from Keychain
author: Tim Ismilyaev, oscd.community
date: 2020/10/19
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.001/T1555.001.md
logsource:
    category: process_creation
    product: macos
detection:
    any_keychain_call:
        ProcessName|startswith: 'security'
    condition: any_keychain_call
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.credential_access
    - attack.t1555.001