title: System Network Discovery - macOS
id: 71da9e5a-fb1e-46a8-abc1-28c80173af4c
status: experimental
description: Detects enumeration of firewall configuration
author: remotephone, oscd.community
date: 2020/10/06
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md
logsource:
    product: macos
    category: process_creation
detection:
    selection1:
        ProcessName:
            - '/usr/sbin/netstat'
            - '/sbin/ifconfig'
            - '/usr/sbin/ipconfig'
            - '/usr/libexec/ApplicationFirewall/socketfilterfw'
            - '/usr/sbin/networksetup'
            - '/usr/sbin/arp'
    selection2:
        ProcessName: '/usr/bin/defaults'
        Commandline|contains: 'read /Library/Preferences/com.apple.alf'
    condition: selection1 or selection2
falsepositives:
    - Legitimate administration activities
level: low
tags:
    - attack.discovery
    - attack.t1016
