title: Local Groups Discovery
id: 89bb1f97-c7b9-40e8-b52b-7d6afbd67276
status: experimental
description: Detects enumeration of local system groups
author: Ömer Günal, Alejandro Ortuno, oscd.community
date: 2020/10/11
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
logsource:
  category: process_creation
  product: macos
detection:
  selection_1:
    Image|endswith:
      - '/dscacheutil'
    CommandLine|contains|all:
      - '-q'
      - 'group'
  selection_2:
    Image|endswith:
      - '/cat'
    CommandLine|contains:
      - '/etc/group'
  selection_3:
    Image|endswith:
      - '/dscl'
    CommandLine|contains|all:
      - '-list'
      - '/groups'
  condition: 1 of them
falsepositives:
  - Legitimate administration activities
level: informational
tags:
  - attack.discovery
  - attack.t1069.001
