title: System Network Discovery - Firewall Enumeration
id: 71da9e5a-fb1e-46a8-abc1-28c80173af4c
status: experimental
description: Detects enumeration of firewall configuration
author: remotephone, oscd.community
date: 2020/10/06
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md
logsource:
    product: macos
detection:
    selection:
        CommandLine|contains:
            - 'netstat'
            - 'ifconfig'
            - 'defaults read /Library/Preferences/com.apple.alf'
            - 'socketfilterfw'
    condition: selection
falsepositives:
    - Legitimate administration activities
    - Redirecting output of echo command to a path that contains the word "cron"
level: low
tags:
    - attack.discovery
    - attack.t1016
