title: Screen Capture - macOS
id: 38a16051-0922-4c47-96e6-72ca9fc03633
status: experimental
description: Detects attempts to use capture macOS system screenshots
author: remotephone, oscd.community
date: 2020/10/13
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1113/T1113.md
    - https://github.com/BC-SECURITY/Empire/blob/master/lib/modules/python/collection/osx/screenshot.py
logsource:
    product: macos
    category: process_creation
detection:
    selection1:
        ProcessName:
            - '/usr/sbin/screencapture'
    condition: selection1
falsepositives:
    - Legitimate user activity taking screenshots
level: low
tags:
    - attack.collection
    - attack.t1113
