title: Cisco BGP authentication failures
status: test
description: Find authenticated BGP failures
author: Tim Brown
date: 2023/01/09
logsource:
    product: huawei
    service: bgp
detection:
    protocol:
        - ':179'
    keywords:
        - 'BGP_AUTH_FAILED'
    condition: protocol and keywords
fields:
    - host
    - PeeId
level: low
