title: Huawei BGP authentication failures
id: a557ffe6-ac54-43d2-ae69-158027082350
status: experimental
description: Find BGP failures which may be indicative of brute force attacks to manipulate routing: https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
author: Tim Brown
date: 2023/01/09
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.T1078
    - attack.credential_access
    - attack.T1110
    - attack.collection
    - attack.T1557
logsource:
    product: huawei
    service: bgp
detection:
    protocol:
        - ':179'
    keywords:
        - 'BGP_AUTH_FAILED'
    condition: protocol and keywords
fields:
    - host
    - PeeId
level: low
falsepositives:
    - Uncommon except due to misconfigurations
