title: Potential Defense Evasion via Firewall Policy Addition - Fortinet Fortigate Firewall
id: f24ab7a8-f09a-4319-82c1-915586aa642b
status: experimental
description: Detects the addition of a new firewall policy on Fortinet Fortigate Firewall.
references: 
    - https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025-02-14
tags:
    - attack.defense-evasion
    - attack.t1562
logsource:
    product: fortinet
    category: firewall
detection:
    selection:
        action: 'Add'
        cfgpath: 'firewall.policy'
    condition: selection
falsepositives:
    - A firewall policy can be added for legitimate purposes
level: medium
