title: Potential Persistence via New Local User Creation - Fortinet Fortigate Firewall
id: ddbbe845-1d74-43a8-8231-2156d180234d
status: experimental
description: |
    Detects the creation of a new local user on Fortinet Fortigate Firewall.
    The new local user could be used for VPN connections.
references: 
    - https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025-02-14
tags:
    - attack.persistence
    - attack.t1136.001
logsource:
    product: fortinet
    category: firewall
detection:
    selection:
        action: 'Add'
        cfgpath: 'user.local'
    condition: selection
falsepositives:
    - A local user can be created for legitimate purposes
level: medium
