title: Potential Remote Services Abuse via Addition of VPN SSL Web Portal - Fortinet Fortigate Firewall
id: 2bfb6216-0c31-4d20-8501-2629b29a3fa2
status: experimental
description: |
    Detects the addition of a VPN SSL Web Portal on Fortinet Fortigate Firewall.
    This behavior was observed in pair with the Potential Remote Services Abuse via Modification of VPN SSL Settings - Fortinet Fortigate Firewall (sigma rule)
references:
    - https://www.fortiguard.com/psirt/FG-IR-24-535
author: Marco Pedrinazzi @pedrinazziM (InTheCyber)
date: 2025-02-14
tags:
    - attack.persistence
    - attack.initial-access
    - attack.t1133
logsource:
    product: fortinet
    category: firewall
detection:
    selection:
        action: 'Add'
        cfgpath: 'vpn.ssl.web.portal'
    condition: selection
falsepositives:
    - A VPN SSL Web Portal can be added for legitimate purposes
level: medium
