title: Potential Peach Sandstorm APT C2 Communication Activity
id: b8225208-81d0-4715-a822-12bcdd583e0f
status: experimental
description: Detects potential C2 communication activity related to Peach Sandstorm APT
references:
    - https://twitter.com/MsftSecIntel/status/1737895710169628824
author: X__Junior
date: 2024/01/15
tags:
    - attack.command_and_control
logsource:
    category: proxy
detection:
    selection_main:
        cs-method: 'GET'
        c-uri|contains:
            - '/api/Core/Command/Init'
            - '/api/Core/Command/Restart'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium