title: Raw Disk Access Using Illegitimate Tools
id: db809f10-56ce-4420-8c86-d6a7d793c79c
description: Raw disk access using illegitimate tools, possible defence evasion
author: Teymur Kheirkhabarov, oscd.community
status: test
date: 2019/10/22
modified: 2022/02/07
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
tags:
    - attack.defense_evasion
    - attack.t1006
logsource:
    product: windows
    category: raw_access_thread
detection:
    filter_1:
        Device|contains: floppy
    filter_2:
        Image|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SystemApps\'
        Image|endswith:             # easy to bypass. requires extra rule to support this one
            - '\wmiprvse.exe'
            - '\sdiagnhost.exe'
            - '\searchindexer.exe'
            - '\csrss.exe'
            - '\defrag.exe'
            - '\smss.exe'
            - '\vssvc.exe'
            - '\compattelrunner.exe'
            - '\wininit.exe'
            - '\autochk.exe'
            - '\taskhost.exe'
            - '\dfsrs.exe'
            - '\vds.exe'
            - '\lsass.exe'
            - '\svchost.exe'
            - '\MsMpEng.exe'
            - '\SearchApp.exe'
            - '\powershell.exe'
            - '\GamingServices.exe'
    filter_3:
        ProcessId: 4
    filter_specific:
        Image:
            - 'C:\Windows\System32\backgroundTaskHost.exe'
            - 'C:\Windows\System32\RuntimeBroker.exe'
            - 'C:\Windows\System32\MoUsoCoreWorker.exe'
            - 'C:\Windows\System32\taskhostw.exe'
            - 'C:\Windows\System32\SrTasks.exe'
            - 'C:\Windows\System32\dllhost.exe'
            - 'C:\Windows\System32\DeviceCensus.exe'
            - 'C:\Windows\UUS\amd64\MoUsoCoreWorker.exe'
    filter_system:
        Image: 'System'
    filter_Keybase:
        Image|endswith: '\Keybase\upd.exe'
    filter_windefender:
        Image|startswith: 'C:\ProgramData\Microsoft\Windows Defender\Platform\'
        Image|endswith: '\MsMpEng.exe'
    filter_appdata:
        Image|contains|all: 
            - 'C:\Users\'
            - '\Microsoft\OneDrive\'
            - '\FileCoAuth.exe'
    filter_programfiles:  # this rule causes so many FPs that we have to do this
        Image|startswith:
            - 'C:\Program Files\'
            - 'C:\Program Files (x86)\'
    condition: not 1 of filter_*
fields:
    - ComputerName
    - Image
    - ProcessID
    - Device
falsepositives:
    - Legitimate Administrator using tool for raw access or ongoing forensic investigation
level: medium

