title: Cisco Duo User Bypassed MFA
id: 6f7e1c10-2dc9-4312-adb6-9574ff09a5c8
status: test
description: Detects when a user bypasses MFA
references:
    - https://duo.com/docs/adminapi#activity-logs
author: Nikita Khalimonenkov
date: 2024/04/14
tags:
    - attack.credential_access
    - attack.defense_evasion
    - attack.initial_access
logsource:
    product: cisco duo
    service: duo
detection:
    selection:
        event_type: authentication
        reason: bypass_user
    condition: selection
falsepositives:
    - Legitimate user that was assigned on purpose to a bypass group
level: medium
