title: Potential Operation Triangulation C2 Beaconing Activity
id: aa03c712-75c6-438b-8d42-de88f2427e09
status: experimental
description: Detects potential beaconing activity to domains used in 0day attacks on iOS devices and revealed by Kaspersky and the FSB
references:
    - https://securelist.com/operation-triangulation/109842/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/01
tags:
    - attack.command_and_control
logsource:
    category: proxy
detection:
    selection:
        cs-host|contains:
            - 'addatamarket.net'
            - 'backuprabbit.com'
            - 'businessvideonews.com'
            - 'cloudsponcer.com'
            - 'datamarketplace.net'
            - 'mobilegamerstats.com'
            - 'snoweeanalytics.com'
            - 'tagclickcn[.]com'
            - 'topographyupdates.com'
            - 'unlimitedteacup.com'
            - 'virtuallaughing.com'
            - 'webtackers[.]com'
            - 'growthtransport.com'
            - 'anstv.net'
            - 'ans7tv.net'
    condition: selection
falsepositives:
    - Unknown
level: high
