title: Google Workspace User Assigned Admin Role
id: 2d1b83e4-17c6-4896-a37b-29140b40a788
description: Detects when an admin role is assigned to a Google Workspace user. 
author: Austin Songer
status: experimental
date: 2021/08/23
references:
    - https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
logsource:
  service: google_workspace.admin
detection:
    selection:
        eventService: admin.googleapis.com
        admin.alert.name: google.admin.AdminService.grantAdminPrivilege
    condition: selection
level: medium
tags:
    - attack.persistence
    - attack.t1098
falsepositives:
 - Google Workspace admin role assigned, may be modified by system administrators.
