title: CobaltStrike Malleable OneDrive Browsing Traffic Profile
id: c9b33401-cc6a-4cf6-83bb-57ddcb2407fc
status: deprecated
description: Detects Malleable OneDrive Profile
references:
    - https://github.com/rsmudge/Malleable-C2-Profiles/blob/26323784672913923d20c5a638c6ca79459e8529/normal/onedrive_getonly.profile
author: Markus Neis
date: 2019/11/12
modified: 2024/02/15
tags:
    - attack.defense_evasion
    - attack.command_and_control
    - attack.t1071.001
logsource:
    category: proxy
detection:
    selection:
        cs-method: 'GET'
        c-uri|endswith: '\?manifest=wac'
        cs-host: 'onedrive.live.com'
    filter:
        c-uri|startswith: 'http'
        c-uri|contains: '://onedrive.live.com/'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
