title: Bitbucket Unauthorized Access Detected
id: 7215374a-de4f-4b33-8ba5-70804c9251d3
status: experimental
description: Detects unauthorized access is attempted to the resources. The required log level is "Advance" for these audit events.
references:
    - ttps://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
tags:
    - attack.t1586
logsource:
    product: bitbucket
    service: audit
detection:
    selection:
        auditType.category: 'Security'
        auditType.action: 'Unauthorized access to a resource'
    condition: selection
falsepositives:
    - Access attempts to non-existent repositories or due to outdated plugins. Usually "Anonymous" user is reported in the "author.name" field in most cases.
level: critical
