title: Cisco BGP authentication failures
status: test
description: Find authenticated BGP failures
author: Tim Brown
date: 2023/01/09
logsource:
    product: cisco
    service: bgp
detection:
    protocol:
        - ':179'
    keywords:
        - 'IP-TCP-3-BADAUTH'
    condition: protocol and keywords
fields:
    - tcpConnLocalAddress
    - tcpConnRemAddress
level: low
