title: Cisco BGP authentication failures
id: 56fa3cd6-f8d6-4520-a8c7-607292971886
status: experimental
description: Find BGP failures which may be indicative of brute force attacks to manipulate routing: https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
author: Tim Brown
date: 2023/01/09
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.T1078
    - attack.credential_access
    - attack.T1110
    - attack.collection
    - attack.T1557
logsource:
    product: cisco
    service: bgp
detection:
    protocol:
        - ':179'
    keywords:
        - 'IP-TCP-3-BADAUTH'
    condition: protocol and keywords
fields:
    - tcpConnLocalAddress
    - tcpConnRemAddress
level: low
falsepositives:
    - Uncommon except due to misconfigurations
