title: WatchdogProc usage
status: experimental
description: Detects watchdogproc on the command line.
references: https://www.endgame.com/blog/technical-blog/malware-personal-touch
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        command_line:
            - 'watchdogproc*'
    condition: selection
fields:
    - command_line
falsepositives:
    - Not very common, but occurs.
level: medium
