title: Schtask Creation
status: experimental
description: Detects usage of schtask usage
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'schtask.exe'
    condition: selection
fields:
    - process
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
