title: Schtask from User Profile
status: experimental
description: Detects usage of Powershell Download commands
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'schtask.exe'
        command_line:
            - '*\appdata\*'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Should be limited in legitimate use
level: medium
