title: bcdedit off
status: experimental
description: Detects usage of bcdedit off
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'bcdedit.exe'
        command_line:
            - '*off'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
