title: Net IPC Share
status: experimental
description: Detects mshta with javascript in command line
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'mshta.exe'
        command_line:
            - '*javascript:*'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Some admins use it, mostly bad things.
level: medium
