title: Bitsadmin Download
status: experimental
description: Detects usage of bitsadmin downloading a file
references:
    - https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
    - https://isc.sans.edu/diary/22264
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'bitsadmin.exe'
        command_line:
            - '*/transfer'
            - '*/download'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
