title: Net IPC Share
status: experimental
description: Detects net usage accessing IPC$
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'net.exe'
        command_line:
            - '*ipc$*'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Some admins use it, mostly bad things. 
level: medium
