title: Detect Squiblydoo
status: experimental
description: Detection of squiblydoo technique - scrobj.dll
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'rundll32.exe'
        command_line:
            - '*scrobj.dll'
            - '*scrobj'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
