title: MSHTA spwaned by SVCHOST as seen in LethalHTA
status: experimental
description: Detects MSHTA.EXE spwaned by SVCHOST described in report
references:
    - https://codewhitesec.blogspot.com/2018/07/lethalhta.html
author: Markus Neis
date: 2018/06/07
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        parent_path: '*\svchost.exe'
        process: 'mshta.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
