title: Detect Regsvr32 Control_RunDLL Usage
status: experimental
description: Detects regsvr32 with Control_RunDLL
references:
author: Michael Haag
logsource:
    product: bit9:carbonblack:json
    service: cbr
detection:
    selection:
        process:
            - 'regsvr32.exe'
        command_line:
            - '*,Control_RunDLL'
    condition: selection
fields:
    - command_line
    - process
falsepositives:
    - Some legitimate apps use this, but limited.
level: medium
