title: Dangerous SQL Query
id: d84c0ded-edd7-4123-80ed-348bb3ccc4d5
status: experimental
description: Detects non-standard sql activities that are likely related to attacker activities
author: '@juju4'
date: 2022/12/25
references:
    - https://github.com/sqlmapproject/sqlmap
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    definition: Must be able to log the SQL query
detection:
    keywords:
        - 'drop'
        - 'truncate'
        - 'dump'
        - 'select \*'
    condition: keywords
falsepositives:
    - Inventory, Monitoring
    - Vulnerability scanner
    - Legitimate application
level: high
