title: Dangerous Activities in mysql/mariadb Database
id: 755b222c-f33b-4d0c-8e1d-488060e86ae7
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it.
author: '@juju4'
date: 2021/06/13
references:
    - https://dev.mysql.com/doc/refman/5.7/en/query-log.html
    - https://dev.mysql.com/doc/refman/5.7/en/audit-log-logging-configuration.html
    - https://docs.microsoft.com/en-us/azure/mysql/concepts-audit-logs
    - https://github.com/sqlmapproject/sqlmap
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: mysql
detection:
    sql_keywords:
        - 'drop'
        - 'truncate'
        - 'dump'
        - 'select \*'
    sql_users:
        - 'sa'
        - 'dbo'
    condition: sql_keywords or sql_users
falsepositives:
    - Inventory, Monitoring
    - Vulnerability scanner
    - Legitimate application
level: high
