title: Anomalous Activities in Oracle Database
id: a3c52111-2686-4263-bc21-7fe8eb5b13bb
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it.
author: '@juju4'
date: 2021/06/13
references:
    - https://docs.oracle.com/cd/B19306_01/network.102/b14266/cfgaudit.htm#i1011302
    - https://github.com/sqlmapproject/sqlmap
    - https://github.com/quentinhardy/odat
    - https://github.com/TacticThreat/Oracle-Pentesting-Reference
    - https://www.imperva.com/blog/oracle-auditing-part-1-standard-auditing/
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: oracle
detection:
    sql_keywords:
        - 'drop'
        - 'truncate'
        - 'dump'
        - 'alter'
        - 'delete'
        - 'select \*'
        - 'schema'
        - 'show tables'
        - 'grant'
        - 'UNION ALL SELECT'
        - 'UNION SELECT'
        - 'sleep'
        # Oracle
        - 'GET_HOST_ADDRESS'
        - 'DBMS_EXPORT_EXTENSION'
        - 'DBMS_SCHEDULER'
        - 'UTL_FILE'
        - 'DBMS_LOB'
        - 'DBMS_XSLPROCESSOR'
        - 'DBMS_ADVISOR'
        - 'CTXSYS'
        - 'HttpUriType'
        - 'UTL_TCP'
        - 'UTL_HTTP'
        - 'DBMS_CDC_IPUBLISH'
        - 'DBMS_CDC_PUBLISH'
        - 'DBMS_CDC_SUBSCRIBE'
        - 'DBMS_METADATA'
        - 'SDO_TOPO_DROP_FTBL'
        - 'DBMS_JVM_EXP_PERMS'
        - 'COMPRESSWORKSPACE'
        - 'FINDRICSET'
        - 'CREATE OR REPLACE FUNCTION'
        - 'WITH ADMIN OPTION'
    sql_users:
        - 'sa'
        - 'dbo'
        - 'sysdba'
    condition: sql_keywords or sql_users
falsepositives:
    - Inventory, Monitoring
    - Vulnerability scanner
    - Legitimate application
level: low
