title: Dangerous Activities in Oracle Database
id: 8ee981b9-0c09-494f-8791-927950c14070
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it.
author: '@juju4'
date: 2021/06/13
references:
    - https://docs.oracle.com/cd/B19306_01/network.102/b14266/cfgaudit.htm#i1011302
    - https://github.com/sqlmapproject/sqlmap
    - https://github.com/quentinhardy/odat
    - https://github.com/TacticThreat/Oracle-Pentesting-Reference
    - https://www.imperva.com/blog/oracle-auditing-part-1-standard-auditing/
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: oracle
detection:
    keywords:
        - 'drop'
        - 'truncate'
        - 'dump'
        - 'select \*'
    users:
        - 'sa'
        - 'dbo'
        - 'sysdba'
    condition: keywords or users
falsepositives:
    - Inventory, Monitoring
    - Vulnerability scanner
    - Legitimate application
level: high
