title: Dangerous Activities in Posgres Database
id: 00568889-ddd2-493f-b5fe-9a3d759522c0
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it or maybe full log local and partial remote.
author: '@juju4'
date: 2021/06/13
references:
    - https://postgresqlco.nf/doc/en/param/log_statement/
    - https://github.com/michaelpq/pg_plugins/tree/master/jsonlog
    - https://github.com/sqlmapproject/sqlmap
    - https://www.cybertec-postgresql.com/en/secure-postgresql-a-reminder-on-various-attack-surfaces/
    - https://medium.com/@cryptocracker99/a-penetration-testers-guide-to-postgresql-d78954921ee9
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: postgres
detection:
    posgres_keywords:
        - 'drop'
        - 'truncate'
        - 'dump'
        - 'select \*'
    posgres_users:
        - 'admin'
        - 'wheel'
    condition: posgres_keywords or posgres_users
falsepositives:
    - Inventory, Monitoring
    - Vulnerability scanner
    - Legitimate application
level: high
