title: Anomalous Activities in Posgres Database
id: 6e680d00-a93c-46da-b912-d78a1ea1e0f4
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it or maybe full log local and partial remote.
author: '@juju4'
date: 2021/06/13
references:
    - https://postgresqlco.nf/doc/en/param/log_statement/
    - https://github.com/michaelpq/pg_plugins/tree/master/jsonlog
    - https://github.com/sqlmapproject/sqlmap
    - https://www.cybertec-postgresql.com/en/secure-postgresql-a-reminder-on-various-attack-surfaces/
    - https://medium.com/@cryptocracker99/a-penetration-testers-guide-to-postgresql-d78954921ee9
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: postgres
detection:
    sql_keywords:
         - drop
         - truncate
         - dump
         - alter
         - delete
         - 'select *'
         - schema
         - show tables
         - grant
         - UNION ALL SELECT
         - UNION SELECT
         - sleep
         # Postgres
         - COPY PROGRAM
         - 'COPY .* FROM PROGRAM'
         - 'SERVER .* OPTIONS*(PROGRAM'
         - 'COPY .* FROM'
         - 'COPY .* TO'
         - pg_ls_dir
         - pg_read_file
    sql_users:
         - admin
         - wheel
    condition: sql_keywords or sql_users
falsepositives:
    - Inventory, Monitoring
    - Penetration testing
    - Vulnerability scanner
    - Legitimate application
level: low
