title: Dangerous Activities in SQL Server/Sybase Database 
id: ecb4ea76-891f-40e9-90df-d13317b79e21
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it.
    Some servers allows to enable logging by table like https://github.com/cockroachdb/docs/blob/master/v19.2/sql-audit-logging.md
author: '@juju4'
date: 2021/06/13
references:
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/create-a-server-audit-and-database-audit-specification?view=sql-server-ver15
    - https://techcommunity.microsoft.com/t5/azure-database-support-blog/azure-sql-db-and-log-analytics-better-together-part-3-query/ba-p/1034222 
    - https://github.com/sqlmapproject/sqlmap
    - https://github.com/quentinhardy/msdat
    - https://i.blackhat.com/asia-21/Thursday-Handouts/as-21-Yan-Give-Me-a-Sql-Injection-I-Shall-Pwn-IIS-and-Sql-Server.pdf
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: sqlserver
detection:
    sql_keywords:
         - drop
         - truncate
         - dump
         - 'select *'
    sql_users:
         - sa
         - dbo
    condition: sql_keywords or sql_users
falsepositives:
    - Inventory, Monitoring
    - Penetration testing
    - Vulnerability scanner
    - Legitimate application
level: high
