title: Anomalous Activities in SQL Server/Sybase Database
id: 2fc285c9-dcd2-4f08-ae22-84f6c990be11
status: experimental
description: |
    Detects non-standard sql activities that are likely related to attacker activities
    Adapt your context.
    Easier if Stored Procedures usage is enforced (and can also help for input validation).
    This does not account for possible obfuscation.
    If sql statement contains PII, it may be preferable to mask it or not logged it.
    Some servers allows to enable logging by table like https://github.com/cockroachdb/docs/blob/master/v19.2/sql-audit-logging.md
author: '@juju4'
date: 2021/06/13
references:
    - https://docs.microsoft.com/en-us/sql/relational-databases/security/auditing/create-a-server-audit-and-database-audit-specification?view=sql-server-ver15
    - https://techcommunity.microsoft.com/t5/azure-database-support-blog/azure-sql-db-and-log-analytics-better-together-part-3-query/ba-p/1034222 
    - https://github.com/sqlmapproject/sqlmap
    - https://github.com/quentinhardy/msdat
    - https://i.blackhat.com/asia-21/Thursday-Handouts/as-21-Yan-Give-Me-a-Sql-Injection-I-Shall-Pwn-IIS-and-Sql-Server.pdf
tags:
    - attack.initial_access
    - attack.t1190
    - attack.privilege_escalation
    - attack.t1505.001
    - attack.exfiltration
logsource:
    category: database
    product: sqlserver
detection:
    sql_keywords:
         - drop
         - truncate
         - dump
         - alter
         - delete
         - trace
         - 'select *'
         - schema
         - show tables
         - grant
         - UNION ALL SELECT
         - UNION SELECT
         - sleep
         # Sybase/SQL Server
         - sp_configure
         - sp_addextendedproc
         - sp_dropextendedproc
         - bulkinsert
         - openrowset
         - xp_cmdshell
         - xp_dirtree
         - xp_fileexist
         - xp-getfiledetails
         - xp_subdirs
         - xp_fixeddrives
         - xp_availablemedia
         - xp_create_subdir
         - Ole Automation Procedures
         - CREATE PROCEDURE
         # "Give Me a SQL Injection, I Shall PWN IIS and SQL Server", blackhat asia 2021
         - sp_addlinkedserver
         - sqloledb
         - opendatasource
         - '/webdav/'
    sql_users:
         - sa
         - dbo
    condition: sql_keywords or sql_users
falsepositives:
    - Inventory, Monitoring
    - Vulnerability scanner
    - Legitimate application
level: low
