title: Disable ASLR via Personality Syscall or Kernel Parameter - Linux
id: e497a24e-9345-4a62-9803-b06d7d7cb132
status: experimental
description: |
    Detects attempts to disable Address Space Layout Randomization (ASLR) in Linux.
    Covers both:
    modification of the /proc/sys/kernel/randomize_va_space file.
    Disabling ASLR weakens memory protection and may indicate exploit development or an attempt to bypass security mechanisms.
    Execution of the `sysctl` command to set `kernel.randomize_va_space=0`, which disables
    ASLR system-wide via kernel parameter modification.
references:
    - https://github.com/CheraghiMilad/bypass-Neo23x0-auditd-config/blob/f1c478a37911a5447d5ffcd580f22b167bf3df14/personality-syscall/README.md
    - https://man7.org/linux/man-pages/man2/personality.2.html
    - https://manual.cs50.io/2/personality
    - https://linux-audit.com/linux-aslr-and-kernelrandomize_va_space-setting/
author: Milad Cheraghi
date: 2025-05-26
modified: 2025-07-29
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1055.009
logsource:
    product: linux
    service: auditd
detection:
    selection_sysctl:
        type: 'EXECVE'
        a0: 'sysctl'
        a1: '-w'
        a2: 'kernel.randomize_va_space=0'
    selection_path:
        type: 'PATH'
        name|endswith: '/randomize_va_space' #/proc/sys/kernel/randomize_va_space
    condition: 1 of selection*
falsepositives:
    - Debugging or legitimate software testing
level: high