title: Credentials In Files
id: df3fcaea-2715-4214-99c5-0056ea59eb35
status: experimental
description: Detecting attempts to extract passwords with grep
author: Igor Fits, oscd.community
date: 2020/10/15
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1552.001/T1552.001.md
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'EXECVE'
        keywords|contains|all: 
              - 'grep'
              - 'password'    
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.credential_access 
    - attack.t1552.001
