title: Creation of System Timer Files
id: 8d2f4a1b-7e5c-4f3a-9b2e-6c1d4f7a3e4b
status: experimental
description: |
  This Sigma rule detects the creation of system timer files in Linux
  via auditd logs.It monitors file creation events
  in the timers.target.wants directories,
  which may be used by attackers for persistence.
  Such actions could indicate attempts to maintain access
  by scheduling malicious tasks via systemd timers.
author: AAtashGar
date: 2025-09-04
tags:
    - attack.persistence
    - attack.t1053
    - attack.t1053.006
logsource:
    product: linux
    service: auditd
    definition: |
      Required auditd configuration:
      -w /lib/systemd/system/timers.target.wants -p wa -k Hunting_systemTimer
      -w /etc/systemd/system/timers.target.wants -p wa -k Hunting_systemTimer
detection:
    selection_sys:
        type: SYSCALL
        syscall: 257
        key: Hunting_systemTimer
    selection_pth_create:
        type: PATH
        nametype: CREATE
        name|startswith:
            - '/lib/systemd/system/timers.target.wants/'
            - '/etc/systemd/system/timers.target.wants/'
    selection_pth_parent:
        type: PATH
        nametype: PARENT
        name|startswith:
            - '/lib/systemd/system/timers.target.wants/'
            - '/etc/systemd/system/timers.target.wants/'
    condition: selection_sys and selection_pth_create and selection_pth_parent
falsepositives:
    - Legitimate administrative activities creating or modifying system timers.
    - System updates or package installations that involve timer configurations.
    - Development or testing environments where timers are frequently created.
level: medium
