title: Binary Padding - Linux
id: c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
status: test
description: |
    Adversaries may use binary padding to add junk data and change the on-disk representation of malware.
    This rule detect using dd and truncate to add a junk data to file.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
author: Igor Fits, oscd.community, Milad Cheraghi
date: 2020-10-13
modified: 2025-06-03
tags:
    - attack.defense-evasion
    - attack.t1027.001
logsource:
    product: linux
    service: auditd
detection:
    selection_execve:
        type: 'EXECVE'
        a0: 'dd'
        a1: 'if=/dev/zero'
        a2: 'bs=1'
        a3: 'count=1'
    selection_truncate:
        a0: 'truncate'
        a1: '-s'
    condition: selection_execve or selection_truncate
falsepositives:
    - Unknown
level: medium
