action: global
title: Obfuscated Files or Information - Steganography
description: Detects appending of zip file to image
author: 'Pawel Mazur'
status: experimental
date: 2021/09/09
references:
   - https://attack.mitre.org/techniques/T1027/003/
tags:
   - attack.defense_evasion
   - attack.t1027.003
falsepositives:
   - None
level: low
logsource:
   product: linux
   service: auditd
---
id: 45810b50-7edc-42ca-813b-bdac02fb946b
detection:
   commands:
       type: EXECVE
       a0: cat
   a1:
       - a1|endswith: '.jpg'
       - a1|endswith: '.png'
   a2:
       a2|endswith: '.zip'
   condition: commands and a1 and a2
---
id: edd595d7-7895-4fa7-acb3-85a18a8772ca
detection:
   commands:
       type: EXECVE
       a0: unzip
   a1:
       - a1|endswith: '.jpg'
       - a1|endswith: '.png'
   condition: commands and a1
