title: 'File Time Attribute Change'
id: b3cec4e7-6901-4b0d-a02d-8ab2d8eb818b
status: experimental
description: 'Detect file time attribute change to hide new or changes to existing files.'
  # For this rule to work execve auditing must be configured
  # Example config (place it at the bottom of audit.rules)
  # -a always,exit -F arch=b32 -S execve -k execve
  # -a always,exit -F arch=b64 -S execve -k execve
author: 'Igor Fits, oscd.community'
date: 2020/10/15
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.006/T1070.006.md
logsource:
    product: linux
    service: auditd
detection:
    execve:
        type: 'EXECVE'
    touch:
         - 'touch'
    selection2:
         - '-t'
         - '-acmr'
         - '-d'
         - '-r'
    condition: execve and touch and selection2
falsepositives:
    - 'Unknown'
level: medium
tags:
    - attack.defense_evasion
    - attack.t1070.006
