title: Webshell Remote Command Execution
status: experimental
description: Detects posible command execution by web application/web shell
# You need to add to the config auditd.conf: 
# -a always,exit -F arch=b32 -S execve -F euid=33 -k detect_execve_www
# -a always,exit -F arch=b64 -S execve -F euid=33 -k detect_execve_www
# change 33 to id you webserver user. default: www-data:x:33:33
tags:
    - attack.persistence
    - attack.t1100
references:
    - personal experience
author: Ilyas Ochkov, Beyu Denis, oscd.community
date: 2019/10/12
modified: 2019/11/04
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'SYSCALL'
        SYSCALL: 'execve'
        key: 'detect_execve_www'
    condition: selection
falsepositives:
    - Admin activity
    - Crazy web applications
level: critical
