title: File time attribute change
id: b3cec4e7-6901-4b0d-a02d-8ab2d8eb818b
status: experimental
description: Detect file time attribute change to hide new or changes to existing files.
author: Igor Fits, oscd.community
date: 2020/10/15
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.006/T1070.006.md
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        type: 'EXECVE'
        keywords|contains: 'touch'
    selection2:
        type: 'EXECVE'
        keywords|contains: 
         - '-t'
         - '-acmr'
         - '-d'
         - '-r'
    condition: selection1 and selection2
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion 
    - attack.t1070.006