title: Data Compressed
status: experimental
description: An adversary may compress data (e.g., sensitive documents) that is collected prior to exfiltration in order to make it portable and minimize the amount of data sent over the network
author: Timur Zinniatullin, oscd.community
references:
    - https://attack.mitre.org/techniques/T1002/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1002/T1002.yaml
logsource:
    product: linux
    service: auditd
detection:
    selection1:
        type: 'execve'
        a0: 'zip'
    selection2:
        type: 'execve'
        a0: 'gzip'
        a1: '-f'
    selection3:
        type: 'execve'
        a0: 'tar'
        a1: '-cvzf'
    condition: 1 of them
falsepositives:
    - highly likely
level: low
tags:
    - attack.exfiltration
    - attack.t1002
