title: Process Name Masquerading via Prctl Syscall
id: f61968b7-b286-4257-9fd7-a89ba8722973
status: experimental
description: |
    Detects usage of prctl syscall with PR_SET_NAME (option 0x0f),
    which is commonly used for process name masquerading or hiding malicious processes.
references:
    - https://github.com/CheraghiMilad/bypass-Neo23x0-auditd-config/blob/26106ef280868b2729fc65b9c3fcbed326e14e22/prctl-syscall/README.md
    - https://man7.org/linux/man-pages/man2/prctl.2.html
author: Milad Cheraghi
date: 2025-06-05
tags:
  - attack.defense_evasion
  - attack.t1036.004
logsource:
  product: linux
  service: auditd
detection:
  selection:
    type: SYSCALL
    syscall: 157 # prctl
    a0: 'f' # PR_SET_NAME
    exe|contains:
      - /home
      - /tmp
      - /mnt
      - /opt
      - /dev/shm
      - /var/tmp
  condition: selection
falsepositives:
  - Legitimate software that changes process name for monitoring or sandboxing.
level: medium
