title: Modification of ld.so.preload
description: Identifies modification of ld.so.preload for shared object injection. This technique is used by attackers to load arbitrary code into processes.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Tony Lambert)
date: 2019/10/24
tags:
    - attack.defense_evasion
    - attack.t1055
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'PATH'
        name:
            - '/etc/ld.so.preload'
    condition: selection
    condition: selection
falsepositives:
    - unknown
level: medium
