title: Discovery System Info via sysinfo syscall
id: b207d563-a1d9-4275-b349-77d1eb55aa6d
status: experimental
description: The sysinfo system call in Linux provides a snapshot of key system statistics, such as uptime, load averages,
             memory usage, and the number of running processes. malware or reconnaissance tools might leverage sysinfo to
             fingerprint the system—gathering data to determine if it's a viable target.
references:
    - https://github.com/CheraghiMilad/bypass-Neo23x0-auditd-config/blob/f1c478a37911a5447d5ffcd580f22b167bf3df14/sysinfo-syscall/README.md
    - https://man7.org/linux/man-pages/man2/sysinfo.2.html
author: 'Milad Cheraghi'
date: 2025-05-30
tags:
    - attack.discovery
    - attack.t1057
    - attack.t1082
logsource:
    product: linux
    service: auditd
detection:
    selection:
        type: 'SYSCALL'
        syscall: 99
    condition: selection
falsepositives:
    - Admin activity
    - Splunkd activity (exe!=/bin/splunkd)
level: medium
