title: Disable Kaspersky Anti-Virus and Edr - Linux
id: 36388120-b3f1-4ce9-b50b-280d9a7f4c04
status: experimental
description: |
  Detects execution of the Kaspersky init.d stop script on Linux systems. 
  This activity may indicate a manual interruption of the antivirus service by an administrator,
  or it could be a sign of potential tampering or evasion attempts by malicious actors.
references:
    - https://support.kaspersky.com/KES4Linux/12.0.0/en-US/197929.htm
author: Milad Cheraghi
date: 2025-08-29
tags:
    - attack.execution
    - attack.t1059
logsource:
    product: linux
    service: auditd
detection:
    selection_1:
        type: 'EXECVE'
        a0: '/bin/sh'
        a1: '-u'
        a2|endswith: 'init.d/kesl'
        a3: 'stop'
    selection_2:
        a0: 'systemctl'
        a1: 'stop'
        a2: 'kesl'
    condition: 1 of selection_*
falsepositives:
    - System administrator manually stopping Kaspersky services
level: medium