title: Network Connection Initiated To CloudFlare Tunnels Domains
id: 4b657234-038e-4ad5-997c-4be42340bce4
status: experimental
description: |
    Detects network connections to CloudFlare domains initiated by a process on a system. Attackers can abuse that feature to establish a reverse shell or persistence on a machine.
references:
    - https://defr0ggy.github.io/research/Abusing-Cloudflared-A-Proxy-Service-To-Host-Share-Applications/
author: Kamran Saifullah
date: 2024/05/26
tags:
    - attack.exfiltration
    - attack.t1567.001
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        DestinationHostname|endswith: '.trycloudflare.com'
    condition: selection
falsepositives:
    - Legitimate use of CloudFlare tunnel will also trigger this.
level: medium
