title: Directory Service Restore Mode(DSRM) Registry Key Modification
id: b61e87c0-50db-4b2e-8986-6a2be94b33b0
status: experimental
description: Detects the modification of DsrmAdminLogonBehavior Registry Key. By modifying this key, attackers can manipulate DSRM login access.
references:
    - https://adsecurity.org/?p=1785
author: Nischal Khadgi
date: 2024/06/07
tags:
    - attack.persistence
    - attack.t1556
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains:
            - '\System\CurrentControlSet\Control\Lsa\DsrmAdminLogonBehavior'
    condition: selection
falsepositives:
    - Unknown
level: high
