title: "Registry Key Modification to Turn on Script Execution"
id: 590ab290-7f07-44aa-a914-45a78062aa9b
description: "Detect when registry modification are made to Turn on Script Execution so that any script could be run."
author: Thurein Oo
date: 2023/10/18
references:
  - https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.PowerShell::EnableScripts
status: "experimental"
logsource:
  product: "windows"
  category: "registry_event"
detection:
  selection:
    TargetObject|contains: 'Software\Policies\Microsoft\Windows\PowerShell'
    TargetObject|endswith: '\EnableScripts'
    Details: '1'
  condition: "selection"
falsepositives:
- "Legitimate administrators' activity"
level: "medium"
tags:
- attack.execution
- attack.t1059
