title: Pandemic Registry Key
id: 47e0852a-cf81-4494-a8e6-31864f8c86ed
status: test
description: Detects Pandemic Windows Implant
references:
    - https://wikileaks.org/vault7/#Pandemic
    - https://twitter.com/MalwareJake/status/870349480356454401
author: Florian Roth (Nextron Systems)
date: 2017-06-01
modified: 2022-10-09
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: '\SYSTEM\CurrentControlSet\services\null\Instance'
    condition: selection
falsepositives:
    - Unknown
level: critical
