title: SilentProcessExit Monitor Registration for LSASS
id: 55e29995-75e7-451a-bef0-6225e2f13597
related:
    - id: 1f24c7c1-0b71-4e4e-8a6d-f863c9d8aa4a
      type: similar
description: Detects changes to the Registry in which a monitor program gets registered to dump the memory of the lsass.exe process
status: experimental
author: Florian Roth
references:
    - https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
    - https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
date: 2021/02/26
modified: 2022/09/07
tags:
    - attack.credential_access
    - attack.t1003.007
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: 'Microsoft\Windows NT\CurrentVersion\SilentProcessExit\lsass.exe'
    condition: selection
falsepositives:
    - Unlikely
level: critical
