title: Run Once Task Configuration in Registry
id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
status: test
description: Rule to detect the configuration of Run Once registry key. Configured payload can be run by runonce.exe /AlternateShellStartup
author: 'Avneet Singh @v3t0_, oscd.community'
references:
    - https://twitter.com/pabraeken/status/990717080805789697
    - https://lolbas-project.github.io/lolbas/Binaries/Runonce/
date: 2020/11/15
modified: 2022/04/04
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|startswith: 'HKLM\SOFTWARE\Microsoft\Active Setup\Installed Components'
        TargetObject|endswith: '\StubPath'
    filter_chrome:
        Details|startswith: '"C:\Program Files\Google\Chrome\Application\'
        Details|endswith: '\Installer\chrmstp.exe" --configure-user-settings --verbose-logging --system-level'
    filter_edge:
        Details|startswith:
            - '"C:\Program Files (x86)\Microsoft\Edge\Application\'
            - '"C:\Program Files\Microsoft\Edge\Application\'
        Details|endswith: '\Installer\setup.exe" --configure-user-settings --verbose-logging --system-level --msedge --channel=stable'
    condition: selection and not 1 of filter_*
falsepositives:
    - Legitimate modification of the registry key by legitimate program
level: medium
tags:
    - attack.defense_evasion
    - attack.t1112
