title: HybridConnectionManager Service Installation - Registry
id: ac8866c7-ce44-46fd-8c17-b24acff96ca8
status: experimental
description: Detects the installation of the Azure Hybrid Connection Manager service to allow remote code execution from Azure function.
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
modified: 2023/02/19
tags:
    - attack.resource_development
    - attack.t1608
logsource:
    category: registry_event
    product: windows
detection:
    selection_1:
        TargetObject|contains: '\Services\HybridConnectionManager'
    selection_2:
        EventType: 'SetValue'
        Details|contains: 'Microsoft.HybridConnectionManager.Listener.exe'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
