title: Chafer Activity - Registry
id: 7bdf2a7c-3acc-4091-9581-0a77dad1c5b5
related:
    - id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
      type: derived
status: test
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report in March 2018
references:
    - https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
modified: 2022/11/27
tags:
    - attack.persistence
    - attack.g0049
    - attack.t1053.005
    - attack.s0111
    - attack.t1543.003
    - attack.defense_evasion
    - attack.t1112
    - attack.command_and_control
    - attack.t1071.004
logsource:
    category: registry_event
    product: windows
detection:
    selection_reg1:
        TargetObject|endswith:
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\UMe'
            - 'SOFTWARE\Microsoft\Windows\CurrentVersion\UT'
    condition: selection_reg1
falsepositives:
    - Unknown
level: critical
