title: WSL InstallLocation Registry Key Modification
id: 83475063-b1c8-4774-9568-69bbda71a539
status: experimental
description: Detects the modification of the registry key realted to WSL InstallLocation. The key points to a path, in which any file named wsl.exe will be executed upon execution of wsl or bash.
references:
    - Add later
author: Liran Ravich
date: 2025-09-30
tags:
    - attack.defense-evasion
    - attack.t1112
    - attack.t1218
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|contains: '\Lxss\MSI\InstallLocation'
    condition: selection
falsepositives:
    - Unlikely
level: high
