title: ClickOnce Trust Prompt Modification
id: ac9159cc-c364-4304-8f0a-d63fc1a0aabb
status: experimental
description: ClickOnce trust prompt modification through the registry
references:
    - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
    - https://learn.microsoft.com/en-us/visualstudio/deployment/how-to-configure-the-clickonce-trust-prompt-behavior
author: '@SerkinValery'
date: 2022/06/08
tags:
    - attack.defense_evasion
    - attack.t1112
logsource:
    category: registry_event
    product: windows
detection:
    selection:
        TargetObject|startswith: 'HKLM\SOFTWARE\MICROSOFT\.NETFramework\Security\TrustManager\PromptingLevel'
    condition: selection
falsepositives:
    - Unknown
level: medium
