title: NetNTLM Downgrade Attack - Registry
id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
status: test
description: Detects NetNTLM downgrade attack
references:
    - https://web.archive.org/web/20171113231705/https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
author: Florian Roth (Nextron Systems), wagga
date: 2018-03-20
modified: 2024-12-03
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1112
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains|all:
            - 'SYSTEM\'
            - 'ControlSet'
            - '\Control\Lsa'
    selection_lmcompatibilitylevel:
        TargetObject|endswith: '\lmcompatibilitylevel'
        Details:
            - '0'
            - '1'
            - '2'
    selection_ntlmminclientsec:
        TargetObject|endswith:
            - '\NtlmMinClientSec'
            - '\RestrictSendingNTLMTraffic'
    condition: selection and 1 of selection_*
falsepositives:
    - Services or tools that set the values to more restrictive values
level: high
