title: Permissions granted over a Cloud Service Account
id: c08f2d1e-1944-4950-b78e-87eb91c0dd2e
status: experimental
description: Detects when permissions are granted over a Service Account
references:
    - https://cloud.google.com/iam/docs/reference/rest/v1/projects.serviceAccounts
    - https://cloud.google.com/iam/docs/granting-changing-revoking-access#granting_access_to_a_service_account
author: Eric Thomas @theEis4Extra
date: 03/21/2023
tags:
    - attack.t1098
    - attack.account_manipulation
logsource:
    product: gcp
    service: cloudaudit
detection:
    selection:
        protoPayload.serviceName: "iam.googleapis.com"
        protoPayload.methodName: "google.iam.admin.v1.SetIAMPolicy"
        protoPayload.authorizationInfo.permission: "iam.serviceAccounts.setIamPolicy"
        protoPayload.serviceData.policyDelta.bindingDeltas..action: "ADD"
        protoPayload.serviceData.policyDelta.bindingDeltas..role: "roles/iam.serviceAccountTokenCreator"
    condition: selection
falsepositives:
    - Legitimate permissions granted over a Service Account
    - Changes made by authorized personnel
level: high
