title: Google Cloud Re-identifies Sensitive Information.
id: 234f9f48-904b-4736-a34c-55d23919e4b7
description: Identifies when sensitive information is re-identified in google Cloud. 
author: Austin Songer @austinsonger
status: experimental
date: 2021/08/15
references:
    - https://cloud.google.com/dlp/docs/reference/rest/v2/projects.content/reidentify
logsource:
  service: gcp.audit
detection:
    selection:
        gcp.audit.method_name: projects.content.reidentify
    condition: selection
level: medium
tags:
    - attack.impact
    - attack.t1565
falsepositives:
 - Unknown
