title: GitHub Repository Pages Made Public
id: 346357dd-788a-4539-b31a-d19886d23335
status: experimental
description: Detects when GitHub Pages of a repository are made public, which may indicate potential unauthorized exposure of sensitive information or code.
author: Ivan Saakov
date: 2024-09-20
references:
  - https://docs.github.com/en/pages/getting-started-with-github-pages/creating-a-github-pages-site
tags:
  - attack.collection
  - attack.t1529
logsource:
  product: github
  service: audit
  definition: 'Requirements: The audit log streaming feature must be enabled to be able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
detection:
  selection:
    action: 'repo.pages_public'
  condition: selection
falsepositives:
  - Legitimate publishing of repository pages by authorized users
level: medium
