title: GitHub Repository Archived or Unarchived
id: dca8991c-cb16-4128-abf8-6b11e5cd156f
status: experimental
description: Detects when a GitHub repository is archived or unarchived, which may indicate unauthorized changes to repository status.
references:
    - https://docs.github.com/en/repositories/archiving-a-github-repository/archiving-repositories
    - https://www.sentinelone.com/blog/exploiting-repos-6-ways-threat-actors-abuse-github-other-devops-platforms
author: Ivan Saakov
date: 2024-09-20
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1098.001
    - attack.t1078.004
logsource:
    product: github
    service: audit
detection:
    selection:
        action:
            - archived
            - unarchived
    condition: selection
falsepositives:
    - Legitimate archived or unarchived GitHub repositories by authorized users
level: medium
