title: Excessive GitHub Repository Clones by a Single User
id: 9418984c-2e0e-4312-b1a6-7847a85e58e0
status: test
description: Detects when a user clones more than 10 different repositories within an hour, which may indicate potential data exfiltration or unauthorized activities.
author: Ivan Saakov
date: 2024-09-20
references:
  - https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/audit-log-events-for-your-organization
tags:
  - attack.exfiltration
  - attack.t1020
logsource:
  product: github
  service: audit
detection:
  selection:
    action: 'git.clone'
  timeframe: 1h
  condition: selection
  aggregation:
    group-by: user
    cardinality:
      field: repo
    op: '>='
    value: 10
falsepositives:
  - Legitimate activities where a user clones multiple repositories as part of their job responsibilities
level: high
