title: Github New Org Member Alert
id: 3908d64a-3c06-4091-b503-b3a94424533b
status: experimental
description: Detects when a new member is added or invited to the org.
author: Muhammad Faisal
date: 2023/01/29
references:
    - https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#dependabot_alerts-category-actions
tags:
    - attack.t1136.003
logsource:
    product: github
    service: audit
detection:
    selection:
        action:
            - 'org.add_member'
            - 'org.invite_member'
    condition: selection
fields:
    - 'action'
    - 'actor'
    - 'org'
    - 'actor_location.country_code'
    - 'transport_protocol_name'
    - 'repository'
    - 'repo'
    - 'repository_public'
    - '@timestamp'
falsepositives:
     - Organization approved new members
level: informational
