title: JXA In-memory Execution Via OSAScript
id: f0496233-6b00-430a-944b-5029006a796e
related:
    - id: f1408a58-0e94-4165-b80a-da9f96cf6fc3
      type: derived
status: experimental
description: Detects possible malicious execution of JXA in-memory via OSAScript
references:
    - https://redcanary.com/blog/applescript/
author: Sohan G (D4rkCiph3r)
date: 2023/01/31
tags:   
    - attack.t1059.002
    - attack.t1059.007
    - attack.execution
logsource:
    product: macos
    category: process_creation
detection: 
    selection:
        CommandLine|contains|all:
            - 'osascript'
            - '.js'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: medium
