title: JXA in-memory execution 
id: f1408a58-0e94-4165-b80a-da9f96cf6fc3
description: Detects possible malicious execution of JXA in-memory via OSAScript
date: 2023/01/31
author: Sohan G (D4rkCiph3r)
status: experimental 
references:
    - https://redcanary.com/blog/applescript/
logsource: 
    product: macos 
    category: process_creation 
detection: 
    selection1:
        CommandLine|contains: 
        - 'osascript'
    selection2:
        CommandLine|contains|all: 
        - '-l'
        - 'JavaScript'
    selection3:
        CommandLine|contains: '.js'
    selection4:
        CommandLine|contains|all:
        - '-e'
        - 'eval'
        - 'NSData.dataWithContentsOfURL'
    condition: selection1 and (selection2 or selection3) and selection4
fields: 
    - CommandLine 
falsepositives: 
    - Unknown
level: high 
tags:   
    - attack.t1059.002
    - attack.t1059.007
    - attack.execution
