title: System Network Discovery - macOS
id: 58800443-f9fc-4d55-ae0c-98a3966dfb97
status: test
description: Detects enumeration of local network configuration
author: remotephone, oscd.community
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
date: 2020/10/06
modified: 2022/07/07
logsource:
    product: macos
    category: process_creation
detection:
    selection1:
        Image:
            - '/usr/sbin/netstat'
            - '/sbin/ifconfig'
            - '/usr/sbin/ipconfig'
            - '/usr/libexec/ApplicationFirewall/socketfilterfw'
            - '/usr/sbin/networksetup'
            - '/usr/sbin/arp'
    selection2:
        Image: '/usr/bin/defaults'
        CommandLine|contains|all:
            - 'read'
            - '/Library/Preferences/com.apple.alf'
    condition: 1 of selection*
falsepositives:
    - Legitimate administration activities
level: informational
tags:
    - attack.discovery
    - attack.t1016
