title: JXA Payload Execution via OSAScript
id: f0496233-6b00-430a-944b-5029006a796e
description: Detects malicious JXA payload executions via OSAScript
date: 2023/01/31
author: Sohan G (D4rkCiph3r)
status: experimental 
references:
    - https://redcanary.com/blog/applescript/
logsource: 
    product: macos 
    category: process_creation 
detection: 
    selection:
        CommandLine|contains|all:
            - 'osascript'
            - '.js'
    condition: selection
fields: 
    - CommandLine 
falsepositives: 
    - Few applications might contain scripts
level: medium 
tags:   
    - attack.t1059.002
    - attack.t1059.007
    - attack.execution
