title: 'File Time Attribute Change'
id: 88c0f9d8-30a8-4120-bb6b-ebb54abcf2a0
status: test
description: 'Detect file time attribute change to hide new or changes to existing files.'
author: 'Igor Fits, Mikhail Larin, oscd.community'
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.006/T1070.006.md
date: 2020/10/19
modified: 2021/11/27
logsource:
  product: macos
  category: process_creation
detection:
  selection1:
    Image|endswith: '/touch'
  selection2:
    CommandLine|contains:
      - '-t'
      - '-acmr'
      - '-d'
      - '-r'
  condition: selection1 and selection2
falsepositives:
  - Unknown
level: medium
tags:
  - attack.defense_evasion
  - attack.t1070.006
