title: MacOS Suspicious Launchctl Execution
id: ae9d710f-dcd1-4f75-a0a5-93a73b5dda0e
status: experimental
description: Detects execution of programs as Launch Agents or Launch Daemons using launchctl on macOS
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1569.001/T1569.001.md
    - https://www.sentinelone.com/labs/20-common-tools-techniques-used-by-macos-threat-actors-malware/
author: Pratinav Chandra
date: 2024/03/22
tags:
    - attack.execution
    - attack.persistence
    - attack.t1569.001
    - attack.T1543.001
    - attack.T1543.004
logsource:
    category: process_creation
    product: macos
detection:
    launchctl_command:
        Image|endswith: '/launchctl'
        CommandLine|contains: 
            - 'submit'
            - 'load'
            - 'start'
    condition: launchctl_command
falsepositives:
    - Legitimate activities
level: medium
