title: Credentials from Password Stores - Keychain
id: b120b587-a4c2-4b94-875d-99c9807d6955
status: test
description: Detects credential access and password extraction from macOS Keychain using the security command-line utility
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.001/T1555.001.md
    - https://gist.github.com/Capybara/6228955
author: Tim Ismilyaev, oscd.community, Florian Roth (Nextron Systems), Niicolaa
date: 2020-10-19
modified: 2026-01-30
tags:
    - attack.credential-access
    - attack.t1555.001
logsource:
    category: process_creation
    product: macos
detection:
    selection_binary:
        Image|endswith: '/security'
    selection_dump:
        CommandLine|contains:
            - 'dump-keychain'
    selection_find_password:
        CommandLine|contains:
            - 'find-internet-password'
            - 'find-generic-password' # this one is quiet noisy
    selection_find_args:
        CommandLine|contains:
            - ' -w'
            - ' -g'
    selection_export:
        CommandLine|contains:
            - 'export'
    filter_export_public:
        CommandLine|contains:
            - ' -t certs'
            - ' -t pubKeys'
    filter_export_public_override:
        CommandLine|contains:
            - 'allKeys'
            - 'privKeys'
            - 'identities'
    condition: selection_binary and ((selection_find_password and selection_find_args) or (selection_export and not (filter_export_public and not filter_export_public_override)))
falsepositives:
    - Legitimate administration activities
level: medium
