title: OSAScript in Macros
id: 69483748-1525-4a6c-95ca-90dc8d431b68
status: experimental
description: Detects possible malicious execution of macros via OSAScript
references:
    - https://redcanary.com/blog/applescript/
author: Sohan G (D4rkCiph3r)
date: 2023/01/31
tags:
    - attack.t1059.002
    - attack.t1137.002
    - attack.t1204.002
    - attack.execution
    - attack.persistence
logsource:
    product: macos
    category: process_creation
detection:
    selection_parent_process: #Microsoft Office
        ParentImage|contains: 
            - 'Microsoft Word'
            - 'Microsoft Excel'
            - 'Microsoft PowerPoint'
    selection_process:
        Image|contains:
            - '/osascript'
            - '/osacompile'
            - '/sh'
            - '/bash'
            - '/zsh'
            - '/curl'
    condition: all of selection_*
fields:
    - ParentImage
    - Image
falsepositives:
    - Unknown
level: high
