title: MacOS JAMF Execution
id: 1bc2e6c5-0885-472b-bed6-be7ej
status: test
description: Utilising the MDM solution JAMF to create user accounts and run commands included in MythicC2. You can bypass security controls to remove application control polices and also create and elevate user accounts.
references:
    - https://github.com/MythicAgents/typhon/
    - https://www.zoocoup.org/casper/jamf_cheatsheet.pdf
author: Jay Pandit
date: 2023/07/25
tags:
    - attack.execution
    - attack.T1136
logsource:
    category: process_creation
    product: macos
detection:
    selection_start:
        CommandLine|startswith:
            - 'jamf'
    selection_param:
        # Image|endswith: '/jamf'
        CommandLine|contains:
            - 'createAccount'
            - 'manage'
            - 'removeFramework'
            - 'removeMdmProfile'
            - 'resetPassword'
            - 'setComputerName'

    condition: selection_jamf and 1 of selection_param
falsepositives:
    - Legitimate use of the JAMF CLI tool by IT support and Admins
level: medium
