title: Clipboard data collection via OSAScript 
id: 7794fa3c-edea-4cff-bec7-267dd4770fd7
description: Detects possible collection of data from clipboard via execution of osascript
date: 2023/01/31
author: Sohan G (D4rkCiph3r)
status: experimental 
references:
    - https://www.sentinelone.com/blog/how-offensive-actors-use-applescript-for-attacking-macos/
logsource: 
    product: macos 
    category: process_creation 
detection:   
    selection:
        CommandLine|contains|all: 
        - 'osascript'
        - '-e'
        - 'clipboard' 
    condition: selection
fields: 
    - CommandLine 
falsepositives: 
    - Unknown #Very unlikely to be used by users in general
level: high 
tags:   
    - attack.t1115
    - attack.t1059.002
    - attack.collection
    - attack.execution
