title: Enable the Guest Account
status: experimental
description: Detects attempts to enable the guest account using the sysadminctl utility
references:
    - https://ss64.com/osx/sysadminctl.html
author: Sohan G (D4rkCiph3r)
date: 2023/02/18
tags:
    - attack.t1078
    - attack.t1078.001
    - attack.initial_access
logsource:
    category: process_creation
    product: macos
detection:
    selection:
        Image|endswith: '/sysadminctl'
        CommandLine|contains: 'guestAccount on' #by default the guest account is not active
    condition: selection
falsepositives:
    - Unknown
level: low
