title: System Information Discovery Using sw_vers
id: 5de06a6f-673a-4fc0-8d48-bcfe3837b033
status: experimental
description: Detects the use of sw_vers for system information discovery
references:
    - https://www.virustotal.com/gui/file/d3fa64f63563fe958b75238742d1e473800cb5f49f5cb79d38d4aa3c93709026/behavior
    - https://www.virustotal.com/gui/file/03b71eaceadea05bc0eea5cddecaa05f245126d6b16cfcd0f3ba0442ac58dab3/behavior
    - 'vt query = behavior_processes:"sw_vers" and (behavior_processes:"-productVersion" or behavior_processes:"-productName" or behavior_processes:"-buildVersion") tag:dmg p:5+'
author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2023/12/05
tags:
    - attack.discovery
    - attack.t1082
logsource:
    product: macos
    category: process_creation
detection:
    selection_image:
        Image|endswith:
            - '/usr/bin/sw_vers'
            - '/sw_vers'
    selection_options:
        CommandLine|contains:
            - '-productVersion'
            - '-productName'
            - '-buildVersion'
    condition: all of selection*
falsepositives:
    - Legitimate administration activities
level: medium