title: Clipboard data collection via OSAScript 
id: 7794fa3c-edea-4cff-bec7-267dd4770fd7
description: Detects possible collection of data from clipboard via execution of osascript
date: 2023/01/31
author: Sohan G (D4rkCiph3r)
status: stable 
references:
- https://attack.mitre.org/techniques/T1115/
- https://www.sentinelone.com/blog/how-offensive-actors-use-applescript-for-attacking-macos/
logsource: 
  product: macos 
  category: process_creation 
detection: 
  selection1: # Direct process relation with CLI
    Image|endswith: '/osascript' 
    CommandLine|contains|all:
    - 'osascript'
    - '-e'
    - 'clipboard'  
  selection2: # Misc process relation (ex: from sh, bash, python)
    CommandLine|contains|all: 
    - 'osascript'
    - '-e'
    - 'clipboard' 
  condition: selection1 OR selection2
fields: 
- Image
- CommandLine 
falsepositives: 
- Unknown #Very unlikely to be used by users in general
level: medium 
tags:   
- attack.t1115
- attack.t1059.002
- attack.collection
- attack.execution
