title: Mail Hiding Activity in O365
id: d3577be1-42c9-44a7-b56e-2e8de97349d3
status: experimental
description: Detects email hiding activity in O365 Audit logs.
references:
    - https://redcanary.com/threat-detection-report/techniques/email-hiding-rules/
    - https://learn.microsoft.com/it-it/powershell/module/exchangepowershell/new-inboxrule?view=exchange-ps
author: Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-01-09
tags:
    - attack.defense-evasion
    - attack.t1564.008
    - detection.threat-hunting
logsource:
    service: audit
    product: m365
    definition: "Requirements: The 'Parameters' field is a list of dict. A correct mapping to the 'Value' field inside is recommended to avoid greedy search"
detection:
    selection:
        Operation|contains: 'New-InboxRule'
        Parameters|contains:
            - 'DeleteMessage'
            - 'MarkAsRead'
            - 'MoveToFolder'
            - 'SubjectOrBodyContainsWords'
    condition: selection
falsepositives:
    - False positives are expected from legitimate mail hiding rules
level: medium
