title: Arbitrary Shell Command Execution via Settingcontent-Ms
description: The .SettingContent-ms file type was introduced in Windows 10 and allows a user to create "shortcuts" to various Windows 10 setting pages. These files are simply XML and contain paths to various Windows 10 settings binaries.
author: Sreeman
condition: selection
references:
    - https://posts.specterops.io/the-tale-of-settingcontent-ms-files-f1ea253e4d39
date: 2020/03/13
logsource: 
  Service: Security
  product: Windows
tags: 
  - attack.t1204
  - attack.t1193
  - attack.execution
  - attack.initial_access
detection:
    selection:
        CommandLine|contains: '.SettingContent-ms'
    filter:
        FilePath|contains:
            - 'immersivecontrolpanel'
    condition: selection and not filter
falsepositives: 
  - Unknown
fields: 
  - ParentProcess
  - CommandLine
  - ParentCommandLine
level: medium
