--- 
Description: "Application Virtualization Utility is included with Microsoft Office.We are able to abuse “AppVLP” to execute shell commands. Normally, this binary is used for Application Virtualization, but we can use it as an abuse binary to circumvent the ASR file path rule folder or to mark a file as a system file"
author: Sreeman
condition: selection
date: 2020/13/03
detection: 
  selection:
    CommandLine|re:
      - (?i).*appvlp.exe.*(cmd.exe|powershell.exe).*(.sh|.exe|.dll|.bin|.bat|.cmd|.js|.msh|.reg|.scr|.ps|.vb|.jar|.pl|.inf)
falsepositives: 
  - Unknown
fields: 
  - ParentProcess
  - CommandLine
  - ParentCommandLine
level: medium
logsource: 
  Service: Security
  product: Windows
tags: 
  - attack.t1218
  - attack.defense_evasion
  - attack.execution
title: "Using AppVLP to circumvent the ASR file path rule"
