title: CMSTP Execution Process Creation
id: 7d4cdc5a-0076-40ca-aac8-f7e714570e47
status: stable
description: Detects various indicators of Microsoft Connection Manager Profile Installer execution
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1191          # an old one
    - attack.t1218.003
    - attack.g0069
    - car.2019-04-001
author: Nik Seetharaman
date: 2018/07/16
modified: 2020/12/23
references:
    - https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
fields:
    - CommandLine
    - ParentCommandLine
    - Details
falsepositives:
    - Legitimate CMSTP use (unlikely in modern enterprise environments)
level: high
---
logsource:
    product: windows
    category: registry_event
detection:
    # Registry Object Add
    selection2:
        TargetObject: '*\cmmgr32.exe*'
        EventType: 'CreateKey'
    # Registry Object Value Set
    selection3:
        TargetObject: '*\cmmgr32.exe*'
---
logsource:
    product: windows
    category: process_access
detection:
    selection4:
        Calltrace: '*cmlua.dll*'
---
=======
>>>>>>> ce0111aa6a210133e6ac4f3ffb558dd22003fc15:rules/windows/process_creation/cmstp_execution.yml
logsource:
    category: process_creation
    product: windows
detection:
    # CMSTP Spawning Child Process
    selection:
        ParentImage|endswith: '\cmstp.exe'
    condition: selection
