author: Sreeman
description: Detects dropping of dll files in system32 that may be used to retrieve
  user credentials from LSASS
detection:
  condition: selection
  selection_cmdline:
    CommandLine|contains|all:
    - HKLM\SYSTEM\CurrentControlSet\Control\Lsa
    - scecli\0*
    - reg add
falsepositives:
- unknown
level: medium
logsource:
  category: process_creation
  product: windows
reference:
- https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/
- https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter
status: experimental
tags:
- attack.credential access
- attack.t1174
title: Dropping of password filter DLL
