title: MiniDumpWriteDump via COM+
description: Detect dump memory via minidump
references:
    - https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
tags:
    - attack.credential_access
    - attack.t1003
status: experimental
author:  Aleksey Potapov, oscd.community
date: 2019/10/22
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\rundll32.exe'
        CommandLine: '*comsvcs.dll*minidump*'
    condition: selection
falsepositives:
    - unknown
level: critical