title: LOLBins process creations with Wmiprvse parent process. (Security Event Logs)
description: This rule will monitor LOLBin process creations by wmiprvse. Add more LOLBins to rule logic if needed.  
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
author: "Idea by: Vadim Khrykov"
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defence_evasion
status: experimental
Date: 2021/23/8
logsource:
  product: Windows
  service: security
  category: process_creation
detection:
  description: add more LOLBins to the rules logic of your choice.
  selection1:
    EventLog: security
    EventID: 4688
  selection2:
    NewProcessName|endswith:
      - 'regsvr32'
      - 'rundll32'
      - 'msiexec'
      - 'mshta'
      - 'verclsid'
  selection3:
    ParentProcessName|endswith:
    - "\\wbem\\WmiPrvSE.exe"
  condition: selection1 AND selection2 AND selection3
falsepositives:
- ""
level: high