title: Suspicious Usage of Tar Compression Tool
id: f42f1fb9-0549-4cd4-9256-1b219a8b589d
status: experimental
description: Monitor for newly constructed processes and/or command-lines that aid in compression or encrypting data that is collected prior to exfiltration, using tar. Before Exfiltration that an adversary has Collection, it is very likely that a Archive Collected Data will be created, so that transfer times are minimized and fewer files are transmitted.
references:
    - https://attack.mitre.org/techniques/T1560/001/
author: AdmU3
date: 2023/12/13
tags:
    - attack.exfiltration
    - attack.t1560
    - attack.collection
    - attack.t1560.001
logsource:
    product: windows
    category: process_creation
    definition:
        - 'Requirements: windows Process logging must be enabled and process command line'
detection:
    # Note: Compress/uncompress Data using tar        
    selection_tar_img:
        - Description|contains: 'tar'
        - Image|endswith:
              - '\tar.exe'
        - OriginalFileName:
              - 'tar.exe'
    selection_tar_compress:
        CommandLine|contains:
            - 'c'
            - 'v'
            - 'z'
            - 'f'
    selection_tar_uncompress:
        CommandLine|contains:
            - 'z'
            - 'x'
            - 'v'
            - 'f'
    condition:
        - selection_tar_img and (selection_tar_compress or selection_tar_uncompress)
falsepositives:
    - Legitmate use of archiving software
level: High
