title: PowerShell Web Download and Execution
id: 85b0b087-eddf-4a2b-b033-d771fa2b9775
status: experimental
description: Detects suspicious ways to download files or content using PowerShell
author: Florian Roth
date: 2022/03/24
references:
   - https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/main/Download-Cradles.cmd
logsource:
   product: windows
   category: process_creation
detection:
   selection:
      CommandLine|contains:
         - '.DownloadString('
         - '.DownloadFile('
   execution:
      CommandLine|contains:
         - 'IEX('
         - 'IEX ('
         - 'I`EX'
         - 'IE`X'
         - 'I`E`X'
         - ' | IEX'
         - '|IEX '
         - 'Invoke-Execution'
         - ';iex $'
   condition: selection and execution
falsepositives:
   - Scripts or tools that download files and execute them
level: high
