title: Application Whitelisting Bypass Via Microsoft.Workflow.Compiler.EXE
id: 3061a635-282a-4d59-8e62-0637949d8389
status: experimental
description: |
    Detects execution of "Microsoft.Workflow.Compiler.exe", a deprecated and signed .NET Framework utility that can compile and execute
    arbitrary C#/VB code provided in an XOML/XML input file. Adversaries abuse it to run unsigned code and bypass application whitelisting (AWL).
    The utility has no legitimate interactive use on modern endpoints, so any execution is highly suspicious.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Microsoft.Workflow.Compiler/
    - https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
author: EinLamYe
date: 2026-06-29
tags:
    - attack.execution
    - attack.stealth
    - attack.t1127
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\Microsoft.Workflow.Compiler.exe'
        - OriginalFileName: 'Microsoft.Workflow.Compiler.exe'
    condition: selection_img
falsepositives:
    - Rare legacy build/automation pipelines that still rely on Windows Workflow Foundation compilation
level: high
