title: PsExec/PAExec Escalation to LOCAL SYSTEM
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
status: experimental
description: Detects suspicious flags used by PsExec and PAExec to escalate a command line to LOCAL_SYSTEM rights
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.poweradmin.com/paexec/
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth
date: 2021/11/23
modified: 2022/08/24
logsource:
    category: process_creation
    product: windows
detection:
    selection: # Escalation to LOCAL_SYSTEM
        CommandLine|endswith: ' -s cmd.exe'
        CommandLine|contains:
            - 'PsExec'
            - 'PAExec'
            - 'accepteula'
            - 'cmd /c '
            - 'cmd /k '
    condition: selection
falsepositives:
    - Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance purposes (rare)
level: high
tags:
    - attack.resource_development
    - attack.t1587.001
