title: Unusual Parent Process for cmd.exe
id: 4b991083-3d0e-44ce-8fc4-b254025d8d4b
status: experimental
description: Detects suspicious parent process for cmd.exe
references:
    - https://www.elastic.co/guide/en/security/current/unusual-parent-process-for-cmd.exe.html
author: Tim Rauch
date: 2022/09/21
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\cmd.exe'
        ParentImage|endswith:
            - '\lsass.exe'
            - '\csrss.exe'
            - '\epad.exe'
            - '\regsvr32.exe'
            - '\dllhost.exe'
            - '\LogonUI.exe'
            - '\wergmgr.exe'
            - '\spoolsv.exe'
            - '\jucheck.exe'
            - '\jusched.exe'
            - '\ctfmon.exe'
            - '\taskhostw.exe'
            - '\GoogleUpdate.exe'
            - '\sppsvc.exe'
            - '\sihost.exe'
            - '\slui.exe'
            - '\SIHClient.exe'
            - '\SearchIndexer.exe'
            - '\SearchProtocolHost.exe'
            - '\FlashPlayerUpdateService.exe'
            - '\WerFault.exe'
            - '\WUDFHost.exe'
            - '\unsecapp.exe'
            - '\wlanext.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium
