title: Suspicious Credential Guard Registry Keys Deletion
id: c629cc9b-8ddf-4282-9f10-6934ce3ea1ee
related:
    - id: d645ef86-2396-48a1-a2b6-b629ca3f57ff
      type: similar
status: experimental
description: |
    Detects suspicious deletion of registry keys related to Windows Credential Guard and Device Guard.
    Credential Guard uses virtualization-based security to isolate secrets so that only privileged system software can access them.
    In order to disable Credential Guard, attackers may delete specific registry keys associated with its configuration and enforcement.
references:
    - https://github.com/DambergC/SaveFolder/blob/90e945eba80fae85f2d54b4616e05a44ec90c500/Cygate%20Installation%20tool%206.22/Script/OSD/OSDeployment-CredentialGuardDisable.ps1#L50
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-26
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
              - '\reg.exe'
              - '\powershell.exe'
              - '\pwsh.exe'
        - OriginalFileName:
              - 'reg.exe'
              - 'PowerShell.EXE'
              - 'pwsh.dll'
    selection_delete:
        CommandLine|contains:
            - 'delete '
            - 'del '
            - 'Remove-ItemProperty '
            - 'rp '  # Remove-ItemProperty Alias
    selection_key_base:
        CommandLine|contains:
            - 'CurrentControlSet\Control\DeviceGuard'
            - 'CurrentControlSet\Control\LSA'
            - 'Software\Policies\Microsoft\Windows\DeviceGuard'
    selection_key_specific:
        CommandLine|contains:
            - 'EnableVirtualizationBasedSecurity'
            - 'RequirePlatformSecurityFeatures'
            - 'LsaCfgFlags'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_susp_credential_guard_registry_deleted/info.yml
