title: Export Function 'DllRegisterServer' Called - Rundll32/Regsvr32
id: d81a9fc6-55db-4461-b962-0e78fea5b0ad
related:
    - id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
      type: similar
    - id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed # Renamed rundll32
      type: obsoletes
status: experimental
description: Detects when the DLL export function 'DllRegisterServer' is called in the commandline by Rundll32 (explicit) or Regsvr32 (implicit). The DLL is located in a non-standard path. Not every instance is considered malicious, but it will capture malicious use of it. Both executables are natively found in C:\Windows\system32 and C:\Windows\syswow64.
references:
    - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
    - https://www.virustotal.com/gui/file/94816439312563db982cd038cf77cbc5ef4c7003e3edee86e2b0f99e675ed4ed/behavior
    - https://www.virustotal.com/gui/search/type%253Apedll%2520exports%253ADllRegisterServer%2520positives%253A5%252B%2520have%253Acomments%2520filename%253A*.dll/files
    - https://learn.microsoft.com/en-us/windows/win32/api/olectl/nf-olectl-dllregisterserver
author: Andreas Braathen (mnemonic.io)
date: 2023/09/01
tags:
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_rundll32_image:
        - Image|endswith: '\rundll32.exe'
        - OriginalFileName: 'RUNDLL32.EXE'
    selection_rundll32_cmdline:
        CommandLine|contains: 'DllRegisterServer'

    selection_regsvr32_image:
        - Image|endswith: '\regsvr32.exe'
        - OriginalFileName: 'REGSVR32.EXE'
    selection_regsvr32_cmdline:
        CommandLine|contains: ' /s ""'

    filter_paths:
        CommandLine|contains:
            - ':\Program Files\'
            - ':\Program Files (x86)'

    condition: (all of selection_rundll32* or all of selection_regsvr32*) and not 1 of filter_*
falsepositives:
    - Is legitimately used as part of e.g. application install, but likely not from temporary paths.
level: medium
