title: Scheduled Task Creation Masquerading as System Processes
id: 9f8573c9-22b4-40e3-89c1-72bc2b8d49ab
status: experimental
description: Detects the creation of scheduled tasks that involve system processes, which may indicate malicious actors masquerading as or abusing these processes to execute payloads or maintain persistence.
references:
    - https://tria.ge/241015-l98snsyeje/behavioral2
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-02-05
tags:
    - attack.persistence
    - attack.t1053.005
    - attack.defense-evasion
    - attack.t1036.004
    - attack.t1036.005
logsource:
    category: process_creation
    product: windows
detection:
    selection_schtasks:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains|windash: ' /create '
        CommandLine|contains:
            - ' conhost'
            - ' svchost'
            - ' lsass'
            - ' regsvr32'
            - ' rundll32'
            - ' taskhost'
            - ' spoolsv'
            - ' explorer'
            - ' services'
            - ' winlogon'
            - ' wininit'
            - ' lsm'
            - ' msiexec'
            - ' taskeng'
            - ' dwm.exe'
            - ' audiodg'
            - ' mmc'
    condition: selection_schtasks
falsepositives:
    - Legitimate system administration tasks scheduling trusted system processes.
level: high
