title: FakeUpdates/SocGholish Malware Detection
id: 97805087-93ab-4203-b5cb-287cda6aecaa
description: Detects initial execution of FakeUpdates/SocGholish malware via wscript that later executes commands via cmd or powershell.
status: experimental
date: 2022/06/16
author: '@kostastsale'
references:
    - https://twitter.com/th3_protoCOL/status/1536788652889497600
    - https://twitter.com/1ZRR4H/status/1537501582727778304
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        ParentImage|endswith:
            - '\wscript.exe'
        Image|endswith:
            - '\cmd.exe'
        CommandLine|contains:
            - '/c'
    selection2:
        ParentImage|endswith:
            - '\wscript.exe'
        Image|endswith:
            - '\powershell.exe'
    selection3:
        ParentCommandLine|contains|all:
            - 'Appdata\Local\Temp'
            - '.zip'
            - 'update'
            - '.js'
    selection4:
        ParentCommandLine|contains:
            - 'Chrome'
            - 'Edge'
            - 'Firefox'
            - 'Opera'
            - 'Brave' # Not seen in campaigns
            - 'Vivaldi' # Not seen in campaigns
    condition: (selection1 or selection2) and selection3 and selection4
falsepositives:
    - Unlikely
level: high
tags:
    - attack.execution
    - attack.T1059.001
