title: Port Forwarding Attempt Via SSH And RCE Enabled
id: 59cad80b-cbb6-43bd-9d89-03a8dbb51e19
related:
    - id: 327f48c1-a6db-4eb8-875a-f6981f1b0183
status: experimental
description: Detects SSH tunnel port forwarding to a local port with remote code execution capabilities and insecure connection
references:
    - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
author: X__Junior (Nextron Systems)
date: 2023/11/03
tags:
    - attack.command_and_control
    - attack.lateral_movement
    - attack.t1572
    - attack.t1021.001
    - attack.t1021.004
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\ssh.exe'
    selection_cli_1:
        CommandLine|contains|all:
            - ' -R ' # Remote port forwarding
            - '-o StrictHostKeyChecking=no' # Disables strict host key checking, which could be insecure as it allows connections to hosts with unknown host keys.
    selection_cli_filter:
        - ' - N ' # Indicates that this SSH session will not execute a remote command, typically used for port forwarding.
    condition: selection_img and all of selection_cli_* and not selection_cli_filter
falsepositives:
    - Administrative activity
level: high
