title: Proc Creation Win Renamed Vmnat.exe
id: 7b4f794b-590a-4ad4-ba18-7964a2832205
status: experimental
description: Detects renamed vmnat.exe (Legitimate file from VMware workstation) for DLL side-loading
author: elhoim
date: 2022/09/09
references:
    - https://twitter.com/malmoeb/status/1525901219247845376
tags:
    - attack.defense_evasion
    - attack.t1574.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: 'vmnat.exe'
    filter:
        Image|endswith: 'vmnat.exe'
    condition: selection and not filter
falsepositives:
     - Unknown
level: high
