title: Imports Registry Key From a File
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
status: test
description: Detects the import of the specified file to the registry with regedit.exe.
author: Oddvar Moe, Sander Wiebing, oscd.community
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
date: 2020/10/07
modified: 2022/07/07
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\regedit.exe'
        CommandLine|contains:
            - ' /i '
            - ' /s '
            - '.reg'
    filter:
        CommandLine|contains:
            - ' /e '
            - ' /a '
            - ' /c '
            - ' -e '
            - ' -a '
            - ' -c '
    filter_2:
        CommandLine|re: ':[^ \\\\]'     # to avoid intersection with ADS rule
    condition: selection and not all of filter*
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Legitimate import of keys
    - Evernote
level: medium
tags:
    - attack.t1112
    - attack.defense_evasion
