title: Suspicious Explorer Child Of Regsvr32
id: 6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
status: experimental
level: low
description: Suspicious explorer.exe child of regsvr32.exe
references:
    - https://redcanary.com/blog/intelligence-insights-april-2022/
author: elhoim
date: 2022/05/05
logsource:
    category: process_creation
    product: windows
detection:
    status:
        ParentImage|endswith: '\regsvr32.exe'
        Image|endswith: '\epxlorer.exe'
    condition: selection
falsepositives:
    - Unknown
tags:
    - attack.defense_evasion
    - attack.t1218.010
