title: Use of Mftrace.exe
id: 3d48c9d3-1aa6-418d-98d3-8fd3c01a564e
status: experimental
description: The "Trace log generation tool for Media Foundation Tools" (Mftrace.exe) can be used to execute arbitrary binaries
author: Nasreddine Bencherchali
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Mftrace/
date: 2022/06/09
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\mftrace.exe'
        - OriginalFileName: 'mftrace.exe'
    condition: selection
falsepositives:
  - Legitimate use for tracing purposes
level: medium
tags:
    - attack.defense_evasion
    - attack.t1127
