title: Curl Start Combination
id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
status: test
description: Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and later.
author: Sreeman, Nasreddine Bencherchali
references:
    - https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
date: 2020/01/13
modified: 2022/08/02
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' /c '
            - 'curl '
            - 'http'
            - '-o'
            - '&'
    condition: selection
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Administrative scripts (installers)
level: high
tags:
    - attack.execution
    - attack.t1218
    - attack.command_and_control
    - attack.t1105
