title: HackTool - Ligolo-ng Tunneling Tool Execution
id: 0074da8e-5b3f-456b-9bf9-70beaf4bfb0d
status: experimental
description: |
    Detects execution of Ligolo-ng tunneling agent or proxy used for network pivoting. Ligolo-ng is a tool that allows attackers to create encrypted tunnels for command-and-control communication or lateral movement.
    Threat actors may use Ligolo-ng to bypass network segmentation and access internal resources on compromised networks.
references:
    - https://github.com/nicocha30/ligolo-ng
    - https://docs.ligolo.ng/
author: MAB, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2026-02-19

tags:
    - attack.command-and-control
    - attack.t1572
    - attack.t1090.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|contains: 'ligolo-ng'
        - CommandLine|contains: 'ligolo-ng'
        - Hashes|contains:
              - 'IMPHASH=B196866F0BF37F1F128FA153413B744'
              - 'IMPHASH=C984D366A3CC28220C89AB860AB9FD47'
    condition: selection
falsepositives:
    - Legitimate use of Ligolo-ng for remote management; should be rare in enterprise environments
level: high
