title: Suspicious Diantz Alternate Data Stream Execution 
id: 6b369ced-4b1d-48f1-b427-fdc0de0790bd
status: experimental
description: Compress target file into a cab file stored in the Alternate Data Stream (ADS) of the target file.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Diantz/
tags:
    - attack.defense_evasion
    - attack.t1564.004
author: frack113
date: 2021/11/26
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - diantz.exe
            - .cab
        CommandLine|re: ':[^\\\\]'
    condition: selection 
falsepositives:
    - Very Possible
level: medium
