title: Change Default File Association To Executable
id: ae6f14e6-14de-45b0-9f44-c0986f50dc89
related:
    - id: 3d3aa6cd-6272-44d6-8afc-7e88dfef7061
      type: derived
status: experimental
description: Detects when a program changes the default file association of any extension to an executable
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/assoc
author: Nasreddine Bencherchali
date: 2022/06/28
modified: 2022/11/18
tags:
    - attack.persistence
    - attack.t1546.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'cmd'
            - 'assoc '
            - 'exefile'
        CommandLine|contains:
            - ' /c '
            - ' /r '
            - ' /k '
    filter:
        CommandLine|contains: '.exe=exefile'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
