title: Suspicious Recon Activity Using Findstr Keywords
id: 47e4bab7-c626-47dc-967b-255608c9a920
status: experimental
description: Detects usage of findstr with the "EVERYONE" keyword. This is often used in combination with icacls to look for misconfigured files or folders permissions
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
author: Nasreddine Bencherchali
date: 2022/08/12
tags:
    - attack.credential_access
    - attack.t1552.006
logsource:
    category: process_creation
    product: windows
detection:
    selection_findstr_img:
        Image|endswith: '\findstr.exe'
        OriginalFileName: 'FINDSTR.EXE'
    selection_findstr_cli:
        CommandLine|contains:
            - '"Everyone"'
            - "'Everyone'"
    selection_special:
        CommandLine|contains|all:
            # Example CLI would be: icacls "C:\Program Files\*" 2>nul | findstr "(M)" | findstr "Everyone"
            # You could extend it for other groups and users
            #   Example: icacls "C:\Program Files\*" 2>nul | findstr "(M)" | findstr "BUILTIN\Users"
            - 'icacls '
            - 'findstr '
            - 'Everyone'
    condition: all of selection_findstr_* or selection_special
falsepositives:
    - Unknown
level: medium
