title: Suspicious Schtasks Schedule Type
id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
description: Detects scheduled task creations or modification to be run with high privileges on a suspicious schedule type
status: experimental
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
tags:
    - attack.execution
    - attack.t1053.005
author: Nasreddine Bencherchali
date: 2022/08/31
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - Image|endswith: '\schtasks.exe'
        - OriginalFileName: 'schtasks.exe'
    selection_time:
        CommandLine|contains:
            - ' ONLOGON '
            - ' ONSTART '
            - ' ONCE '
            - ' ONIDLE '
    selection_privs:
        CommandLine|contains:
            - 'NT AUT' # This covers the usual NT AUTHORITY\SYSTEM
            - ' SYSTEM' # SYSTEM is a valid value for schtasks hence it gets it's own value with space
            - 'HIGHEST'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
