title: Suspicious Parent Double Extension File Execution
id: 5e6a80c8-2d45-4633-9ef4-fa2671a39c5c
related:
    - id: 1cdd9a09-06c9-4769-99ff-626e2b3991b8 # Image/CommandLine
      type: derived
status: test
description: Detect execution of suspicious double extension files in ParentCommandLine
references:
    - https://www.virustotal.com/gui/file/7872d8845a332dce517adae9c3389fde5313ff2fed38c2577f3b498da786db68/behavior
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bluebottle-banks-targeted-africa
author: frack113, Nasreddine Bencherchali (Nextron Systems), MalGamy (Nextron Systems)
date: 2023-01-06
modified: 2024-10-02
tags:
    - attack.defense-evasion
    - attack.t1036.007
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - ParentImage|endswith:
              - '.doc.exe'
              - '.docx.exe'
              - '.xls.exe'
              - '.xlsx.exe'
              - '.ppt.exe'
              - '.pptx.exe'
              - '.rtf.exe'
              - '.pdf.exe'
              - '.txt.exe'
              - '.jpg.exe'
              - '.png.exe'
              - '.zip.exe'
              - '.rar.exe'
              - '.mp4.exe'
              - '.mp3.exe'
              - '.avi.exe'
              - '.mov.exe'
              - '.gif.exe'
              - '.bmp.exe'
              - '.csv.exe'
              - '.log.exe'
              - '.dll.exe'
              - '.bat.exe'
              - '.html.exe'
              - '.php.exe'
              - '.ps1.exe'
              - '.vbs.exe'
              - '.js.exe'
              - '.msi.exe'
              - '.iso.exe'
              - '.tar.exe'
              - '.7z.exe'
              - '.apk.exe'
              - '.bin.exe'
              - '.deb.exe'
              - '.rpm.exe'
              - '.sys.exe'
              - '.svg.exe'
              - '.tiff.exe'
              - '.ini.exe'
              - '.sql.exe'
              - '.json.exe'
              - '.xml.exe'
              - '.dat.exe'
              - '.tmp.exe'
              - '.bak.exe'
              - '.config.exe'
              - '.psd.exe'
              - '.mkv.exe'
              - '.flv.exe'
              - '.ogg.exe'
              - '.wav.exe'
              - '.mid.exe'
              - '.ttf.exe'
              - '.otf.exe'
              - '.epub.exe'
              - '.mobi.exe'
              - '.md.exe'
              - '.md5.exe'
              - '.yml.exe'
              - '.yaml.exe'
              - '.lua.exe'
              - '.sh.exe'
              - '.cmd.exe'
              - '.exe.exe'
              - '.dmg.exe'
              - '      .exe'
              - '______.exe'
              - '.doc.lnk'
              - '.docx.lnk'
              - '.xls.lnk'
              - '.xlsx.lnk'
              - '.ppt.lnk'
              - '.pptx.lnk'
              - '.rtf.lnk'
              - '.pdf.lnk'
              - '.txt.lnk'
              - '.doc.js'
              - '.docx.js'
              - '.xls.js'
              - '.xlsx.js'
              - '.ppt.js'
              - '.pptx.js'
              - '.rtf.js'
              - '.pdf.js'
              - '.txt.js'
        - ParentCommandLine|contains:
              - '.doc.exe'
              - '.docx.exe'
              - '.xls.exe'
              - '.xlsx.exe'
              - '.ppt.exe'
              - '.pptx.exe'
              - '.rtf.exe'
              - '.pdf.exe'
              - '.txt.exe'
              - '.jpg.exe'
              - '.png.exe'
              - '.zip.exe'
              - '.rar.exe'
              - '.mp4.exe'
              - '.mp3.exe'
              - '.avi.exe'
              - '.mov.exe'
              - '.gif.exe'
              - '.bmp.exe'
              - '.csv.exe'
              - '.log.exe'
              - '.dll.exe'
              - '.bat.exe'
              - '.html.exe'
              - '.php.exe'
              - '.ps1.exe'
              - '.vbs.exe'
              - '.js.exe'
              - '.msi.exe'
              - '.iso.exe'
              - '.tar.exe'
              - '.7z.exe'
              - '.apk.exe'
              - '.bin.exe'
              - '.deb.exe'
              - '.rpm.exe'
              - '.sys.exe'
              - '.svg.exe'
              - '.tiff.exe'
              - '.ini.exe'
              - '.sql.exe'
              - '.json.exe'
              - '.xml.exe'
              - '.dat.exe'
              - '.tmp.exe'
              - '.bak.exe'
              - '.config.exe'
              - '.psd.exe'
              - '.mkv.exe'
              - '.flv.exe'
              - '.ogg.exe'
              - '.wav.exe'
              - '.mid.exe'
              - '.ttf.exe'
              - '.otf.exe'
              - '.epub.exe'
              - '.mobi.exe'
              - '.md.exe'
              - '.md5.exe'
              - '.yml.exe'
              - '.yaml.exe'
              - '.lua.exe'
              - '.sh.exe'
              - '.cmd.exe'
              - '.exe.exe'
              - '.dmg.exe'
              - '      .exe'
              - '______.exe'
              - '.doc.lnk'
              - '.docx.lnk'
              - '.xls.lnk'
              - '.xlsx.lnk'
              - '.ppt.lnk'
              - '.pptx.lnk'
              - '.rtf.lnk'
              - '.pdf.lnk'
              - '.txt.lnk'
              - '.doc.js'
              - '.docx.js'
              - '.xls.js'
              - '.xlsx.js'
              - '.ppt.js'
              - '.pptx.js'
              - '.rtf.js'
              - '.pdf.js'
              - '.txt.js'
    condition: selection
falsepositives:
    - Unknown
level: high
