title: Powershell Execution From File
id: ee218c12-627a-4d27-9e30-d6fb2fe22ed2
status: experimental
description: Detects execution of powershell from a file
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
author: frack113
date: 2022/12/25
logsource:
    product: windows
    category: process_creation
detection:
    selection_exec:
        CommandLine|contains:
            - 'iex'
            - 'invoke-command'
    selection_read:
        CommandLine|contains:
            - 'cat '
            - 'get-content '
    selection_raw:
        CommandLine|contains: ' -raw'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
