title: Suspicious Shells Spawn by Java
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
description: Detects suspicious shell spawn from Java host process (e.g. log4j exploitation)
status: experimental
author: Andreas Hunkeler (@Karneades)
date: 2021/12/17
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\java.exe'
        Image:
            - '*\cmd.exe'
            - '*\sh.exe'
            - '*\bash.exe'
            - '*\powershell.exe'
            - '*\schtasks.exe'
            - '*\certutil.exe'
            - '*\whoami.exe'
            - '*\bitsadmin.exe'
    condition: selection
falsepositives:
    - Legitimate calls to system binaries
    - Company specific internal usage
level: high
