title: Suspicious IIS Module Registration
id: 043c4b8b-3a54-4780-9682-081cb6b8185c
status: test
description: Detects a suspicious IIS module registration as described in Microsoft threat report on IIS backdoors
author: Florian Roth (rule), Microsoft (idea)
references:
   - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
date: 2022/08/04
logsource:
   category: process_creation
   product: windows
detection:
   selection_1:
      CommandLine|contains: 'appcmd.exe add module'
      ParentImage|endswith: '\w3wp.exe'
   selection_2:
      CommandLine|contains: ' system.enterpriseservices.internal.publish'
      ParentImage|endswith: '\w3wp.exe'
      Image|endswith: '\powershell.exe'
   selection_3:
      CommandLine|contains: ' \\gacutil.exe /I'
      ParentImage|endswith: '\w3wp.exe'
   condition: 1 of selection*
falsepositives:
   - Administrative activity
level: high