title: Hermetic Wiper TG Process Patterns
id: 2f974656-6d83-4059-bbdf-68ac5403422f
status: experimental
description: This rule detects process execution patterns found in intrusions related to the Hermetic Wiper malware attacks against Ukraine in February 2022
author: Florian Roth
references:
   - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia
date: 2022/02/25
modified: 2022/08/13
logsource:
   category: process_creation
   product: windows
detection:
   selection1:
      Image|endswith: '\policydefinitions\postgresql.exe'
   selection2:
      - CommandLine|contains:
         - 'CSIDL_SYSTEM_DRIVE\temp\sys.tmp'
         - ' 1> \\\\127.0.0.1\ADMIN$\__16'
      - CommandLine|contains|all:
         - 'powershell -c '
         - '\comsvcs.dll MiniDump '
         - '\winupd.log full'
   condition: 1 of selection*
falsepositives:
   - Unknown
level: high
