title: Suspicious Child Process Spawned By Odbcconf.exe
id: 8e3c7994-131e-4ba5-b6ea-804d49113a26
status: experimental
description: Suspicous child process spawned by ODBCCONF binary
references:
    - https://medium.com/@cyberjyot/t1218-008-dll-execution-using-odbcconf-exe-803fa9e08dac
author: Harjot Singh @cyb3rjy0t
date: 2023/05/08
tags:
    - attack.defense_evasion
    - attack.t1218.08
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: 'odbcconf.exe'
    condition: selection_parent
falsepositives:
    - Legimate processes
level: medium
