title: MSDT.exe loading Diagnostic Library
id: ec8c4047-fad9-416a-8c81-0f479353d7f6
status: experimental
description: Detects windows document or pdf reader leveraging "msdt.exe" binary with 'PCWDiagnostic' command line, and detects "msdt.exe" loading "sdiageng.dll" binary (CVE-2022-30190)
author: Greg (rule)
references:
  - https://twitter.com/j00sean/status/1534115332830507008
  - https://twitter.com/nas_bench/status/1531944240271568896?t=z0hjfsgRgNb9c4NCLk-bHg&s=19  # rule is also by proc_creation_win_msdt_sdiagnhost.yml
  - https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/
date: 2022/06/09
modified: 2022/06/13
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    - Image|endswith: '\msdt.exe'
    - OriginalFileName: 'msdt.exe'
  selection_cmd:
    CommandLine|contains:
      - 'PCWDiagnostic'
      - '/af ' # For answer files
  selection_load:
    ImageLoaded|endswith: 'sdiageng.dll'

  condition: all of selection*
falsepositives:
  - Unknown
level: high
tags:
  - attack.defense_evasion
  - attack.t1202
  - cve.2022.30190

