title: HackTool - Crassus
id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
status: experimental
description: Detects hacktool 'Crassus' - Windows privilege escalation discovery tool
references:
    - https://github.com/vu-ls/Crassus
author: pH-T (Nextron Systems)
date: 2023/04/17
modified: 2023/04/17
tags:
    - attack.discovery
    - attack.t1590.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\Crassus.exe'
        - OriginalFileName: '\Crassus.exe'
        - Description: 'Crassus'
    condition: selection
falsepositives:
    - Very unlikely
level: high
