title: Execution of Remote Utilities RAT (RURAT) From Unusual Location
id: e01fa958-6893-41d4-ae03-182477c5e77d
status: experimental
description: Detects execution of Remote Utilities RAT (RURAT) from an unsual location (outisde of 'C:\Program Files')
references:
    - https://redcanary.com/blog/misbehaving-rats/
author: Nasreddine Bencherchali
date: 2022/09/19
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith:
            - '\rutserv.exe'
            - '\rfusclient.exe'
        - Product: 'Remote Utilities'
    filter:
        Image|startswith:
            - 'C:\Program Files\Remote Utilities'
            - 'C:\Program Files (x86)\Remote Utilities'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
