title: TacticalRMM Agent Installation via Command Line
id: 2db93a3f-3249-4f73-9e68-0e77a0f8ae7e
status: experimental
description: |
  Detects TacticalRMM agent installation via command line using the --api and --auth flags.
  Commonly used in scripted deployments or by threat actors for silent installs.

  Installed Components:
    - Main Agent: C:\Program Files\TacticalAgent\      (Primary RMM functionality)
    - Mesh Agent: C:\Program Files\Mesh Agent\         (Network communication / remote access)
    - Data Storage: C:\ProgramData\TacticalRMM\        (Configuration and logs)
    - Service Name: tacticalrmm                        (Persistent execution as a service)

author: Ahmed Nosir (@egycondor)
date: 2025-05-29
logsource:
  category: process_creation
  product: windows
detection:
  selection_flags:
    CommandLine|contains|all:
      - '--api'
      - '--auth'
      - '--client-id'
      - '--site-id'
      - '--agent-type'
  selection_image:
    Image|contains: '\TacticalAgent\tacticalrmm.exe'
  condition: selection_flags and selection_image
level: high
tags:
  - attack.command-and-control
  - attack.t1219
  - attack.t1105
  - detection.tacticalrmm
references:
  - https://github.com/amidaware/tacticalrmm
  - https://apophis133.medium.com/powershell-script-tactical-rmm-installation-45afb639eff3
falsepositives:
  - Legitimate system administrator deploying TacticalRMM
