title: Suspicious Usage Of ShellExec_RundDLL
id: d87bd452-6da1-456e-8155-7dc988157b7d
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other commands as seen in the the raspberry-robin attack
status: experimental
references:
    - https://redcanary.com/blog/raspberry-robin/
    - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
author: Nasreddine Bencherchali
date: 2022/09/01
modified: 2022/10/28
logsource:
    category: process_creation
    product: windows
detection:
    selection_openasrundll:
        CommandLine|contains: 'ShellExec_RunDLL'
    selection_suspcli:
        CommandLine|contains:
            # Add more LOLBINs and Susp Paths
            - 'regsvr32'
            - 'msiexec'
            - '\Users\Public\'
            - 'odbcconf'
            - '\Desktop\'
            - '\Temp\'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
