title: Process Dump via Rundll32 and Comsvcs.dll
id: 646ea171-dded-4578-8a4d-65e9822892e3
related:
    - id: 09e6d5c0-05b8-4ff8-9eeb-043046ec774c
      type: obsoletes
description: Detects process memory dump via comsvcs.dll and rundll32 using different techniques (ordinal, minidump function...etc)
status: test
references:
    - https://twitter.com/shantanukhande/status/1229348874298388484
    - https://twitter.com/pythonresponder/status/1385064506049630211?s=21
    - https://twitter.com/Hexacorn/status/1224848930795552769
    - https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
    - https://twitter.com/SBousseaden/status/1167417096374050817
    - https://twitter.com/Wietze/status/1542107456507203586
author: Florian Roth, Modexp, Nasreddine Bencherchali (update)
date: 2020/02/18
modified: 2022/08/04
tags:
    - attack.defense_evasion
    - attack.credential_access
    - attack.t1036
    - attack.t1003.001
    - car.2013-05-009
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\rundll32.exe'
        - OriginalFileName: 'RUNDLL32.EXE'
        - CommandLine|contains: 'rundll32'
    selection_cli:
        CommandLine|contains|all:
            - 'comsvcs'
            - 'full'
        Commandline|contains:
            - '24 '
            - '#24'
            - '#+24'
            - 'MiniDump' #Matches MiniDump and MinidumpW
    unique_selection:
        CommandLine|contains: '#-4294967272'  # https://twitter.com/Hexacorn/status/1224848930795552769
    condition: all of selection* or unique_selection
falsepositives:
    - Unlikely, because no one should dump the process memory in that way
level: high
