title: Use NTFS Short Name in Image
id: 3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
related:
    - id: dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795
      type: similar
status: experimental
description: Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image based detection
author: frack113, Nasreddine Bencherchali
references:
    - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN
    - https://twitter.com/jonasLyk/status/1555914501802921984
date: 2022/08/06
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - '~1.'
            - '~2.'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1564.004
