title: Suspicious Elevated System Shell
id: 178e615d-e666-498b-9630-9ed363038101
status: experimental
description: Detects when a shell program such as the Windows command prompt or PowerShell is launched with system privileges.
references:
    - https://github.com/Wh04m1001/SysmonEoP
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
modified: 2023/09/14
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: process_creation
detection:
    selection_shell:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\cmd.exe'
        - OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
            - 'Cmd.Exe'
    selection_user:
        User|contains: # covers many language settings
            - 'AUTHORI'
            - 'AUTORI'
        LogonId: '0x3e7'
    filter_generic:
        # Example 1:
        #   C:\Program Files\erl-23.2\erts-11.1.4\bin\erl.exe" -service_event ErlSrv_RabbitMQ -nohup -sname rabbit@localhost -s rabbit boot -boot start_sasl +W w +MBas ageffcbf +MHas ageffcbf +MBlmbcs 512 +MHlmbcs 512 +MMmcs 30 +P 1048576 +t 5000000 +stbt db +zdbbl 128000 +sbwt none +sbwtdcpu none +sbwtdio none -kernel inet_dist_listen_min 25672 -kernel inet_dist_listen_max 25672 -lager crash_log false -lager handlers []
        # Example 2:
        #   ParentImage: C:\Program Files (x86)\Varonis\DatAdvantage\GridCollector\VrnsRealTimeAlertsSvc.exe" /appid 000000ad-cb03-500b-9459-c46d000000ad
        #   CommandLine: C:\Windows\system32\cmd.exe /c C:\Program Files "(x86)\Varonis\DatAdvantage\GridCollector\handle_scopes.cmd C:\Collector" Working Share\VaronisWorkDirectoryCollector
        ParentImage|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Program Files (x86)\'
            - 'C:\Program Files\'
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
    filter_manageengine:
        # Example:
        #   ParentImage: C:/ManageEngine/ADManager Plus/pgsql/bin/postgres.exe" --forkarch 5380
        #   CommandLine: C:\Windows\system32\cmd.exe /c "IF EXIST archive.bat (archive.bat pg_wal\000000010000008E000000EA 000000010000008E000000EA)
        ParentImage: 'C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe'
        Image|endswith: '\cmd.exe'
    filter_citrix:
        ParentImage|startswith: 'C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\'
        ParentImage|endswith: '\CitrixReceiverUpdater.exe'
        Image|endswith: '\cmd.exe'
    filter_asgard:
        CommandLine|startswith: 'C:\WINDOWS\system32\cmd.exe /c "'
        CurrentDirectory|contains: 'C:\WINDOWS\Temp\asgard2-agent\'
    filter_dell_update:
        ParentImage|startswith: 'C:\Windows\Temp'
        ParentImage|endswith: '\invcol.exe'
        ParentCommandLine|contains: 'C:\ProgramData\Dell\UpdateService\'
        Image|endswith: '\cmd.exe'
    filter_compattelrunner:
        ParentImage|startswith:
            - 'C:\Windows\System32'
            - 'C:\Windows\WinSxS\'
        ParentImage|endswith: '\CompatTelRunner.exe'
        ParentCommandLine|startswith: 'C:\Windows\system32\CompatTelRunner.exe -m:appraiser.dll -f:DoScheduledTelemetryRun'
    filter_ibm_spectrumprotect:
        ParentImage|startswith: 'C:\IBM\SpectrumProtect\webserver\scripts\'
        CommandLine|contains: 'C:\IBM\SpectrumProtect\webserver\scripts\'
    filter_msiexec:
        ParentImage: 'C:\Windows\SysWOW64\msiexec.exe'
        ParentCommandLine|startswith: 'C:\Windows\syswow64\MsiExec.exe -Embedding'
        CommandLine|contains: '\RegisterMicrosoftUpdate.ps1'
    filter_empty_parent_1:
        # https://answers.microsoft.com/en-us/windows/forum/all/res-and-inf-powershell-commands/793736ee-94bd-424f-811c-35a425e28832
        # Most probably SetupHost.exe during Windows updates/upgrades; See comment on rule id: f4bbd493-b796-416e-bbf2-121235348529
        CommandLine|startswith:
            - 'powershell.exe -ExecutionPolicy Restricted -Command  $res = 0; '
            - 'powershell.exe -ExecutionPolicy Restricted -Command Write-Host '
        CommandLine|endswith:
            - "Write-Host 'Final result:', $Res;"
            - 'Write-Host "Final result:", $res'
            - "Write-Host 'Final result: 1';"
    filter_empty_parent_2:
        Image|endswith: '\cmd.exe'
        CommandLine|contains: '/d /c C:\Windows\system32\silcollector.cmd'
    filter_empty_parent_3:
        Image|endswith: '\cmd.exe'
        CommandLine|endswith:
            - 'cmd.exe /c btool server list replication_port --no-log'
            - 'cmd.exe /c btool server list general --no-log'
    filter_empty_parent_4: # seen on an SCCM server
        Image|endswith: '\cmd.exe'
        CommandLine|contains: 'C:\Windows\system32\reg.exe query hklm\software\microsoft\windows\softwareinventorylogging /v collectionstate /reg:64'
    filter_empty_parent_5:
        Image: 'C:\Windows\System32\cmd.exe'
        CommandLine: 'C:\Windows\system32\cmd.exe /c PAUSE'
    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Unknown
level: high
