title: Suspicious Schtasks Execution AppData Folder
id: c5c00f49-b3f9-45a6-997e-cfdecc6e1967
status: experimental
description: Detects the creation or update of a scheduled task to run with "NT AUTHORITY\SYSTEM" privileges
author: Nasreddine Bencherchali
references:
    - https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern
date: 2022/07/28
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains:
            - ' /change '
            - ' /create '
        CommandLine|contains|all:
            - '/ru '
            - 'NT AUT'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.execution
    - attack.persistence
    - attack.t1053.005
