title: Use NTFS Short Name in Image
id: 3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
related:
    - id: dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795
      type: similar
status: experimental
description: Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image based detection
author: frack113, Nasreddine Bencherchali
references:
    - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN
    - https://twitter.com/jonasLyk/status/1555914501802921984
date: 2022/08/06
modified: 2022/08/12
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains:
            - '~1.exe'
            - '~1.bat'
            - '~1.msi'
            - '~1.vbe'
            - '~1.vbs'
            - '~1.dll'
            - '~1.ps1'
            - '~1.js'
            - '~1.hta'
            - '~2.exe'
            - '~2.bat'
            - '~2.msi'
            - '~2.vbe'
            - '~2.vbs'
            - '~2.dll'
            - '~2.ps1'
            - '~2.js'
            - '~2.hta'
    filter:
        ParentImage|endswith:
            - '\WebEx\WebexHost.exe'
            - '\thor\thor64.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1564.004
