title: Monitoring Winget For LOLbin Execution
id: 313d6012-51a0-4d93-8dfc-de8553239e25
status: experimental
description: Detects usage of winget to install applications via manifest file. Adversaries can abuse winget to download payloads remotely and execute them without touching disk. The manifest option enables you to install an application by passing in a YAML file directly to the client. Winget can be used to download and install exe's, msi, msix files later.
references:
    - https://docs.microsoft.com/en-us/windows/package-manager/winget/install#local-install
author: Sreeman, Florian Roth, Frack113
date: 2020/04/21
modified: 2023/01/03
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\winget.exe'
        - OriginalFileName: 'winget.exe'
    selection_install_flag:
        CommandLine|contains: 'install'
    selection_manifest_flag:
        CommandLine|contains:
            - '-m '
            - '--manifest'
    condition: all of selection_*
falsepositives:
    - Admin activity installing packages not in the official Microsoft repo. Winget probably won't be used by most users.
level: medium
