title: Relative Path DLL hijacking
id: c2d75e0b-dabf-412f-82ee-252caafa8191
status: experimental
description: Detects execution of Microsoft executables which are normally found under System32 folder, but attacker may try to place them in different locations in order to perform DLL hijacking
references:
    - https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
author: Sorina Ionescu
date: 2022/09/06
tags:
    - attack.defense_evasion
    - attack.t1574.008
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: # All 287 executables from Windows 10 v1909 that are vulnerable to the ‘relative path DLL Hijack’ variant of DLL Hijacking
				- '\bthudtask.exe'
				- '\computerdefaults.exe'
				- '\dccw.exe'
				- '\easinvoker.exe'
				- '\easpolicymanagerbrokerhost.exe'
				- '\fodhelper.exe'
				- '\fsavailux.exe'
				- '\fxsunatd.exe'
				- '\immersivetpmvscmgrsvr.exe'
				- '\iscsicli.exe'
				- '\mdsched.exe'
				- '\mschedexe.exe'
				- '\msconfig.exe'
				- '\msdt.exe'
				- '\multidigimon.exe'
				- '\netplwiz.exe'
				- '\optionalfeatures.exe'
				- '\perfmon.exe'
				- '\printui.exe'
				- '\recdisc.exe'
				- '\rstrui.exe'
				- '\sdclt.exe'
				- '\systempropertiesadvanced.exe'
				- '\systempropertiescomputername.exe'
				- '\systempropertiesdataexecutionprevention.exe'
				- '\systempropertieshardware.exe'
				- '\systempropertiesprotection.exe'
				- '\systempropertiesremote.exe'
				- '\systemreset.exe'
				- '\systemsettingsadminflows.exe'
				- '\taskmgr.exe'
				- '\tcmsetup.exe'
				- '\winsat.exe'
				- '\wsreset.exe'
				- '\wusa.exe'
				- '\agentservice.exe'
				- '\applytrustoffline.exe'
				- '\arp.exe'
				- '\at.exe'
				- '\auditpol.exe'
				- '\baaupdate.exe'
				- '\bdechangepin.exe'
				- '\bdeuisrv.exe'
				- '\bioiso.exe'
				- '\bootim.exe'
				- '\calc.exe'
				- '\certreq.exe'
				- '\certutil.exe' # might be noisy, many applications use a localy copied version of certutil.exe
				- '\change.exe'
				- '\charmap.exe'
				- '\checknetisolation.exe'
				- '\chglogon.exe'
				- '\chgport.exe'
				- '\chkdsk.exe'
				- '\chkntfs.exe'
				- '\cipher.exe'
				- '\clipup.exe'
				- '\cmdl32.exe'
				- '\colorcpl.exe'
				- '\compmgmtlauncher.exe'
				- '\ctfmon.exe'
				- '\cttune.exe'
				- '\dataexchangehost.exe'
				- '\datausagelivetiletask.exe'
				- '\ddodiag.exe'
				- '\deploymentcsphelper.exe'
				- '\devicecensus.exe'
				- '\devicecredentialdeployment.exe'
				- '\deviceenroller.exe'
				- '\devicepairingwizard.exe'
				- '\dfrgui.exe'
				- '\dialer.exe'
				- '\disksnapshot.exe'
				- '\dispdiag.exe'
				- '\displayswitch.exe'
				- '\djoin.exe'
				- '\dmcertinst.exe'
				- '\dmcfghost.exe'
				- '\dmclient.exe'
				- '\dmnotificationbroker.exe'
				- '\dmomacpmo.exe'
				- '\dnscacheugc.exe'
				- '\dpapimig.exe'
				- '\dpiscaling.exe'
				- '\driverquery.exe'
				- '\drvinst.exe'
				- '\dsregcmd.exe'
				- '\dstokenclean.exe'
				- '\dwm.exe'
				- '\dwwin.exe'
				- '\dxgiadaptercache.exe'
				- '\dxpserver.exe'
				- '\easeofaccessdialog.exe'
				- '\edpcleanup.exe'
				- '\eduprintprov.exe'
				- '\efsui.exe'
				- '\ehstorauthn.exe'
				- '\esentutl.exe'
				- '\eventcreate.exe'
				- '\expand.exe'
				- '\extrac32.exe'
				- '\fhmanagew.exe'
				- '\filehistory.exe'
				- '\fixmapi.exe'
				- '\fltmc.exe'
				- '\fondue.exe'
				- '\fsiso.exe'
				- '\fsquirt.exe'
				- '\ftp.exe'
				- '\fvenotify.exe'
				- '\fveprompt.exe'
				- '\fxscover.exe'
				- '\fxssvc.exe'
				- '\gamepanel.exe'
				- '\genvalobj.exe'
				- '\getmac.exe'
				- '\gpresult.exe'
				- '\gpupdate.exe'
				- '\hvax64.exe'
				- '\hvix64.exe'
				- '\hvsievaluator.exe'
				- '\ie4uinit.exe'
				- '\ieunatt.exe'
				- '\klist.exe'
				- '\ksetup.exe'
				- '\label.exe'
				- '\licensingdiag.exe'
				- '\lockscreencontentserver.exe'
				- '\lpksetup.exe'
				- '\lpremove.exe'
				- '\magnify.exe'
				- '\makecab.exe'
				- '\mcbuilder.exe'
				- '\mdeserver.exe'
				- '\mdmappinstaller.exe'
				- '\mdmdiagnosticstool.exe'
				- '\mfpmp.exe'
				- '\microsoft.uev.cscunpintool.exe'
				- '\microsoftedgebchost.exe'
				- '\microsoftedgecp.exe'
				- '\microsoftedgedevtools.exe'
				- '\microsoftedgesh.exe'
				- '\mobsync.exe'
				- '\mousocoreworker.exe'
				- '\msdtc.exe'
				- '\msg.exe'
				- '\mshta.exe'
				- '\msiexec.exe'
				- '\msinfo32.exe'
				- '\mspaint.exe'
				- '\msra.exe'
				- '\mstsc.exe'
				- '\mtstocom.exe'
				- '\muiunattend.exe'
				- '\musnotification.exe'
				- '\musnotificationux.exe'
				- '\musnotifyicon.exe'
				- '\nbtstat.exe'
				- '\net.exe'
				- '\net1.exe'
				- '\netbtugc.exe'
				- '\nethost.exe'
				- '\netiougc.exe'
				- '\netsh.exe'
				- '\netstat.exe'
				- '\ngciso.exe'
				- '\nltest.exe'
				- '\nslookup.exe'
				- '\omadmclient.exe'
				- '\openfiles.exe'
				- '\osk.exe'
				- '\pacjsworker.exe'
				- '\packageinspector.exe'
				- '\pathping.exe'
				- '\pcalua.exe'
				- '\pinenrollmentbroker.exe'
				- '\pktmon.exe'
				- '\plasrv.exe'
				- '\pnpunattend.exe'
				- '\presentationhost.exe'
				- '\presentationsettings.exe'
				- '\printbrmui.exe'
				- '\psr.exe'
				- '\query.exe'
				- '\quickassist.exe'
				- '\quser.exe'
				- '\qwinsta.exe'
				- '\rasautou.exe'
				- '\rasdial.exe'
				- '\raserver.exe'
				- '\rdpclip.exe'
				- '\rdpsa.exe'
				- '\rdpsauachelper.exe'
				- '\rdpshell.exe'
				- '\rdvghelper.exe'
				- '\reagentc.exe'
				- '\recover.exe'
				- '\register-cimprovider.exe'
				- '\rekeywiz.exe'
				- '\relog.exe'
				- '\relpost.exe'
				- '\repair-bde.exe'
				- '\reset.exe'
				- '\resetengine.exe'
				- '\resmon.exe'
				- '\rmactivate_isv.exe'
				- '\rmactivate_ssp_isv.exe'
				- '\rmactivate.exe'
				- '\rmttpmvscmgrsvr.exe'
				- '\route.exe'
				- '\rpcping.exe'
				- '\rwinsta.exe'
				- '\searchfilterhost.exe'
				- '\secedit.exe'
				- '\securityhealthservice.exe'
				- '\settingsynchost.exe'
				- '\setupugc.exe'
				- '\shutdown.exe'
				- '\slidetoshutdown.exe'
				- '\slui.exe'
				- '\spaceagent.exe'
				- '\spectrum.exe'
				- '\spoolsv.exe'
				- '\sppextcomobj.exe'
				- '\sppsvc.exe'
				- '\srtasks.exe'
				- '\stordiag.exe'
				- '\synchost.exe'
				- '\sysreseterr.exe'
				- '\systeminfo.exe'
				- '\tabcal.exe'
				- '\takeown.exe'
				- '\tapiunattend.exe'
				- '\tar.exe' # might be noisy
				- '\taskkill.exe'
				- '\tasklist.exe'
				- '\tieringengineservice.exe'
				- '\tracert.exe'
				- '\tscon.exe'
				- '\tsdiscon.exe'
				- '\tskill.exe'
				- '\tttracer.exe'
				- '\typeperf.exe'
				- '\tzsync.exe'
				- '\uevappmonitor.exe'
				- '\unlodctr.exe'
				- '\upfc.exe'
				- '\upgraderesultsui.exe'
				- '\useraccountcontrolsettings.exe'
				- '\usocoreworker.exe'
				- '\utcdecoderhost.exe'
				- '\utilman.exe'
				- '\vaultcmd.exe'
				- '\vds.exe'
				- '\vdsldr.exe'
				- '\vssadmin.exe'
				- '\vssvc.exe'
				- '\w32tm.exe'
				- '\waitfor.exe'
				- '\wbadmin.exe'
				- '\wbengine.exe'
				- '\wecutil.exe'
				- '\werfault.exe'
				- '\werfaultsecure.exe'
				- '\wermgr.exe'
				- '\wextract.exe'
				- '\wfs.exe'
				- '\whoami.exe'
				- '\wiaacmgr.exe'
				- '\wiawow64.exe'
				- '\wifitask.exe'
				- '\wimserv.exe'
				- '\winlogon.exe'
				- '\winrs.exe'
				- '\wkspbroker.exe'
				- '\wksprt.exe'
				- '\wlrmdr.exe'
				- '\wmpdmc.exe'
				- '\workfolders.exe'
				- '\wowreg32.exe'
				- '\wpcmon.exe'
				- '\wpnpinst.exe'
				- '\wpr.exe'
				- '\write.exe'
				- '\wscadminui.exe'
				- '\wsmanhttpconfig.exe'
				- '\wsmprovhost.exe'
    legit_path:
        Image|startswith: # Locations where these executables are normally seen
          - 'C:\Windows\System32\'
          - 'C:\Windows\SysWOW64\'
    condition: selection and not legit_path
falsepositives:
    - Unknown
level: high
