title: HTML Help Shell Spawn
id: 52cad028-0ff0-4854-8f67-d25dfcbc78b4
status: test
description: Detects a suspicious child process of a Microsoft HTML Help system when executing compiled HTML files (.chm)
references:
    - https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-27939090904026cc396b0b629c8e4314acd6f5dac40a676edbc87f4567b47eb7
    - https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/
author: Maxim Pavlunin
date: 2020/04/01
modified: 2022/10/24
tags:
    - attack.defense_evasion
    - attack.t1218.001
    - attack.t1218.010
    - attack.t1218.011
    - attack.execution
    - attack.t1059.001
    - attack.t1059.003
    - attack.t1059.005
    - attack.t1059.007
    - attack.t1047
    - attack.t1566
    - attack.t1566.001
    - attack.initial_access
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        ParentImage:
            - 'C:\Windows\hh.exe'
            - 'C:\Windows\SysWOW64\hh.exe'
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\wscript.exe'
            - '\cscript.exe'
            - '\regsvr32.exe'
            - '\wmic.exe'
            - '\rundll32.exe'
            - '\MSHTA.EXE'
            - '\CertUtil.exe'
            - '\CertReq.exe'
            - '\MSbuild.exe'
            - '\installutil.exe'
            - '\schtasks.exe'
            - '\msiexec.exe'
    selection_2:
        Image|endswith:
            - '\Windows\hh.exe'
            - '\Windows\SysWOW64\hh.exe'
        CommandLine|contains:
            - '.application'
            - '\Downloads\'
            - '\Content.Outlook\'
            - '\AppData\Local\Temp\'
            # - '\AppData\Local\Temp\Temp?_'
            # - '\AppData\Local\Temp\Rar$'
            # - '\AppData\Local\Temp\7z'
            # - '\AppData\Local\Temp\wz'
            # - '\AppData\Local\Temp\peazip-tmp'
    condition: 1 of selection_*
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
