title: Detection of PowerShell Execution via DLL
id: 6812a10b-60ea-420c-832f-dfcc33b646ba
status: test
description: Detects PowerShell Strings applied to rundll as seen in PowerShdll.dll
author: Markus Neis
references:
    - https://github.com/p3nt4/PowerShdll/blob/62cfa172fb4e1f7f4ac00ca942685baeb88ff356/README.md
date: 2018/08/25
modified: 2022/07/11
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\rundll32.exe'
        - Description|contains: 'Windows-Hostprozess (Rundll32)'
    selection_cli:
        CommandLine|contains:
            - 'Default.GetString'
            - 'FromBase64String'
    condition: all of selection_*
falsepositives:
  - Unknown
level: high
tags:
  - attack.defense_evasion
  - attack.t1218.011
