title: Control Panel Items
id: 0ba863e6-def5-4e50-9cea-4dd8c7dc46a4
status: test
description: Detects the malicious use of a control panel item
author: Kyaw Min Thein, Furkan Caliskan (@caliskanfurkan_)
references:
  - https://attack.mitre.org/techniques/T1196/
  - https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins
date: 2020/06/22
modified: 2022/08/11
logsource:
  product: windows
  category: process_creation
detection:
  selection_reg:
    Image|endswith: '\reg.exe'
    CommandLine|contains|all:
        - 'add'
        - 'CurrentVersion\Control Panel\CPLs'
  selection_cpl:
    CommandLine|endswith: '.cpl'
  filter_cpl_sys:
    CommandLine|contains:
      - '\System32\'
      - '%System%'
  filter_cpl_igfx:
    CommandLine|contains|all:
      - 'regsvr32 '
      - ' /s '
      - 'igfxCPL.cpl'
  condition: selection_reg or (selection_cpl and not 1 of filter_cpl_*)
falsepositives:
  - Unknown
level: high
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218.002
  - attack.persistence
  - attack.t1546
