title: Using AppVLP To Circumvent ASR File Path Rule
id: 9c7e131a-0f2c-4ae0-9d43-b04f4e266d43
status: experimental
description: |
    Application Virtualization Utility is included with Microsoft Office. We are able to abuse "AppVLP" to execute shell commands.
    Normally, this binary is used for Application Virtualization, but we can use it as an abuse binary to circumvent the ASR file path rule folder
    or to mark a file as a system file.
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Appvlp/
author: Sreeman
date: 2020/03/13
modified: 2022/12/29
tags:
    - attack.t1218
    - attack.defense_evasion
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\appvlp.exe'
    filter:
        # Based on data from EchoTrail: https://www.echotrail.io/insights/search/appvlp.exe/
        Image|endswith:
            - '\msoasb.exe'
            - '\rundll32.exe'
            #- 'SKYPESERVER.EXE' # Rare comment it out if you experience FP
            #- 'MSOUC.EXE' # Rare comment it out if you experience FP
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
