title: Suspicious Desktop Background Change Using Reg.exe
id: fbcd8313-3d70-42c0-929c-e1999eadbbe9
status: experimental
description: Detects the execution of reg.exe to alter registry keys that would replace the user's desktop background. This is a common technique used by malware to change the desktop background to a ransom note or other image.
references:
    - https://www.attackiq.com/2023/09/20/emulating-rhysida/
    - https://research.checkpoint.com/2023/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/
    - https://www.trendmicro.com/en_us/research/23/h/an-overview-of-the-new-rhysida-ransomware.html
author: Stephen Lincoln `@slincoln-aiq` (AttackIQ)
tags:
    - attack.t1491.001
    - attack.impact
    - attack.t1112
    - attack.defense_evasion
date: 2023-12-19
logsource:
    product: windows
    category: process_creation
detection:
    selection_reg_img:
        Image|endswith: '\reg.exe'
    selection_reg_add:
        CommandLine|contains: 'add'
    selection_cli_hkcu:
        CommandLine|contains:
            - 'HKCU'
            - 'HKEY_CURRENT_USER'
    selection_cli_hklm:
        CommandLine|contains:
            - 'HKLM'
            - 'HKEY_LOCAL_MACHINE'
    selection_cli_reg_keys:
        CommandLine|contains:
            - 'Control Panel\Desktop'
            - 'CurrentVersion\Policies\ActiveDesktop'
            - 'CurrentVersion\Policies\System'
    selection_cli_reg_values_1:
        CommandLine|contains|all:
            - '/v NoChangingWallpaper'
            - '/d 1'
    selection_cli_reg_values_2:
        CommandLine|contains|all:
            - '/v Wallpaper'
            - '/t REG_SZ'
    selection_cli_reg_values_3:
        CommandLine|contains|all:
            - '/v WallpaperStyle'
            - '/d 2'
    condition: all of selection_reg_* and 1 of selection_cli_hk* and 1 of selection_cli_reg_*
fields:
    - Image
    - CommandLine
    - OriginalFileName
    - ParentCommandLine
    - User
falsepositives:
    - Administrative scripts that change the desktop background to a company logo or other image.
level: medium