title: Lolbin ProtocolHandler.exe Use As Transfer Tool Transfer 
id: ca4e6fe5-6037-4c07-9a9e-fc23489e012d
status: experimental
description: Detect use of ProtocolHandler.exe to download a remote payload and place it in the cache folder
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/ProtocolHandler/
    - https://www.echotrail.io/insights/search/protocolhandler.exe
author: frack113
date: 2022/12/31
tags:
    - attack.t1218
    - attack.defense_evasion
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection_exe:
        - Image|endswith: '\protocolhandler'
        - OriginalFileName: 'ProtocolHandler.exe'
    selection_cmd:
        CommandLine|contains: ' http' #cover http and https
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
