title: Net User Add Local User
id: 57ea3cf7-f2bf-419f-b51e-6a60635ebf0d
status: stable
description: Detects attempts to add new local user
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
author: Nasreddine Bencherchali
date: 2022/09/09
tags:
    - attack.persistence
    - attack.t1136.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\net.exe'
            - '\net1.exe'
        CommandLine|contains|all:
            - ' user '
            - '/add'
    condition: selection
falsepositives:
    - Legitimate use of net.exe utility by legitimate users and admins to add local user
level: low
