title: Microsoft IIS Service Account Password Dumped
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
status: experimental
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords
author: Tim Rauch
references:
    - https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
date: 2022/09/28
logsource:
    category: process_creation
    product: windows
tags:
    - attack.credential_access
    - attack.t1003
detection:
    selection_name:
        - Image|endswith: '\appcmd.exe'
        - OriginalFilename: 'appcmd.exe'
    selection_args:
        CommandLine|contains|all:
            - '/list'
            - '/text'
            - 'password'
    condition: all of selection*
falsepositives:
    - Unknown
level: high