title: Suspicious IIS Worker Process Spawning Post-Exploitation Reconnaissance or PowerShell Commands
id: b1843456-a9c9-43e2-b83d-d5123f76f7aa
status: experimental
description: | 
    Detects potentially malicious behavior where the IIS worker process (w3wp.exe) spawns cmd.exe, which in turn launches either PowerShell with 
    obfuscation,  download, or execution commands, or net.exe used for user, domain, or share enumeration. This activity pattern is commonly 
    observed in webshell usage, post-exploitation frameworks, or active exploitation of web applications (e.g. ToolShell in recent SharePoint RCE)
author: TristanInSec
date: 2025-07-24
tags:
    - attack.execution
    - attack.t1059.001
    - attack.discovery
    - attack.t1018
    - attack.persistence
    - attack.t1027.010
    - attack.t1505.003
references:
    - https://www.linkedin.com/posts/jhencinski_rapid7-mdr-is-detecting-active-exploitation-activity-7352685211240783872-EU4p
    - https://msrc.microsoft.com/blog/2025/07/customer-guidance-for-sharepoint-vulnerability-cve-2025-53770/
    - https://attack.mitre.org/techniques/T1505/003/ # Web Shell
    - https://attack.mitre.org/techniques/T1059/001/ # PowerShell
    - https://attack.mitre.org/techniques/T1027/010/ # Obfuscated Files or Information: Command Obfuscation
logsource:
    category: process_creation
    product: windows
detection:
    cmd_spawned_by_w3wp:
      ParentImage|endswith: '\w3wp.exe'
      Image|endswith: '\cmd.exe'
    powershell_spawned_by_cmd:
      ParentImage|endswith: '\cmd.exe'
      Image|endswith:
        - '\powershell.exe'
        - '\pwsh.exe'
      CommandLine|contains:
        - '-e'
        - '-enc'
        - '-encodedcommand'
        - '-ec'
        - '::FromBase64String'
        - 'iwr'
        - 'Invoke-WebRequest'
        - 'iex'
        - 'Invoke-Expression'
        - 'DownloadFile'
        - 'System.Net.WebClient'
        - 'Start-Process'
        - 'New-Object'
        - 'Invoke-Command'
    net_spawned_by_cmd:
      ParentImage|endswith: '\cmd.exe'
      Image|endswith: '\net.exe'
      CommandLine|contains:
        - 'user'
        - 'group'
        - 'domain'
        - 'share'
    condition: cmd_spawned_by_w3wp and (powershell_spawned_by_cmd or net_spawned_by_cmd)
falsepositives:
    - Legitimate administrative scripts executed through IIS
    - Management tools that use IIS worker processes
    - Web application management agents
level: medium
