title: Potential Arbitrary File Download Using Office Application
id: 4ae3e30b-b03f-43aa-87e3-b622f4048eed
status: experimental
description: Detects potential arbitrary file donwload using a Microsoft office application
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/17
modified: 2023/03/29
tags:
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\WINWORD.exe'
        - OriginalFileName: 'WinWord.exe'
    selection_http:
        CommandLine|contains:
            - 'http://'
            - 'https://'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
