title: Suspicious Command Line Containing Right-to-Left Override
id: ad691d92-15f2-4181-9aa4-723c74f9ddc3
status: experimental
description: Detects the presence of the u202+E character, which causes a terminal, browser, or operating system to render text in a right-to-left sequence. This is used in obfuscation and masquerading techniques.
references:
    - https://redcanary.com/blog/right-to-left-override/
    - https://unicode-explorer.com/c/202E
    - https://medium.com/@micahbabinski/detecting-onenote-one-malware-delivery-407e9321ecf0
author: Micah Babinski, @micahbabinski
date: 2023/01/30
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1036.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        # hex representation of RTLO character
        CommandLine|re: '\xe2\x80\xae'
    condition: selection
falsepositives:
    - Accidental insertion of this character into a filename or command line (very rare)
level: high
