title: Time Zone Discovery via reg.exe
id: 9090d3ad-df87-47f7-b47a-63e34e29b035
status: test
description: This Sigma rule detects the use of reg.exe to query the system's time zone information from the Windows registry. 
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1124/T1124.md#atomic-test-6---discover-system-time-zone-via-registry
author: lazarg
date: 2024-12-19
tags:
    - attack.discovery
    - attack.T1124
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\reg.exe'
        - OriginalFileName: 'reg.exe'
    selection_command_line:
        CommandLine|contains|all:
            - 'query'
            - '\SYSTEM\CurrentControlSet\Control\TimeZoneInformation' 
            - '/v'
            - 'TimeZoneKeyName'
    condition: selection_img and selection_command_line
falsepositives:
    - Unlikely
level: high