title: Grabbing sensitive hives via reg utility
description: Dump sam, system and security hives using REG.exe utility
author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: 2019/10/22
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
tags:
    - attack.credential_access
    - attack.t1003
    - car.2013-07-001
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        NewProcessName: '*\reg.exe'
        CommandLine|contains: save
    selection_2:
        - CommandLine|contains: 
            - 'hklm'
            - 'hkey_local_machine'
    selection_3:
        CommandLine|contains:
            - 'system'
            - 'sam'
            - 'security'
    condition: selection_1 and selection_2 and selection_3
falsepositives:
    - Dumping hives for legitimate purpouse like backup or forensic investigation
level: medium
status: experimental
