title: Copy DMP Files From Share
id: 044ba588-dff4-4918-9808-3f95e8160606
status: experimental
description: Detects usage of the copy command to copy files with the .dmp extensions from a remote share
references:
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
author: Nasreddine Bencherchali
date: 2022/09/27
modified: 2022/11/18
tags:
    - attack.credential_access
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            # Example: copy \\<host>\\<folder>\\lsass.dmp C:\Users\lsass.dmp
            - '.dmp'
            - 'copy '
            - ' \\\\'
        CommandLine|contains:
            - ' /c '
            - ' /r '
            - ' /k '
    condition: selection
falsepositives:
    - Unknown
level: high
