title: Suspicious WindowsTerminal Child Processes
id: 8de89e52-f6e1-4b5b-afd1-41ecfa300d48
status: experimental
description: Detects suspicious children spawned via the Windows Terminal application which could be a sign of persistence via WindowsTerminal (see references section)
references:
    - https://persistence-info.github.io/Data/windowsterminalprofile.html
    - https://twitter.com/nas_bench/status/1550836225652686848
author: Nasreddine Bencherchali
date: 2022/07/25
modified: 2022/07/27
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\WindowsTerminal.exe'
    selection_susp:
        - Image|endswith:
            # Add more LOLBINS
            - '\rundll32.exe'
            - '\regsvr32.exe'
            - '\certutil.exe'
            - '\cscript.exe'
            - '\wscript.exe'
            - '\csc.exe'
        - Image|contains:
            # Add more suspicious paths
            - 'C:\Users\Public\'
            - '\Downloads\'
            - '\Desktop\'
            - '\AppData\Local\Temp\'
            - '\Windows\TEMP\'
        - CommandLine|contains:
            # Add more suspicious commandline
            - ' iex '
            - 'Invoke-'
            - 'Import-Module'
            - 'DownloadString('
            - ' /c '
            - ' /k '
    filter_builtin_visual_studio_shell:
        CommandLine|contains|all:
            - 'Import-Module'
            - 'Microsoft.VisualStudio.DevShell.dll'
            - 'Enter-VsDevShell'
    filter_open_settings:
        CommandLine|contains|all:
            - '\AppData\Local\Packages\Microsoft.WindowsTerminal_'
            - '\LocalState\settings.json'
    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Other legitimate "Windows Terminal" profiles
level: medium
tags:
    - attack.execution
    - attack.persistence
