title: Suspicious Curl Usage on Windows
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
status: experimental
description: Detects a suspicious curl process start on Windows and outputs the requested document to a local file
author: Florian Roth
references:
    - https://twitter.com/max_mal_/status/1542461200797163522
date: 2020/07/03
modified: 2022/07/05
logsource:
    category: process_creation
    product: windows
detection:
    selection_curl:
        - Image|endswith: '\curl.exe'
        - Product: 'The curl executable'
    selection_susp_locations:
        CommandLine|contains:
            - '\AppData\'
            - '\Users\Public\'
            - '\Temp'
            - '%AppData%'
            - '%Temp%'
            - '%Public%'
            - '\Desktop'
    selection_susp_extensions:
        CommandLine|endswith:
            - '.jpg'
            - '.jpeg'
            - '.png'
            - '.gif'
            - '.tmp'
            - '.temp'
            - '.txt'
    selection_susp_remote_name:
        CommandLine|contains:
            - ' -O'  # alias for --remote-name
            - '--remote-name'
    condition: selection_curl and 1 of selection_susp*
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
tags:
    - attack.command_and_control
    - attack.t1105
