title: Application Whitelisting Bypass via Dxcap.exe
id: 60f16a96-db70-42eb-8f76-16763e333590
status: test
description: Detects execution of of Dxcap.exe
author: Beyu Denis, oscd.community, Nasreddine Bencherchali (update)
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Dxcap.yml
    - https://twitter.com/harr0ey/status/992008180904419328
date: 2019/10/26
modified: 2022/06/09
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\DXCap.exe'
        - OriginalFilename: 'DXCap.exe'
    CommandLine|contains: ' -c ' # The ".exe" is not required to run the binary
    condition: selection
falsepositives:
    - Legitimate execution of dxcap.exe by legitimate user
level: medium
tags:
    - attack.defense_evasion
    - attack.t1218
