title: Suspicious File Characteristics Due to Missing Fields
id: 9637e8a5-7131-4f7f-bdc7-2b05d8670c43
status: test
description: Detects Executables in the Downloads folder without FileVersion,Description,Product,Company likely created with py2exe
references:
    - https://securelist.com/muddywater/88059/
    - https://www.virustotal.com/#/file/276a765a10f98cda1a38d3a31e7483585ca3722ecad19d784441293acf1b7beb/detection
author: Markus Neis, Sander Wiebing
date: 2018-11-22
modified: 2026-03-23
tags:
    - attack.execution
    - attack.t1059.006
logsource:
    product: windows
    category: process_creation
detection:
    selection1:
        Description:
            - '\?'
            - ''
        FileVersion:
            - '\?'
            - ''
    selection1-null:
        Description: null
        FileVersion: null
    selection2:
        Description:
            - '\?'
            - ''
        Product:
            - '\?'
            - ''
    selection2-null:
        Description: null
        Product: null
    selection3:
        Description:
            - '\?'
            - ''
        Company:
            - '\?'
            - ''
    selection3-null:
        Description: null
        Company: null
    folder:
        Image|contains: '\Downloads\'
    condition: (1 of selection*) and folder
falsepositives:
    - Unknown
level: medium
