title: Potential Browser Data Stealing
id: 47147b5b-9e17-4d76-b8d2-7bac24c5ce1b
related:
    - id: fc028194-969d-4122-8abe-0470d5b8f12f
      type: derived
status: experimental
description: |
    Adversaries may acquire credentials from web browsers by reading files specific to the target browser.
    Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.
    Web browsers typically store the credentials in an encrypted format within a credential store.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
author: Nasreddine Bencherchali
date: 2022/12/23
tags:
    - attack.credential_access
    - attack.t1555.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        - CommandLine|contains:
            - 'copy-item'
            - 'copy'
            - 'cpi '
            - ' cp '
            - 'move'
            - 'move-item'
            - ' mi '
            - ' mv '
        - Image|endswith:
            - '\xcopy.exe'
            - '\robocopy.exe'
        - OriginalFileName:
            - 'XCOPY.EXE'
            - 'robocopy.exe'
    selection_path:
        CommandLine|contains:
            - '\Opera Software\Opera Stable\'
            - '\Mozilla\Firefox\Profiles'
            - '\Microsoft\Edge\User Data\'
            - '\Google\Chrome\User Data\'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
