title: Hiding Files with Attrib.exe
id: 4281cb20-2994-4580-aa63-c8b86d019934
status: test
description: Detects usage of attrib.exe to hide files from users.
author: Sami Ruohonen
date: 2019/01/16
modified: 2022/11/11
tags:
    - attack.defense_evasion
    - attack.t1564.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\attrib.exe'
        - OriginalFileName: 'ATTRIB.EXE'
    selection_cli:
        CommandLine|contains: ' +h '
    filter_ini:
        CommandLine|contains: '\desktop.ini '
    filter_intel:
        ParentImage|endswith: '\cmd.exe'
        CommandLine: +R +H +S +A \\\*.cui
        ParentCommandLine: C:\\WINDOWS\\system32\\\*.bat
    condition: all of selection_* and not 1 of filter_*
fields:
    - CommandLine
    - ParentCommandLine
    - User
falsepositives:
    - IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe and igfxCUIService.exe is the parent of the cmd.exe)
    - Msiexec.exe hiding desktop.ini
level: low
