title: Rundll32 With Suspicious Parent Process
id: 1723e720-616d-4ddc-ab02-f7e3685a4713
status: experimental
description: Detects suspicious start of rundll32.exe with a parent process of Explorer.exe. Variant of Raspberry Robin, as first reported by Red Canary. 
references:
    - https://redcanary.com/blog/raspberry-robin/
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
author: CD_ROM_
date: 2022/05/21
modified: 2022/12/15
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\rundll32.exe'
        ParentImage|endswith: '\explorer.exe'
    filter:
        CommandLine|contains: ' C:\Windows\System32\' # The space at the start is required
    condition: selection and not filter
fields:
    - Image
    - ParentImage
falsepositives:
    - Unknown
level: medium
