title: Devcon Execution Disabling VMware VMCI Device
id: b2c3d4e5-6f7a-8b9c-0d1e-2f3a4b5c6d7e
status: experimental
description: |
  Detects execution of devcon.exe with commands that disable the VMware Virtual Machine Communication Interface (VMCI) device.
  This can be legitimate during VMware Tools troubleshooting or driver conflicts, but may also indicate malware attempting
  to hijack communication with the hardware via the VMCI device. This has been used to facilitate VMware ESXi vulnerability exploits to escape VMs and execute code on the ESXi host.
author: Matt Anderson, Dray Agha, Anna Pham (Huntress)
date: 2026-01-02
references:
  - https://learn.microsoft.com/en-us/windows-hardware/drivers/devtest/devcon  # Official Microsoft DevCon documentation
  - https://communities.vmware.com/t5/VMware-Workstation-Pro/VMCI-driver-issues/td-p/2866060  # VMware community discussions on manual VMCI disable
  - https://github.com/search?q=devcon+disable+VMWVMCIHOSTDEV  # Example scripts using devcon for VMCI management
  - https://huntress.com/blog/esxi-vm-escape-exploit
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\devcon.exe'
  selection_action:
    CommandLine|contains: ' disable '
  selection_vmci_pci:
    CommandLine|contains:
      - '15AD&DEV_0740' # VMware VMCI PCI device (Vendor 0x15AD = VMware, Device 0x0740 = VMCI)
      - 'VMWVMCIHOSTDEV' # VMware VMCI root host device driver name
  condition: selection_img and selection_action and selection_vmci_pci
falsepositives:
  - Legitimate VMware administration, Tools installation/uninstallation, or troubleshooting driver conflicts
  - Automated scripts in virtualized environments for device cleanup
level: high
tags:
  - attack.defense_evasion
  - attack.t1543.003
  - attack.t1562.001