title: Possible PowerShell Console History File Access Attempt
id: f4ff7323-b5fc-4323-8b52-6b9408e15788
related:
    - id: 4d052abb-0bee-44f3-9aa0-8dab6b1bd349
      type: derived
status: experimental
description: Detects possible access attempts to the PowerShell console history file (ConsoleHost_history.txt) in order to retrieve plaintext passwords used in PowerShell commands.
references:
    - https://0xdf.gitlab.io/2018/11/08/powershell-history-file.html
author: Luc Génaux
date: 2025-04-03
tags:
    - attack.credential_access
    - attack.t1552.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'ConsoleHost_history.txt'
            - '(Get-PSReadlineOption).HistorySavePath'
    filter:
        Image|endswith:
            - '\notepad.exe'
            - '\notepad++.exe'
    condition: selection and not filter
falsepositives:
    - Curious user opening it's own history file
level: medium
