title: Lolbas Provlaunch.exe Indirect Command Execution - CLI
id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
related:
    - id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
      type: similar
status: experimental
description: Detects potential "provisioning" registry value abuse for indirect command execution through Provlaunch.exe.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Swachchhanda Shrawan Poudel
date: 2023/08/02
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\reg.exe'
        - OriginalFileName: 'reg.exe'
    selection_cli:
        CommandLine|contains|all:
            - ' add '
            - 'SOFTWARE\Microsoft\Provisioning\Commands\'
    condition: all of selection_*
falsepositives:
    - Unlikely
level: high