title: Wscript execution from Non-C Drive
id: 5b80cf53-3a46-4adc-960b-05ec19348d74
status: experimental
description: Detects Wscript, Cscript or Regsvr executing from a drive other than C
author: Aaron Herman
date: 2022/10/01
references:
    - https://github.com/pr0xylife/Qakbot/blob/main/Qakbot_BB_30.09.2022.txt
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection_lolbin:
        CommandLine|contains:
            - 'wscript.exe'
            - 'cscript.exe'
            - 'regsvr32'
    selection_exetensions:
        CommandLine|contains:
            - '.js'
            - '.dll'
    selection_drive_path:
        CommandLine|contains: ':\'
    filter_drive_path:
        CommandLine|contains: 'C:\'
    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Rare legitimate execution from a mounted drive by an administrator
level: high