title: Suspicious Rundll32 Execution of UDL File
id: 0ea52357-cd59-4340-9981-c46c7e900428
status: experimental
description: Detects the execution of rundll32.exe with the oledb32.dll library to open a UDL file. Threat actors can abuse the technique as a phishing vector to capture authentication credentials or other sensitive data.
author: '@kostastsale'
date: 2024-08-16
references:
    - https://trustedsec.com/blog/oops-i-udld-it-again
tags:
    - attack.execution
    - attack.t1218.011
    - attack.t1071
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        ParentImage|endswith:
            - '\explorer.exe'
        Image|endswith:
            - '\rundll32.exe'
        CommandLine|contains|all:
            - 'oledb32.dll'
            - ',OpenDSLFile '
            - '\\Users\\*\\Downloads\\' # you can adjust the path to the download directory or other directories accroding to your environment
    selection2:
        CommandLine|endswith:
            - '.udl'
    condition: selection1 and selection2
falsepositives:
    - UDL files serve as a convenient and flexible tool for managing and testing database connections in various development and administrative scenarios
level: medium
