title: Process Execution of Repair Functionality of msiexec.exe
id: a83342d8-272a-43e3-b7c1-24e6c439f735
status: test
description: Execution of the repair functionality of msiexec.exe through the command line. While not malicious itself, it might be part of a chain of actions leading to privilege escalation due vulnerabilities in the used MSI installer.
references:
    - https://r.sec-consult.com/msi
    - https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2024-38014
author: Herbert Bärschneider @SEC Consult
date: 2024-07-15
tags:
    - attack.t1068
    - cve.2024-38014
logsource:
    product: windows
    category: process_creation
detection:
    selection_msiexec_repair:
        Image|endswith: '\msiexec.exe'
        CommandLine|contains: '/f'
    condition: selection_msiexec_repair
falsepositives:
    - legitimate use of MSI files to repair installed applications by users or administrators
level: medium

