title: Potential Suspicious PowerShell LNK Execution
id: 19be3e36-35f2-4cd1-8317-1230cdb44044
status: experimental
description: Detects
references:
    - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/29
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\explorer.exe'
    selection_child_cmd_img:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
    selection_child_cmd_cli:
        - CommandLine|contains|all:
            - '/c'
            - '..\'
        - CommandLine|contains|all:
            - ''
    condition: selection
falsepositives:
    - Unlikely
level: high
