title: UAC Bypass WSReset
id: 89a9a0e0-f61a-42e5-8957-b1479565a658
description: Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config
author: Christian Burkard
date: 2021/08/23
status: experimental
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
    - https://github.com/hfiref0x/UACME
    - https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\wsreset.exe'
        IntegrityLevel:
          - 'High'
          - 'System'
    condition: selection
falsepositives:
    - Unknown
level: high
