title: SharpChisel Usage
id: cf93e05e-d798-4d9e-b522-b0248dc61eaf
related:
    - id: 8b0e12da-d3c3-49db-bb4f-256703f380e5
      type: similar
status: experimental
description: Detects usage of the Sharp Chisel via the commandline arguments
references:
    - https://github.com/shantanu561993/SharpChisel
    - https://www.sentinelone.com/labs/wading-through-muddy-waters-recent-activity-of-an-iranian-state-sponsored-threat-actor/
author: Nasreddine Bencherchali
date: 2022/09/05
modified: 2022/09/13
tags:
    - attack.command_and_control
    - attack.t1090.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_1_img:
        Image|endswith: '\SharpChisel.exe'
    selection_1_pe:
        Product: 'SharpChisel'
    # Covered by Chisel Rule
    # selection_2_client_server:
    #     CommandLine|contains:
    #         - 'exe client '
    #         - 'exe server '
    # selection_2_flags:
    #     CommandLine|contains:
    #         - ' --socks5'
    #         - ' --reverse'
    #         - ' r:'
    #         - ':127.0.0.1:'
    condition: 1 of selection*
falsepositives:
    - Some false positives may occure with other tools with similar commandlines
level: high
