title: Cloudflare Tunnel client Execution 
id: 7050bba1-1aed-454e-8f73-3f46f09ce56a
status: experimental
description: |
      Cloudflare Tunnel Client named cloudflared is being used by threat actors to maintain persistence and remote access to compromised networks.
references:
    - https://blog.reconinfosec.com/emergence-of-akira-ransomware-group
author: Janantha Marasinghe
date: 2023/05/16
tags:
    - attack.command_and_control
    - attack.t1102
    - attack.t1090
    - attack.t1572
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains: 'tunnel'
    selection_2:
        CommandLine|contains:
            - '--config'
            - '--token'
    selection_3:
        CommandLine|contains: 'run'
    condition: all of selection_*
falsepositives:
    - Legitimate use of the Cloudflare tunnel client for DevOps projects.
level: medium
