title: Suspicious Userinit Child Process
id: b655a06a-31c0-477a-95c2-3726b83d649d
status: test
description: Detects a suspicious child process of userinit
references:
    - https://twitter.com/SBousseaden/status/1139811587760562176
author: Florian Roth (Nextron Systems), Samir Bousseaden (idea)
date: 2019-06-17
modified: 2025-10-17
tags:
    - attack.defense-evasion
    - attack.t1055
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\userinit.exe'
    filter_main_netlogon:
        CommandLine|contains: '\netlogon\'
    filter_main_explorer:
        - Image|endswith: '\explorer.exe'
        - OriginalFileName: 'explorer.exe'
        - CommandLine: 'C:\Windows\Explorer.EXE'
    filter_main_null:
        Image: null
    condition: selection and not 1 of filter_main_*
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Administrative scripts
level: medium
