title: Microsoft IIS Service Account Password Dumped
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
status: experimental
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords
references:
    - https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
    - https://twitter.com/0gtweet/status/1588815661085917186?cxt=HHwWhIDUyaDbzYwsAAAA
    - https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/
author: Tim Rauch, Janantha Marasinghe
date: 2022/11/08
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_name:
        - Image|endswith: '\appcmd.exe'
        - OriginalFilename: 'appcmd.exe'
    selection_list:
        CommandLine|contains: 'list '
    selection_cmd1:
        CommandLine|contains|all:
            - ' /text'
            - ' password'
    selection_cmd2:
        CommandLine|contains:
            - ' /@t '
            - ' /text '
            - ' /config '
            - ' /@c'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
