title: Suspicious Child Process of Notepad++ Updater - GUP.Exe
id: bb0e87ce-c89f-4857-84fa-095e4483e9cb
status: experimental
description: |
    Detects suspicious child process creation by the Notepad++ updater process (gup.exe) which may indicate a supply chain attack involving hijacking of the update mechanism.
    In early 2026, it was discovered that WinGUp (the Notepad++ updater) traffic were hijacked and redirected to malicious servers, allowing attackers to deliver and execute arbitrary binaries on target systems.
    This is due to a weakness in the updater's validation of update file integrity and authenticity which was fixed in later versions of Notepad++ after v8.8.9.
    Attackers able to intercept updater traffic could exploit this to execute unwanted binaries or malware on target systems.
references:
    - https://notepad-plus-plus.org/news/v889-released/
    - https://www.heise.de/en/news/Notepad-updater-installed-malware-11109726.html
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2026-02-03
tags:
    - attack.collection
    - attack.credential-access
    - attack.t1195.002
    - attack.initial-access
    - attack.t1557
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\gup.exe'
    selection_child_img:
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\powershell_ise.exe'
            - '\pwsh.exe'
            - '\cscript.exe'
            - '\wscript.exe'
            - '\mshta.exe'
    selection_child_cli:
        CommandLine|contains:
            - 'certutil'
            - 'bitsadmin'
            - 'curl'
            - 'wget'
            - 'forfiles'
            - 'finger'
            - 'regsvr32'
            - 'rundll32'
    condition: selection_parent and 1 of selection_child_*
falsepositives:
    - Unknown
level: high
