title: Dllhost Process With No CommandLine
id: e7888eb1-13b0-4616-bd99-4bc0c2b054b9
status: experimental
description: Detects a "dllhost" spawning with no commandline arguments which is a very rare thing to happen and could indicate process injection activity.
references:
    - https://redcanary.com/blog/child-processes/
    - https://nasbench.medium.com/what-is-the-dllhost-exe-process-actually-running-ef9fe4c19c08
author: Nasreddine Bencherchali
date: 2022/06/27
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|endswith: 'dllhost.exe'
        Image|endswith: '\dllhost.exe'
    condition: selection and not filter
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unlikely
level: high
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1055
