title: WerFaultSecure Unusual Path Execution
description: >
    This analytic looks for the Windows 8.1 binary "WerFaultSecure" running out
    of an unusual path. A specific Windows 8.1 version of this binary can be
    used alongside the WSASS tool to dump the memory of processes protected by
    PPL (Protected Process Light), such as LSASS.
author: Andrew Danis
references:
    - >-
        https://www.zerosalarium.com/2025/09/Dumping-LSASS-With-WER-On-Modern-Windows-11.html
logsource:
    category: process_creation
    product: windows
    service: sysmon
detection:
    condition: Section_1 and not Section_2
    Section_1:
        Image|endswith: \WerFaultSecure.exe
    Section_2:
        Image|startswith:
            - C:\Windows\System32
            - C:\Windows\SysWOW64
license_url: ''
