title: Obfuscated IP Via CLI
id: 56d19cb4-6414-4769-9644-1ed35ffbb148
status: experimental
description: Detects usage of an encoded/obfuscated version of an IP address (hex, octal...) via commandline
references:
    - https://h.43z.one/ipconverter/
    - https://twitter.com/Yasser_Elsnbary/status/1553804135354564608
author: Nasreddine Bencherchali (Nextron Systems)  , X__Junior (Nextron Systems)
date: 2022/08/03
modified: 2023/10/27
tags:
    - attack.discovery
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - '\ping.exe'
            - '\arp.exe'
    selection_ip_1:
        CommandLine|contains:
            - '//0x'
            - '.0x'
            - '.00x'
    selection_ip_2:
        CommandLine|contains|all:
            - 'http://%'
            - '%2e'
    selection_ip_3:
        # http://81.4.31754
        - CommandLine|re: 'https?\/\/[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,5}(?!.)'
        # http://81.293898
        - CommandLine|re: 'https?\/\/[0-9]{1,3}\.[0-9]{1,8}(?!.)'
        # http://1359248394
        - CommandLine|re: 'https?\/\/[0-9]{1,10}(?!.)'
        # http://0121.04.0174.012
        - CommandLine|re: 'https?\/\/(0[0-9]{1,11}\.){3}0[0-9]{1,11}'
        # http://012101076012
        - CommandLine|re: 'https?\/\/0[0-9]{1,11}(?!.)'
        # For octal format
        - CommandLine|re: ' [0-9]{7,13}'
    condition: selection_img and 1 of selection_ip_*
falsepositives:
    - Unknown
level: medium
