title: Use Short Name Path in Command Line
id: 349d891d-fef0-4fe4-bc53-eee623a15969
related:
    - id: a96970af-f126-420d-90e1-d37bf25e50e1
      type: similar
status: experimental
description: Detect use of the Windows 8.3 short name. Which could be used as a method to avoid command-line detection
author: frack113, Nasreddine Bencherchali
references:
    - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN
    - https://twitter.com/frack113/status/1555830623633375232
date: 2022/08/07
modified: 2022/08/12
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - '~1\'
            - '~2\'
    filter:
        - ParentImage:
            - C:\Windows\System32\Dism.exe
            - C:\Windows\System32\cleanmgr.exe
        - ParentImage|endswith:
            - '\WebEx\WebexHost.exe'
            - '\thor\thor64.exe'
    condition: selection and not filter
falsepositives:
    - Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process.
level: medium
tags:
    - attack.defense_evasion
    - attack.t1564.004
