title: Suspicious CMD Shell Output Redirect
id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
related:
    - id: aa2efee7-34dd-446e-8a37-40790a66efd7
      type: derived
    - id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
      type: similar
status: experimental
description: Detects inline Windows shell commands redirecting output via the ">" symbol to a suspicious location
references:
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
modified: 2023/05/15
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'Cmd.Exe'
    selection_cli_1:
        CommandLine|contains:
            # Add more suspicious locations as you find them
            # The space from the start is missing to cover append operations ">>"
            - '> \Users\Public\'
            - '> %APPDATA%\'
            - '> %TEMP%\'
            - '> %TMP%\'
            - '> %USERPROFILE%\'
            - '> C:\Temp\'
            - '> C:\Users\Public\'
            - '> C:\Windows\Temp\'
            - '>\Users\Public\'
            - '>%APPDATA%\'
            - '>%TEMP%\'
            - '>%TMP%\'
            - '>%USERPROFILE%\'
            - '>C:\Temp\'
            - '>C:\Users\Public\'
            - '>C:\Windows\Temp\'
    selection_cli_2:
        CommandLine|contains:
            - ' >'
            - '">'
            - "'>"
        CommandLine|contains|all:
            - 'C:\Users\'
            - '\AppData\Local\'
    condition: selection_img and 1 of selection_cli_*
falsepositives:
    - Legitimate admin or third party scripts used for diagnostic collection might generate some false positives
level: medium
