title: Suspicious DumpMinitool Usage
id: eb1c4225-1c23-4241-8dd4-051389fde4ce
description: Detects suspicious ways to use of a Visual Studio bundled tool named DumpMinidump.exe 
status: experimental
references:
    - https://twitter.com/mrd0x/status/1511415432888131586?s=20&t=DvVrzeZ1OcGiWowbhPV8Lg
    - https://twitter.com/mrd0x/status/1511489821247684615
author: Florian Roth
date: 2022/04/06
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\DumpMinitool.exe'
        - OriginalName: 'DumpMinitool.exe'
    filter_folder:
        Image|contains: 
            - '\Microsoft Visual Studio\'
            - '\Extensions\'  # https://github.com/microsoft/vstest/blob/main/src/package/nuspec/Microsoft.TestPlatform.Portable.nuspec#L159
    selection_flags:
        CommandLine|contains: '.txt'
    condition: ( selection and not filter_folder ) or ( all of selection* )
falsepositives:
    - Unknown
level: high
