title: Suspicious GrpConv Execution
id: f14e169e-9978-4c69-acb3-1cff8200bc36
status: experimental
description: Detects the suspicious execution of a utility to convert Windows 3.x .grp files or for persistence purposes by malicious software or actors
author: Florian Roth
date: 2022/05/19
tags:
    - attack.persistence
    - attack.t1547
references:
    - https://twitter.com/0gtweet/status/1526833181831200770
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'grpconv.exe -o'
            - 'grpconv -o'
    condition: selection
falsepositives:
    - Unknown
level: high

