title: Suspicious Use of BrowserCore.exe for PRT Extraction
id: e862850e-cf85-48eb-b47b-db55d5c3d2d6
status: experimental
description: Detects suspicious execution of BrowserCore.exe potentially used to extract Primary Refresh Tokens (PRTs) for Azure AD SSO abuse.
references:
    - https://dirkjanm.io/abusing-azure-ad-sso-with-the-primary-refresh-token/
author: Eugen Tropmann
date: 2025-10-02
tags:
    - attack.credential-access
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1003
    - attack.t1550.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\BrowserCore.exe'
        - OriginalFileName: 'BrowserCore.exe'
    selection_cli:
        CommandLine|contains: 'chrome-extension://ppnbnpeolgkicgegkbkbjmhlideopiji/'
    filter_main_legit_exec_cmd:
        ParentImage|endswith: '\cmd.exe'
        ParentCommandLine|contains: '\\\\\.\\pipe\'
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Unknown
level: medium
