title: Dev Tunnels Execution
id: 74db3c13-352c-41e4-a33b-e46fbf8e5709
status: experimental
description: |
  Detects the use of Microsoft Dev Tunnels, a utility used for port forwarding and tunneling. An adversary may use this tool for commmand and control and to tunnel traffic.
references:
    - https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/overview
    - https://medium.com/@blueteamops/detecting-dev-tunnels-16f0994dc3e2 
author: Janantha Marasinghe
date: 2023/10/23
modified: 2023/10/23
tags:
    - attack.attack.command_and_control
    - attack.t1572
    - attack.t1090
    - attack.t1102.002
logsource:
    category: process_creation
    product: windows
detection:
    process:
        Image|endswith: 'devtunnels.exe'
    selection1:
        CommandLine|contains:
            - 'create'
            - 'host'
    selection2:
        CommandLine|contains|all:
            - 'user'
            - 'login'
    selection3:
        CommandLine|contains:
            - 'token'
            - 'access'
    condition: process and 1 of selection*
falsepositives:
    - Legitimate DNS queries for the usage of Dev Tunnels by developers
level: medium
