title: PsExec/PAExec Flags
id: 207b0396-3689-42d9-8399-4222658efc99
related:
    - id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
      type: similar
status: experimental
description: Detects suspicious flags used by PsExec and PAExec but no usual program name in command line
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.poweradmin.com/paexec/
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth, Nasreddine Bencherchali
date: 2021/05/22
modified: 2022/10/06
tags:
    - attack.resource_development
    - attack.t1587.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_flags_1:
        # Escalation to LOCAL_SYSTEM
        CommandLine|contains:
            # Note that you don't need to add the ".exe" part when using psexec/paexec
            # The "-" can also be replaced with "/"
            # The order of args isn't important
            # "cmd" can be replaced by "powershell", "pwsh" or any other console like software
            - ' -s cmd'
            - ' /s cmd'
            - ' -s -i cmd'
            - ' /s /i cmd'
            - ' /s -i cmd'
            - ' -s /i cmd'
            - ' -i -s cmd'
            - ' /i /s cmd'
            - ' -i /s cmd'
            - ' /i -s cmd'
            # Pwsh (For PowerShell 7)
            - ' -s pwsh'
            - ' /s pwsh'
            - ' -s -i pwsh'
            - ' /s /i pwsh'
            - ' /s -i pwsh'
            - ' -s /i pwsh'
            - ' -i -s pwsh'
            - ' /i /s pwsh'
            - ' -i /s pwsh'
            - ' /i -s pwsh'
            # PowerShell (For PowerShell 5)
            - ' -s powershell'
            - ' /s powershell'
            - ' -s -i powershell'
            - ' /s /i powershell'
            - ' /s -i powershell'
            - ' -s /i powershell'
            - ' -i -s powershell'
            - ' /i /s powershell'
            - ' -i /s powershell'
            - ' /i -s powershell'
    selection_flags_2:
        # Accepting EULA in commandline - often used in automated attacks
        CommandLine|contains|all:
            - 'accepteula'
            - ' -u '
            - ' -p '
            - ' \\'
    filter:
        CommandLine|contains:
            - 'paexec'
            - 'PsExec'
    condition: 1 of selection_flags_* and not filter
falsepositives:
    - Weird admins that rename their tools
    - Software companies that bundle PsExec/PAExec with their software and rename it, so that it is less embarrassing
level: high
