title: Powershell ChromeLoader Browser Hijacker
id: 27ba3207-dd30-4812-abbf-5d20c57d474e
status: experimental
description: Detects PowerShell process spawning a 'chrome.exe' process with the 'load-extension' flag to start a new chrome instance with custom extensions, as seen being used in 'ChromeLoader'
author: Aedan Russell, frack113 (sigma)
references:
    - https://redcanary.com/blog/chromeloader/
    - https://emkc.org/s/RJjuLa
date: 2022/06/19
modified: 2022/07/14
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\chrome.exe'
        ParentImage|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains|all:
            - '--load-extension='
            - '\AppData\Local\'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.persistence
    - attack.t1176
