title: Lolbin Ssh.exe Use As Proxy
id: 7d6d30b8-5b91-4b90-a891-46cccaf29598
status: experimental
description: Detect usage of the "ssh.exe" binary as a proxy to launch other programs
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ssh/
author: frack113
date: 2022/12/29
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: 'C:\Windows\System32\OpenSSH\sshd.exe'
        #ParentCommandLine: '"C:\Windows\System32\OpenSSH\sshd.exe" -R'
    condition: selection
falsepositives:
    - Unknown
level: medium
