title: Suspicious Curl Usage on Windows
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
status: test
description: Detects a suspicious curl process start on Windows and outputs the requested document to a local file
author: Florian Roth, Nasreddine Bencherchali (updated)
references:
    - https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
    - https://github.com/pr0xylife/Qakbot/blob/main/Qakbot_AA_23.06.2022.txt
date: 2020/07/03
modified: 2022/06/23
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\curl.exe'
        - Product: 'The curl executable'
    selection_cli:
        CommandLine|contains:
            - ' -O'
            - '--remote-name'
            - '--output'
    condition: all of selection*
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Scripts created by developers and admins
    - Administrative activity
level: medium
tags:
    - attack.command_and_control
    - attack.t1105
