title: Malicious payload download via Office binaries
status: experimental
description: Downloads payload from remote server
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Powerpnt.yml
    - https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191
    - Reegun J (OCBC Bank)
author: Beyu Denis, oscd.community
date: 2019/10/26
modified: 2019/11/04
tags:
    - attack.command_and_control
    - attack.t1105
level: medium
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: 
            - '*\powerpnt.exe'
            - '*\winword.exe'
            - '*\excel.exe'
        CommandLine|contains: 'http'
    condition: selection
falsepositives:
    - Unknown
