title: Suspicious Rundll32 with Current Directory an External Drive
ruletype: Sigma
author: Angelo Violetti (SEC Consult - SEC Defence)
date: 2023/03/01
description: Detects the execution of rundll32.exe and the current directory is not C
reference: sec-consult.com/blog/detail/bumblebee-hunting-with-a-velociraptor/
id: aaff35da-bcee-11ed-afa1-0242ac120002
status: experimental
tags:
    - attack.defenseevasion
    - attack.T1553.005
logsource:
  category: process_creation
  product: windows
detection:
    SELECTION_1:
        OriginalFileName: 'rundll32.exe'
    SELECTION_2:
        CurrentDirectory|startswith: 'C:\\'
    condition: SELECTION_1 and not SELECTION_2
level: medium
