title: Explorer running with suspicious command line argument
id: 9a6dacca-6d63-4ae5-8c6e-00cc3b177347
description: Detects an attempt to leverage explorer.exe, specifically the "/root" argument, to run a file with a new instance of explorer as the parent
references:
  - https://twitter.com/CyberRaiju/status/1273597319322058752
  - https://lolbas-project.github.io/lolbas/Binaries/Explorer/
  - https://www.geoffchappell.com/studies/windows/shell/explorer/cmdline.htm
status: experimental
Author: '@gott_cyber'
date: 2022/08/24
tags:
  - attack.defense-evasion
  - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\explorer.exe'
        CommandLine|contains: '/root\,'
    condition: selection
falsepositives:
    - Potentially legitimate file interactions
level: medium
