title: WMIC Hotfix Recon
id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
status: experimental
description: Detects wmic known recon method to look for installed hotfixes, often used by pentest and attackers enum scripts
author: Nasreddine Bencherchali
references:
    - https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
    - https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
date: 2022/06/20
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - OriginalFileName: 'wmic.exe'
        - Image|endswith: '\WMIC.exe'
    selection_cli:
        CommandLine|contains|all:
            - ' qfe '
            - ' get '
            - 'Caption,Description,HotFixID,InstalledOn'
    condition: all of selection*
falsepositives:
    - Unknown
level: medium
tags:
    - attack.execution
    - attack.t1047
