title: Proxy Execution via Wuauclt
id: af77cf95-c469-471c-b6a0-946c685c4798
description: Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code.
related:
    - id: ba1bb0cb-73da-42de-ad3a-de10c643a5d0
      type: obsoletes
    - id: d7825193-b70a-48a4-b992-8b5b3015cc11
      type: obsoletes
status: experimental
date: 2020/10/12
modified: 2021/05/10
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), Florian Roth, Sreeman, FPT.EagleEye Team
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.execution
references:
    - https://dtm.uk/wuauclt/
    - https://blog.malwarebytes.com/threat-intelligence/2022/01/north-koreas-lazarus-apt-leverages-windows-update-client-github-in-latest-campaign/
logsource:
    category: process_creation
    product: windows
detection:
    selection_one:
        - Image|contains: wuauclt
        - OriginalFileName: wuauclt.exe
    selection_two:
        CommandLine|contains|all:
            - 'UpdateDeploymentProvider'
            - '.dll'
            - 'RunHandlerComServer'
    filter:
        CommandLine|contains:
            - ' /UpdateDeploymentProvider UpdateDeploymentProvider.dll '
            - ' wuaueng.dll '
    condition: selection_one and selection_two and not filter
falsepositives:
    - Unknown
level: high
