title: Unusual Parent-Child Relationship
id: e106ae6d-8a61-46d0-bbdf-1d69cbb8faf3
status: experimental
description: Detects Windows programs run from unexpected parent processes
author: Tim Rauch
references:
    - https://www.elastic.co/guide/en/security/current/unusual-parent-child-relationship.html
date: 2022/09/21
logsource:
    category: process_creation
    product: windows
tags:
    - attack.privilege_escalation
    - attack.t1055
detection:
    selection_1a:
        Image|endswith:
            - '\autochk.exe'
            - '\winint.exe'
            - '\winlogon.exe'
            - '\setupcl.exe'
            - '\WerFault.exe'
    selection_1b:
        ParentImage|endswith: '\smss.exe'
    selection_2a:
        Image|endswith:
            - '\fontdrvhost.exe'
            - '\dwm.exe'
    selection_2b:
        ParentImage|endswith:
            - '\wininit.exe'
            - '\winlogon.exe'
    selection_3a:
        Image|endswith:
            - '\consent.exe'
            - '\RuntimeBroker.exe'
            - '\TiWorker.exe'
            - '\smss.exe'
            - '\wmiprvse.exe'
            - '\wsmprovhost.exe'
            - '\winrshost.exe'
    selection_3b:
        ParentImage|endswith: '\svchost.exe'
    selection_4a:
        Image|endswith:
            - '\SearchIndexer.exe'
            - '\spoolsv.exe'
    selection_4b:
        ParentImage|endswith: '\services.exe'
    selection_5a:
        Image|endswith: '\SearchProtocolHost.exe'
    selection_5b:
        ParentImage|endswith:
            - '\SearchIndexer.exe'
            - '\dllhost.exe'
    selection_6a:
        Image|endswith:
            - '\dllhost.exe'
            - '\taskhost.exe'
            - '\taskhostw.exe'
    selection_6b:
        ParentImage|endswith:
            - '\services.exe'
            - '\svchost.exe'
    selection_7a:
        Image|endswith: '\smss.exe'
    selection_7b:
        ParentImage|endswith:
            - '\System'
            - '\smss.exe'
    selection_8a:
        Image|endswith: '\csrss.exe'
    selection_8b:
        ParentImage|endswith:
            - '\smss.exe'
            - '\svchost.exe'
    selection_9a:
        Image|endswith:
            - '\lsass.exe'
            - '\LsaIso.exe'
            - '\services.exe'
    selection_9b:
        ParentImage|endswith: '\wininit.exe'
    selection_10a:
        Image|endswith: '\LogonUI.exe'
    selection_10b:
        ParentImage|endswith:
            - '\wininit.exe'
            - '\winlogon.exe'
    selection_11a:
        Image|endswith: '\svchost.exe'
    selection_11b:
        ParentImage|endswith:
            - '\MsMpEng.exe'
            - '\services.exe'
    selection_12a:
        Image|endswith: '\userinit.exe'
    selection_12b:
        ParentImage|endswith:
            - '\dwm.exe'
            - '\winlogon.exe'
    selection_13a:
        Image|endswith:
            - '\werfault.exe'
            - '\wermgr.exe'
            - '\WerFaultSecure.exe'
    selection_13b:
        ParentImage|endswith:
            - '\SearchProtocolHost.exe'
            - '\taskhost.exe'
            - '\csrss.exe'
    selection_14a:
        Image|endswith:
            - '\chkdsk.exe'
            - '\doskey.exe'
            - '\WerFault.exe'
    selection_14b:
        ParentImage|endswith: '\autochk.exe'
    selection_15a:
        Image|endswith:
            - '\WerFaultSecure.exe'
            - '\wermgr.exe'
            - '\WerFault.exe'
    selection_15b:
        ParentImage|endswith: '\wermgr.exe'
    selection_16a:
        Image|endswith:
            - '\mscorsvw.exe'
            - '\wermgr.exe'
            - '\WerFault.exe'
            - '\WerFaultSecure.exe'
    selection_16b:
        ParentImage|endswith: '\conhost.exe'
    condition: selection_1a and not selection_1b or selection_2a and not selection_2b or selection_3a and not selection_3b or selection_4a and not selection_4b or selection_5a and not selection_5b or selection_6a and not selection_6b or selection_7a and not selection_7b or selection_8a and not selection_8b or selection_9a and not selection_9b or selection_10a and not selection_10b or selection_11a and not selection_11b or selection_12a and not selection_12b or selection_13a and not selection_13b or selection_14a and not selection_14b or selection_15a and not selection_15b or selection_16a and not selection_16b
falsepositives:
    - Unknown
level: medium