title: Suspicious Netsh Discovery Command
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
status: experimental
description: Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021/12/07
modified: 2022/04/11
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'netsh '
            - 'show '
            - 'firewall '
        CommandLine|contains:
            - 'config '
            - 'state '
            - 'rule '
            - 'name=all'
    condition: selection
falsepositives:
    - Administrative activity
level: low
tags:
    - attack.discovery
    - attack.t1016
