title: Renamed or Portable Vmnat.exe
id: 7b4f794b-590a-4ad4-ba18-7964a2832205
status: experimental
description: Detects renamed vmnat.exe or portable version that can be used for DLL side-loading
references:
    - https://twitter.com/malmoeb/status/1525901219247845376
author: elhoim
date: 2022/09/09
tags:
    - attack.defense_evasion
    - attack.t1574.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: 'vmnat.exe'
    filter_rename:
        Image|endswith: 'vmnat.exe'
    filter_portable:
        Image:
            - 'C:\Program Files (x86)\VMware\VMware Workstation\vmnat.exe'
            - 'C:\Windows\SysWOW64\vmnat.exe'
    condition: selection and not 1 of filter_*
falsepositives:
    - Unknown
level: high
