title: LOLBIN From Abnormal Drive
id: d4ca7c59-e9e4-42d8-bf57-91a776efcb87
status: test
description: Detects LOLBINs executing from an abnormal drive such as a mounted ISO.
references:
    - https://thedfirreport.com/2021/12/13/diavol-ransomware/
    - https://www.scythe.io/library/threat-emulation-qakbot
    - https://sec-consult.com/blog/detail/bumblebee-hunting-with-a-velociraptor/
author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Angelo Violetti - SEC Consult '@angelo_violetti'
date: 2022/01/25
modified: 2023/04/12
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith:
            - '\rundll32.exe'
            - '\calc.exe'
            - '\mshta.exe'
            - '\cscript.exe'
            - '\wscript.exe'
            - '\regsvr32.exe'
            - '\installutil.exe'
            - '\cmstp.exe'
        - OriginalFileName:
            - 'RUNDLL32.EXE'
            - 'CALC.EXE'
            - 'MSHTA.EXE'
            - 'cscript.exe'
            - 'wscript.exe'
            - 'REGSVR32.EXE'
            - 'installutil.exe'
            - 'CMSTP.EXE'
    filter_main_currentdirectory:
        CurrentDirectory|contains: 'C:\'
    filter_main_empty:
        CurrentDirectory: ''
    filter_main_null:
        CurrentDirectory: null
    condition: selection and not 1 of filter_main_*
falsepositives:
    - Rare false positives could occur on servers with multiple drives.
level: medium
