title: HackTool - winPEAS Execution
id: 98b53e78-ebaf-46f8-be06-421aafd176d9
status: test
description: WinPEAS is a script that search for possible paths to escalate privileges on Windows hosts. The checks are explained on book.hacktricks.xyz
references:
    - https://github.com/carlospolop/PEASS-ng
    - https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation
author: Georg Lauenstein -- sure[secure]
date: 2022/09/19
modified: 2023/03/20
tags:
    - attack.privilege_escalation
    - attack.t1082
    - attack.t1087
    - attack.t1046
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - '\winPEASany.exe'
            - '\winPEASany_ofs.exe'
            - '\winPEASx64.exe'
            - '\winPEASx64_ofs.exe'
            - '\winPEASx86.exe'
            - '\winPEASx86_ofs.exe'
        OriginalFileName: 'winPEAS.exe'
    selection_cmd:
        CommandLine|contains:
            - ' domain' # Enumerate domain information
            - ' systeminfo' # Search system information
            - ' userinfo' # Search user information
            - ' processinfo' # Search processes information
            - ' servicesinfo' # Search services information
            - ' applicationsinfo' # Search installed applications information
            - ' windowscreds' # Search windows credentials
            - ' browserinfo' # Search browser information
            - ' filesinfo' # Search generic files that can contains credentials
            - ' fileanalysis' # Search specific files that can contains credentials and for regexes inside files
            - ' eventsinfo' # Display interesting events information
    selection_wsl:
         Image|startswith: '\WindowsApps\MicrosoftCorporationII.WindowsSubsystemForLinux_'
         Image|endswith: '\wsl.exe'
         OriginalFileName: 'wsl.exe'
         CommandLine|contains|all:
            - '"bash"'
            - '-c'
            - 'curl'
            - 'https://github.com/carlospolop/PEASS-ng/releases/latest/download/linpeas.sh' # use linpeas for WSL with default URL from linpeas.sh
            - ' ---silent | sh'
    condition: selection_img or (selection_img and selection_cmd) or selection_wsl
falsepositives:
    - Unknown
level: high
