title: HackTool - WSASS Execution for PPL Bypass and LSASS Dumping
id: 589ac73f-8e12-409c-964e-31a2f5775ae2
status: experimental
description: Detects execution of WSASS, a tool used to dump LSASS memory on Windows systems by leveraging Windows Error Reporting (WER)'s WerFaultSecure.EXE to bypass Protected Process Light (PPL) protections.
references:
    - https://github.com/TwoSevenOneT/WSASS
    - https://www.zerosalarium.com/2025/09/Dumping-LSASS-With-WER-On-Modern-Windows-11.html
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-10-21
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\wsass.exe'
    selection_cli:
        CommandLine|re: \.exe\s+[\"\']?\S{,64}\s+\d{,5}  # wsass.exe "path to werfaultsecure" lsass_pid
        CommandLine|contains: 'werfaultsecure'
    condition: 1 of selection_*
falsepositives:
    - Unlikely
level: high