title: Microsoft IIS Service Account Password Dumped
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
status: experimental
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords
references:
    - https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
author: Tim Rauch
date: 2022/09/28
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection_name:
        - Image|endswith: '\appcmd.exe'
        - OriginalFilename: 'appcmd.exe'
    selection_list:
        CommandLine|contains:
            - ' /list '
            - ' list '
    selection_all:
        CommandLine|contains|all:
            - ' /text'
            - ' password'
    condition: all of selection*
falsepositives:
    - Unknown
level: high
