title: Suspicious Sigverif Execution
id: 7d4aaec2-08ed-4430-8b96-28420e030e04
status: test
description: Detects the execution of sigverif binary as a parent process which could indicate it being used as a LOLBIN to proxy execution
references:
    - https://www.hexacorn.com/blog/2018/04/27/i-shot-the-sigverif-exe-the-gui-based-lolbin/
    - https://twitter.com/0gtweet/status/1457676633809330184
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
tags:
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\sigverif.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium
