title: Potential Recon Activity Via Nltest.EXE
id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
related:
    - id: 410ad193-a728-4107-bc79-4419789fcbf8
      type: similar
    - id: 903076ff-f442-475a-b667-4f246bcc203b
      type: similar
status: experimental
description: Detects nltest commands that can be used for information discovery
references:
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
    - https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/
    - https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
    - https://book.hacktricks.xyz/windows/basic-cmd-for-pentesters
    - https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
    - https://eqllib.readthedocs.io/en/latest/analytics/03e231a6-74bc-467a-acb1-e5676b0fb55e.html
    - https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
author: Craig Young, oscd.community, Georg Lauenstein
date: 2021/07/24
modified: 2023/02/01
tags:
    - attack.discovery
    - attack.t1016
    - attack.t1482
logsource:
    category: process_creation
    product: windows
detection:
    selection_nltest:
        - Image|endswith: '\nltest.exe'
        - OriginalFileName: 'nltestrk.exe'
    selection_recon1:
        CommandLine|contains|all:
            - '/server'
            - '/query'
    selection_recon2:
        CommandLine|contains:
            - '/dclist:'
            - '/parentdomain'
            - '/domain_trusts'
            - '/all_trusts' # Flag for /domain_trusts
            - '/trusted_domains'
            - '/user'
    condition: selection_nltest and 1 of selection_recon*
fields:
    - Image
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate administration use but user and host must be investigated
level: high
