title: Tap Installer Execution
id: 99793437-3e16-439b-be0f-078782cf953d
status: test
description: Well-known TAP software installation. Possible preparation for data exfiltration using tunneling techniques
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
modified: 2022/08/10
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\tapinstall.exe'
  filter_avast:
    Image:
      - 'C:\Program Files\Avast Software\SecureLine VPN\tapinstall.exe'
      - 'C:\Program Files (x86)\Avast Software\SecureLine VPN\tapinstall.exe'
  condition: selection and not 1 of filter*
falsepositives:
  - Legitimate OpenVPN TAP insntallation
level: medium
tags:
  - attack.exfiltration
  - attack.t1048
