title: Wmic Uninstall Security Product
id: 847d5ff3-8a31-4737-a970-aeae8fe21765
description: Detects uninstallation or termination of security products using the WMIC utility
references:
    - https://twitter.com/cglyer/status/1355171195654709249
    - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
    - https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions
    - https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
date: 2021/01/30
modified: 2022/08/22
status: experimental
author: Florian Roth, Nasreddine Bencherchali
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli_1:
        CommandLine|contains|all:
            - 'wmic'
            - 'product where '
            - 'call uninstall'
            - '/nointeractive'
    selection_cli_2:
        CommandLine|contains|all:
            - 'wmic'
            - 'caption like '
        CommandLine|contains:
            - 'call delete'
            - 'call terminate'
    selection_product:
        CommandLine|contains:
            - 'Antivirus'
            - 'AVG '
            - 'Crowdstrike Sensor'
            - 'DLP Endpoint'
            - 'Endpoint Detection'
            - 'Endpoint Protection'
            - 'Endpoint Security'
            - 'Endpoint Sensor'
            - 'ESET File Security'
            - 'Malwarebytes'
            - 'McAfee Agent'
            - 'Microsoft Security Client'
            - 'Threat Protection'
            - 'VirusScan'
            - 'Webroot SecureAnywhere'
            - 'Windows Defender'
            - 'CarbonBlack'
            - 'Carbon Black'
            - 'Cb Defense Sensor 64-bit'
            - 'Dell Threat Defense'
            - 'Cylance '
            - 'LogRhythm System Monitor Service'
            - 'Sophos Anti-Virus'
            - 'Sophos AutoUpdate'
            - 'Sophos Management Console'
            - 'Sophos Management Database'
            - 'Sophos Credential Store'
            - 'Sophos Update Manager'
            - 'Sophos Management Server'
            - 'Sophos Remote Management System'
            - '%Sophos%'
            - '%carbon%'
            - '%cylance%'
            - '%eset%'
            - '%symantec%'
    condition: 1 of selection_cli_* and selection_product
falsepositives:
    - Legitimate administration
level: high
