title: Suspicious processes Started From PSExec service
id: fdfcbd78-48f1-4a4b-90ac-d82241e368c5
status: experimental
description: Detects launching suspicious processes from PSExec service
references:
    - https://www.youtube.com/watch?v=ro2QuZTIMBM (minute:10:43)
author: Romaissa Adjailia
date: 2022/07/21
tags:
    - attack.execution 
logsource:
    category: process_creation
    product: windows
    service: sysmon
detection:
    selection:
      ParentImage|endswith: '\psexesvc.exe'
      OriginalFileName:
        # Add more suspicious processes
        - 'cmd.exe'
        - 'powershell.exe'
    condition: selection
fields:
    - CommandLine
    - OriginalFileName
    - Parentimage
    - ParentCommandLine
falsepositives:
    - Legitimate administrative tasks
level: high
