title: Sliver C2 Implant Activity Pattern
id: 42333b2c-b425-441c-b70e-99404a17170f
status: experimental
description: Detects process activity patterns as seen being used by Sliver C2 framework implants
author: Nasreddine Bencherchali, Florian Roth
references:
   - https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/implant/sliver/shell/shell_windows.go#L36
   - https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
date: 2022/08/25
logsource:
   category: process_creation
   product: windows
detection:
   selection_cmdline:
      CommandLine|contains: '-NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8'
   condition: 1 of selection*
falsepositives:
   - Unlikely
level: critical
tags:
   - attack.execution
   - attack.t1059
