title: Suspicious Curl Usage on Windows
id: 9740755c-4e83-43bf-b6ec-bb3422bee84c
status: experimental
description: Detects a suspicious curl process start on Windows and outputs the requested document to a local file
author: Florian Roth
references:
    - https://twitter.com/max_mal_/status/1542461200797163522
date: 2022/07/05
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\curl.exe'
        - Product: 'The curl executable'
    selection_cli:
        - CommandLine|contains:
            - '\AppData\'
            - '\Users\Public\'
            - '\Temp'
        - CommandLine|endswith:
            - '.jpg'
            - '.jpeg'
            - '.png'
            - '.gif'
            - '.tmp'
            - '.temp'
            - '.txt'
    condition: all of selection*
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
tags:
    - attack.command_and_control
    - attack.t1105
