title: RunXCmd Tool Execution As System
id: 93199800-b52a-4dec-b762-75212c196542
status: experimental
description: Detects the use of RunXCmd tool for command execution
author: Florian Roth
date: 2022/01/24
references:
    - https://www.d7xtech.com/free-software/runx/
    - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - ' /account=system '
            - '/exec='
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate use by administrators
level: high