title: Makecab Compression Into Alternate Data Stream
id: 7b0af45b-55cb-419b-be7f-d7d5e8fe7a72
status: experimental
description: |
    Detects usage of "makecab.exe" where the destination cabinet is written into an NTFS Alternate Data Stream (ADS).
    Adversaries abuse "makecab.exe" to compress a payload into an ADS in order to hide it from directory listings and evade detection.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Makecab/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md
author: EinLamYe
date: 2026-06-29
tags:
    - attack.stealth
    - attack.t1564.004
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\makecab.exe'
        - OriginalFileName: 'makecab.exe'
    selection_ads:
        CommandLine|re: '\\[^\\ ]+:[^\\/ ]'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
