title: Regsvr32 Execution Anomaly
id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
status: experimental
description: Detects various anomalies or uncommon execution trees related "regsvr32.exe"
references:
    - https://web.archive.org/web/20171001085340/https://subt0x10.blogspot.com/2017/04/bypass-application-whitelisting-script.html
    - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
author: Florian Roth (Nextron Systems), oscd.community, Tim Shelton
date: 2019/01/16
modified: 2023/05/24
tags:
    - attack.defense_evasion
    - attack.t1218.010
    - car.2019-04-002
    - car.2019-04-003
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith: '\regsvr32.exe'
        CommandLine|contains:
            - '\Temp\'
            - '\AppData\Local'
            - 'C:\Users\Public'
    selection2:
        Image|endswith: '\regsvr32.exe'
        ParentImage|endswith:
            - '\cmd.exe'
            - '\mshta.exe'
            - '\powershell_ise.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
    selection6:
        Image|endswith: '\EXCEL.EXE'
        CommandLine|contains: '..\..\..\Windows\System32\regsvr32.exe '
    filter1:
        CommandLine|contains:
            - '\AppData\Local\Microsoft\Teams'
            - '\AppData\Local\WebEx\WebEx64\Meetings\atucfobj.dll'
    condition: 1 of selection* and not 1 of filter*
falsepositives:
    - Unknown
level: high
