title: Using explorer.exe to open a file explorer folder via command prompt
id: c3d76afc-93df-461e-8e67-9b2bad3f2ac4
status: Experimental
description: Detects the initial execution of cmd.exe which spawns explorer.exe with the appropriate command line arguments for opening the My Computer folder. 
author: '@Kostastsale'
references: 
  - 
date: 2022/12/22
logsource:
  product: windows
  category: process_creation
detection:
  selection1:
    ParentImage|endswith: 
      - '\cmd.exe'
      - '\powershell.exe'
  selection2:
    Image|endswith: 
      - '\explorer.exe'
    CommandLine|contains:
      - 'explorer.exe shell:mycomputerfolder'
  condition: selection1 and selection2
falsepositives:
  - Uknown
level: high
tags:
  - attack.Discovery
  - attack.T1135