title: Renamed CreateDump Process Dump
id: 1a1ed54a-2ba4-4221-94d5-01dee560d71e
status: experimental
description: Detects uses of a renamed legitimate createdump.exe LOLOBIN utility to dump process memory
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
    - https://twitter.com/bopin2020/status/1366400799199272960
author: Florian Roth
date: 2022/09/20
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: 'FX_VER_INTERNALNAME_STR'
    selection_cli:
        CommandLine|contains|all:
            - ' -u ' # Short version of '--full'
            - ' -f ' # Short version of '--name'
            - '.dmp'
    filter:
        Image|endswith: '\createdump.exe'
    condition: 1 of selection* and not filter
falsepositives:
    - Command lines that use the same flags
level: high
