title: PUA - Suspicious ActiveDirectory Enumeration Via AdFind.EXE
id: 455b9d50-15a1-4b99-853f-8d37655a4c1b
related:
    - id: 9a132afa-654e-11eb-ae93-0242ac130002
      type: similar
status: test
description: Detects active directory enumeration activity using known AdFind CLI flags
references:
    - https://www.joeware.net/freetools/tools/adfind/
    - https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.002/T1087.002.md
author: frack113, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2021-12-13
modified: 2025-02-23
tags:
    - attack.discovery
    - attack.t1087.002
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - Image|endswith: '\AdFind.exe'
        - OriginalFileName: 'AdFind.exe'
        - Hashes|contains:
              - 'IMPHASH=d144de8117df2beceaba2201ad304764'
              - 'IMPHASH=12ce1c0f3f5837ecc18a3782408fa975'
              - 'IMPHASH=bca5675746d13a1f246e2da3c2217492'
              - 'IMPHASH=4fbf3f084fbbb2470b80b2013134df35'
              - 'IMPHASH=49b639b4acbecc49d72a01f357aa4930'
              - 'IMPHASH=53e117a96057eaf19c41380d0e87f1c2'
              - 'IMPHASH=680dad9e300346e05a85023965867201'
              - 'IMPHASH=21aa085d54992511b9f115355e468782'
    selection_cmd_password: # Listing password policy
        CommandLine|contains:
            - lockoutduration
            - lockoutthreshold
            - lockoutobservationwindow
            - maxpwdage
            - minpwdage
            - minpwdlength
            - pwdhistorylength
            - pwdproperties
    selection_cmd__enum_ad: # Enumerate Active Directory Admins
        CommandLine|contains: '-sc admincountdmp'
    selection_cmd_enum_exchange: # Enumerate Active Directory Exchange AD Objects
        CommandLine|contains: '-sc exchaddresses'
    condition: selection_img and 1 of selection_cmd_*
falsepositives:
    - Authorized administrative activity
level: high
