title: Ncat Execution
id: e31033fc-33f0-4020-9a16-faf9b31cbf08
status: experimental
author: frack113, Florian Roth
date: 2021/07/21
modified: 2022/07/11
description: Adversaries may use a non-application layer protocol for communication between host and C2 server or among infected hosts within a network
references:
    - https://nmap.org/ncat/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
tags:
    - attack.command_and_control
    - attack.t1095
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        # can not use OriginalFileName as is empty
        Image|endswith:
            - '\ncat.exe'
            - '\netcat.exe'
    selection_cmdline:
        # Typical command lines
        CommandLine|contains:
            - ' -lvp '
            - ' -lvnp'
            - ' -l -v -p '
            - ' -lv -p '
            - ' -l --proxy-type http '
            - ' --exec cmd.exe '
            - ' -vnl --exec '
    condition: 1 of selection_*
falsepositives:
    - Legitimate ncat use
level: high
