title: RunDLL32 Spawning Explorer
id: caa06de8-fdef-4c91-826a-7f9e163eef4b
description: Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon, often observes Gamarue spawning the explorer.exe process in an unusual way
author: elhoim
status: experimental
date: 2022/04/27
references:
  - https://redcanary.com/blog/intelligence-insights-november-2021/
tags:
  - attack.defense_evasion
  - attack.t1218.011
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ParentImage|endswith: '\rundll32.exe'
    Image|endswith: '\explorer.exe'
  condition: selection
falsepositives:
  - Unknown
level: high
