title: Ryuk Ransomware Command Line Activity
id: 0acaad27-9f02-4136-a243-c357202edd74
status: stable
description: Detects Ryuk Ransomware command lines
references:
    - https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/
author: Vasiliy Burov
date: 2019/08/06
modified: 2022/12/02
tags:
    - attack.execution
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
            - '\net.exe'
            - '\net1.exe'
        CommandLine|contains: 'stop'
    selection2:
        CommandLine|contains:
            - 'samss'
            - 'audioendpointbuilder'
            - 'unistoresvc_'
    condition: all of selection*
falsepositives:
    - Unlikely
level: critical
