title: Indirect Command Execution by Microsoft Teams
id: 8abf3e61-91a2-4b34-bcc7-728d5fa92e49
status: experimental
description: Detects indirect command execution via Microsoft teams
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Teams/
author: Swachchhanda Shrawan Poudel
date: 2023/08/11
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\Teams.exe'
        - OriginalFileName: 'Teams.exe'
    selection_cmd:
        - CommandLine|contains|all:
            - '--gpu-launcher='
            - '&&'
        - ParentCommandLine|contains|all:
            - '--gpu-launcher='
            - '&&'
    condition: selection_img and selection_cmd
falsepositives:
    - Unlikely
level: high