title: Suspicious Forfiles Proxy Execution
id: 3c646e76-37a0-4f3d-8fa9-66c3dc2b7f80
status: experimental
description: Detects suspicious use of forfiles.exe to proxy execution via cmd, powershell, or mshta, often used in evasive script-based attacks and malware delivery.
author: 'Skyler "Keys" Piatiak (vVv-Keys)'
date: 2025-06-21
logsource:
    product: windows
    category: process_creation
detection:
    selection_forfiles:
        Image|endswith: '\forfiles.exe'
    selection_payload:
        CommandLine|contains:
            - 'cmd /c'
            - 'powershell'
            - 'mshta'
    condition: selection_forfiles and selection_payload
fields:
    - CommandLine
    - Image
    - ParentImage
falsepositives:
    - Legitimate automation or administrative scripts using forfiles
level: high
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1059.003
    - attack.t1218
references:
    - https://attack.mitre.org/techniques/T1218/
    - https://www.trustedsec.com/blog/abusing-forfiles-exe-for-command-execution/
    - https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
