title: Windows Binary Executed From WSL
id: ed825c86-c009-4014-b413-b76003e33d35
status: experimental
description: Detects execution of windows binaries from wihthin a WSL instance. This could be used to avoid parent/child relationship detections or similar
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/14
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|re: '[a-zA-Z]:\\'
        CurrentDirectory|contains: '\\\\wsl.localhost' # Note: programs not supporting UNC paths (example: cmd.exe). Will default to another location
    condition: selection
falsepositives:
    - Unknown
level: medium
