title: Suspicious Memory Dump Execution
id: 129966c9-de17-4334-a123-8b58172e664d
description: Detects when a user bypasses Defender and dumps LSASS by renaming procdump.exe to dump64.exe
status: experimental
author: Austin Songer @austinsonger
date: 2021/11//26
references:
    - https://twitter.com/mrd0x/status/1460597833917251595
logsource:
      product: windows
      category: process_creation
detection: 
    lolbas:
        CommandLine|contains:
            - dump64.exe
            - .dmp
    condition: selection
tags:
    - attack.credential_access
    - attack.t1003
    - attack.T1003.001
level: high
falsepositives:
    - Unlikely
