title: Suspicious Msedgewebview2 Parents
id: c398f994-d5b3-49cd-8d11-20449bdafc84
status: experimental
description: Detects suspicious Msedgewebview2 parent processes that can be a Proxy Execution
references:
    - https://lolbas-project.github.io/lolbas/Binaries/msedgewebview2/
author: frack113
date: 2023/09/03
tags:
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\msedgewebview2.exe'
    filter:
        Image|endswith: '\msedgewebview2.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium