title: PCHunter Execution
id: df5daa7b-c2d5-4a4d-972b-5f85febe56bc
status: experimental
description: Detects the execution PCHunter based on image and Original File Name fields.
references:
    - http://www.xuetr.com/
    - https://www.hexacorn.com/blog/2018/04/20/kernel-hacking-tool-you-might-have-never-heard-of-xuetr-pchunter/
author: Nasreddine Bencherchali
date: 2022/10/05
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith:
            - '\PCHunter32.exe'
            - '\PCHunter64.exe'
        - OriginalFileName: 'PCHunter.exe'
    condition: selection
falsepositives:
    - Unlikely
level: high
