title: GatherNetworkInfo.vbs Script Usage
id: 575dce0c-8139-4e30-9295-1ee75969f7fe
status: experimental
description: Adversaries can abuse of C:\Windows\System32\gatherNetworkInfo.vbs script along with cscript.exe to gather information about the target
references:
    - https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
author: blueteamer8699
date: 2022/01/03
tags:
    - attack.discovery
    - attack.execution
    - attack.t1615
    - attack.t1059.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'cscript.exe'
            - 'gatherNetworkInfo.vbs'
    condition: selection
fields:
    - CommandLine
    - ParentImage
falsepositives:
    - Administrative activity
level: medium
