title: Winrs Local Command Execution
id: 79df3f68-dccb-48e9-9171-b75cbc37c51d
status: experimental
description: |
    This rule alerts when WinRM is used to execute a command or process by monitoring winrshost.exe.
references:
    - https://cardinalops.com/blog/living-off-winrm-abusing-complexity-in-remote-management/
    - https://strontic.github.io/xcyclopedia/library/winrshost.exe-6790044CEB4BA5BE6AA8161460D990FD.html
author: Liran Ravich
date: 2025-08-19
tags:
    - attack.lateral-movement
    - attack.t1021.006
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\winrshsot.exe'
    condition: selection 
falsepositives:
    - Legitimate use of WinRM withih the organziation
level: high
