title: Rundll32 Suspicious user32.dll Call
id: 3b5b0213-0460-4e3f-8937-3abf98ff7dcc
description: Detects suspicious call to user32.dll function
status: experimental
references:
    - https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/
author: frack113
date: 2022/06/04
logsource:
    category: process_creation
    product: windows
detection:
    selection_call:
        Image|endswith: '\rundll32.exe'
        ParentImage|endswith: '\cmd.exe'
        CommandLine|contains: 'user32.dll,'
    selection_function: 
        CommandLine|contains: 'LockWorkStation'
    condition: all of selection*
fields:
    - Image
    - ParentImage
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion 