title: Suspicious Netsh Discovery Command
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
status: experimental
description: Adversaries may look for details about the network configuration and settings of systems they access or through information discovery of remote systems
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
author: frack113
date: 2021/12/07
logsource:
    category: process_creation
    product: windows
detection:
    network_cmd:
        CommandLine|contains|all:
            - 'netsh '
            - 'advfirewall '
            - 'firewall '
            - 'show '
            - 'rule '
            - 'name=all'
    condition: network_cmd
falsepositives:
    - Administrator, hotline ask to user
level: low
tags:
    - attack.discovery
    - attack.t1016
