title: Suspicious Listing of Network Connections
id: 1c67a717-32ba-409b-a45d-0fb704a73a81
status: experimental
description: Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery
author: frack113
date: 2021/12/10
modified: 2022/07/14
logsource:
    category: process_creation
    product: windows
detection:
    netstat:
        CommandLine|contains: netstat
    net_cmd:
        CommandLine|contains: 'net '
    net_opt:
        - CommandLine|endswith:
            - ' use'
            - ' sessions'
        - CommandLine|contains:
            - ' use '
            - ' sessions '
    condition: netstat or all of net_*
falsepositives:
    - Unknown
level: low
tags:
    - attack.discovery
    - attack.t1049
