title: WSF/JSE/JS/VBA/VBE File Execution
id: 1e33157c-53b1-41ad-bbcc-780b80b58288
related:
    - id: 23250293-eed5-4c39-b57a-841c8933a57d
      type: obsoletes
status: test
description: Detects suspicious file execution by wscript and cscript
author: Michael Haag
date: 2019/01/16
modified: 2023/03/02
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007

logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - OriginalFileName:
            - 'wscript.exe'
            - 'cscript.exe'
        - Image|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
    selection_cli:
        CommandLine|contains:
            - '.js'
            - '.jse'
            - '.vba'
            - '.vbe'
            - '.vbs'
    condition: all of selection_*
falsepositives:
    - Will need to be tuned. I recommend adding the user profile path in CommandLine if it is getting too noisy.
level: medium
