title: Rundll32 Execution Without DLL File
id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
status: experimental
description: Detects the execution of rundll32 with a command line that doesn't contain a .dll file
references:
    - https://twitter.com/mrd0x/status/1481630810495139841?s=12
author: Tim Shelton, Florian Roth (Nextron Systems), Yassine Oukessou (fix + fp)
date: 2022/01/13
modified: 2023/03/24
tags:
    - attack.defense_evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\rundll32.exe'
        - OriginalFileName: 'RUNDLL32.EXE'
    filter_empty:
        CommandLine: null
    filter_generic:
        - CommandLine|contains: '.dll'
        - CommandLine: ''
    filter_parent_null:
        CommandLine|startswith: 'C:\Windows\system32\rundll32.exe C:\Windows\system32\inetcpl.cpl,ClearMyTracksByProcess'
    filter_iexplore:
        ParentImage|endswith: ':\Program Files\Internet Explorer\iexplore.exe'
        CommandLine|contains: '.cpl'
    filter_msiexec_syswow64:
        ParentImage|endswith: ':\Windows\SysWOW64\msiexec.exe'
        ParentCommandLine|startswith: 'C:\Windows\syswow64\MsiExec.exe -Embedding'
    filter_msiexec_system32:
        ParentImage|endswith: ':\Windows\System32\msiexec.exe'
        ParentCommandLine|startswith: 'C:\Windows\system32\MsiExec.exe -Embedding'
    filter_splunk_ufw:
        ParentImage|endswith: ':\Windows\System32\cmd.exe'
        ParentCommandLine|contains: ' C:\Program Files\SplunkUniversalForwarder\'
    filter_localserver_fp:
        CommandLine|contains: ' -localserver '
    filter_mcafee:
        - ParentCommandLine|startswith: 'C:\Windows\system32\rundll32.exe" "C:\Program Files\McAfee\MSC\mcmscins.dll",DllUninstallFunction '
        - CommandLine|startswith: 'C:\Windows\system32\rundll32.exe" /uninstall /longpath "C:\Program Files\McAfee\MSC\mscrem.inf'
    filter_edge_update:
        ParentImage|startswith: 'C:\Users\'
        ParentImage|contains: '\AppData\Local\Microsoft\EdgeUpdate\Install\{'
        ParentImage|endswith: '\setup.exe'
        ParentCommandLine|contains: '\setup.exe" --install-archive="C:\Users\'
    filter_avira:
        CommandLine|contains|all:
            - 'C:\Windows\Installer\MSI'
            - '.tmp'
            - 'zzzzInvokeManagedCustomActionOutOfProc'
            - 'Avira.OE.Setup'
    condition: selection and not 1 of filter_*
fields:
    - Image
    - CommandLine
falsepositives:
    - Unknown
level: high
