title: Procdump Usage
id: 2e65275c-8288-4ab4-aeb7-6274f58b6b20
description: Detects usage of the SysInternals Procdump utility
status: experimental
references:
    - Internal Research
author: Florian Roth
date: 2021/08/16
modified: 2022/08/11
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\procdump.exe'
            - '\procdump64.exe'
    condition: selection
falsepositives:
    - Legitimate use of procdump by a developer or administrator
level: medium
