title: Forfiles Command Execution From Alternate Data Stream
id: 448281a8-6701-4046-855d-e38cb3470e02
status: experimental
description: |
    Detects usage of "forfiles.exe" where the "/c" command argument references an NTFS Alternate Data Stream (ADS).
    Adversaries abuse "forfiles.exe" as an execution proxy to launch a payload that was previously hidden inside an ADS, evading detection.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md
author: EinLamYe
date: 2026-06-29
tags:
    - attack.stealth
    - attack.t1564.004
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\forfiles.exe'
        - OriginalFileName: 'forfiles.exe'
    selection_cmd:
        CommandLine|contains: ' /c '
    selection_ads:
        CommandLine|re: '\\[^\\ ]+:[^\\/ ]'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
