title: Suspicious Usage Of ShellExec_rundll
id: d87bd452-6da1-456e-8155-7dc988157b7d
description: Detects suspicious usage of the ShellExec_rundll function to launch other commands as seen in the the raspberry-robin attack
status: experimental
references:
    - https://redcanary.com/blog/raspberry-robin/
author: Nasreddine Bencherchali
date: 2022/09/01
logsource:
    category: process_creation
    product: windows
detection:
    selection_openasrundll:
        CommandLine|contains: ',ShellExec_rundll'
    selection_suspcli:
        CommandLine|contains:
            # Add more LOLBINs and Susp Paths
            - 'regsvr32'
            - 'C:\Users\Public\'
            - 'odbcconf'
            - '\Desktop\'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion
