title: Network Enumeration
id: 8aefd180-56e6-4850-a205-a26c61a24a8f
status: experimental
description: Detects net.exe or net1.exe used for network enumeration
references:
    - 'https://www.elastic.co/guide/en/security/current/windows-network-enumeration.html'
author: Tim Rauch
date: 2022/09/15
logsource:
    catgeory: process_creation
    product: windows
tags:
    - attack.discovery
    - attack.t1018
detection:
    selection_net:
        - Image|endswith: '\net.exe'
        - OriginalFilename: 'net.exe'
    selection_net1:
        - Image|endswith: '\net1.exe'
        - OriginalFilename: 'net1.exe'
    selection_parent:
        ParentName: '\net.exe'
    selection_view:
        CommandLine|contains: 'view'
    selection_time:
        CommandLine|contains|all:
            - 'time'
            - '\\\\*'
    condition: (selection_net or (selection_net1 and not selection_parent)) and (selection_view or selection_time)
falsepositives:
    - Legitimate administrative network enumeration
level: medium