title: Regsvr32 Spawning Explorer
id: 6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
status: experimental
description: Detects "regsvr32.exe" spawning "explorer.exe", which is very uncommon.
references:
    - https://redcanary.com/blog/intelligence-insights-april-2022/
    - https://www.echotrail.io/insights/search/regsvr32.exe
author: elhoim
date: 2022/05/05
modified: 2022/07/28
tags:
    - attack.defense_evasion
    - attack.t1218.010
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\regsvr32.exe'
        Image|endswith: '\explorer.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
