title: PsExec/PAExec Escalation to LOCAL SYSTEM
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
status: experimental
description: Detects suspicious flags used by PsExec and PAExec to escalate a command line to LOCAL_SYSTEM rights
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.poweradmin.com/paexec/
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth
date: 2021/11/23
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd_to_system: # Escalation to LOCAL_SYSTEM
        CommandLine|endswith: ' -s cmd.exe'
    selection_supporting_flags:
        CommandLine|contains:
            - 'PsExec'
            - 'PAExec'
            - 'accepteula'
            - 'cmd /c '
    condition: selection_supporting_flags and selection_cmd_to_system 
falsepositives:
    - Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance purposes (rare) 
level: high
tags:
    - attack.develop_capabilities
    - attack.t1587.001