title: Reg Add Suspicious Path 
id: b7e2a8d4-74bb-4b78-adc9-3f92af2d4829
status: experimental
description: An adversary may use many registry path with reg.exe 
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-40---ursnif-malware-registry-key-creation
author: frack113
date: 2022/08/19
logsource:
    category: process_creation
    product: windows
detection:
    selection_reg:
        - Image|endswith: \reg.exe
        - OriginalFileName: reg.exe
    selection_path:
        CommandLine|contains: \Software\AppDataLow\Software\Microsoft\
    condition: all of selection_*
falsepositives:
    - Legitimate use
level: medium
tags:
  - attack.defense_evasion
  - attack.t1112 
