title: Suspicious WERMGR Process Patterns
id: CBEC226F-63D9-4ECA-9F52-DFB6652F24DF
status: experimental
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) process patterns - suspicious parents / children, execution folders, command lines etc.
references:
    - https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
    - https://www.echotrail.io/insights/search/wermgr.exe
author: Florian Roth
date: 2022/10/14
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\wermgr.exe'
    filter_img_location:
        Image|contains:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
    selection_susp_parent:
        ParentImage|endswith: '\wermgr.exe'
        Image|endswith:
            - '\nslookup.exe'
            - '\ipconfig.exe'
            - '\net.exe'
            - '\net1.exe'
            - '\whoami.exe'
            - '\netstat.exe'
            - '\systeminfo.exe'
            - '\cmd.exe'
            - '\powershell.exe'
    condition: selection_img and not filter_img_location or 1 of selection_susp*
falsepositives:
    - Unknown
level: high
