title: Quarks PwDump Usage
id: 0685b176-c816-4837-8e7b-1216f346636b
status: experimental
description: Detects usage of the Quarks PwDump tool via commandline arguments
author: Nasreddine Bencherchali
references:
    - https://github.com/quarkslab/quarkspwdump
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east
date: 2022/09/05
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\QuarksPwDump.exe'
    selection_cli:
        CommandLine:
            - ' -dhl'
            - ' --dump-hash-local'
            - ' -dhdc'
            - ' --dump-hash-domain-cached'
            - ' --dump-bitlocker'
            - ' -dhd '
            - ' --dump-hash-domain '
            - '--ntds-file'
    condition: 1 of selection_*
falsepositives:
    - Unlikely
level: high
tags:
    - attack.credential_access
    - attack.t1003.002
