title: HackTool - SharpMove Tool Execution
id: 055fb54c-a8f4-4aee-bd44-f74cf30a0d9d
status: experimental
description: Detects execution of hacktool SharpMove
references:
    - https://github.com/0xthirteen/SharpMove/tree/master
    - https://pentestlab.blog/tag/sharpmove/
author: Luca Di Bartolomeo (CrimpSec)
date: 2024/01/21
tags:
    - attack.lateral_movement
    - attack.t1021.002
logsource:
    category: process_creation
    product: windows
detection:
    selection_sharpmove:
        - Image|endswith: '\SharpMove.exe'
        - OriginalFileName: SharpMove.exe
    selection_params:
        - CommandLine|contains:
            - 'action=query'
            - 'action=create'
            - 'action=executevbs'
            - 'action=taskscheduler'
            - 'action=dcom'
            - 'action=scm'
            - 'action=modsvc'
            - 'action=modschtask'
            - 'action=hijackdcom'
            - 'action=startservice'
    computername:
        - CommandLine|contains: 'computername='
    condition: 1 of selection* and computername
falsepositives:
    - Other programs that use these commandline options
level: high
