title: Process Memory Dumped Via RdrLeakDiag.EXE
id: 6355a919-2e97-4285-a673-74645566340d
status: experimental
description: Detects uses of the rdrleakdiag.exe LOLOBIN utility to dump process memory
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
author: Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2022/01/04
modified: 2023/04/24
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\rdrleakdiag.exe'
        CommandLine|contains: 'fullmemdmp'
    selection_cli_output:
        CommandLine|contains:
            - ' -o '
            - ' /o '
    selection_cli_process:
        CommandLine|contains:
            - ' -p '
            - ' /p '
    selection_cli_memdmp:
         CommandLine|contains:
            - '-fullmemdmp'
            - '/fullmemdmp'
    condition: selection_img or (all of selection_cli_*)
falsepositives:
    - Unknown
level: high