title: Suspicious WMIC Execution
id: 526be59f-a573-4eea-b5f7-f0973207634d
status: test
description: Detects WMIC executing suspicious or recon commands
author: Michael Haag, Florian Roth, juju4, oscd.community
references:
    - https://digital-forensics.sans.org/blog/2010/06/04/wmic-draft/
    - https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
    - https://blog.malwarebytes.com/threat-analysis/2016/04/rokku-ransomware/
date: 2019/01/16
modified: 2022/08/29
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\wmic.exe'
        - OriginalFileName: 'wmic.exe'
    selection_process_call:
        CommandLine|contains|all:
            - 'process'
            - 'call'
            - 'create '
    recon_part1:
        CommandLine|contains: ' path '
    recon_part2:
        CommandLine|contains:
            - 'AntiVirus'
            - 'Firewall'
        CommandLine|contains|all:
            - 'Product'
            - ' get '
    recon_part3:  # evaluate hardware ID
        CommandLine|contains: 'wmic csproduct get name'
    condition: all of selection_* or (selection_img and all of recon_*)
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - If using Splunk, we recommend | stats count by Computer,CommandLine following for easy hunting by Computer/CommandLine
level: medium
tags:
    - attack.execution
    - attack.t1047
    - car.2016-03-002
