title: Unusual GoogleUpdate.exe Spawning Behavior by DarkGate
id: e76fb8fc-e91a-4531-8a9f-ff87fbabe35a
status: experimental
description: This rule alerts on instances of uncommon or suspicious behavior
  involving the "GoogleUpdate.exe" process, particularly in the context of
  activities associated with the threat actor group known as "DarkGate."
  DarkGate is a threat group known for its involvement in cyber-espionage and
  other malicious activities. The rule focuses on identifying any deviations
  from normal behavior related to the execution or spawning of
  "GoogleUpdate.exe," which may indicate potential malicious activity or lateral
  movement by DarkGate within the network. Detection of such unusual spawning
  behavior can help security teams respond promptly to potential threats and
  enhance overall network security.
references:
     - https://github.security.telekom.com/2023/08/darkgate-loader.html
author: Sai Prashanth ( @pulisettis)
date: 2023/10/26
modified: 2023/10/26
tags:
    - attack.t1059
    - attack.t1060
    - attack.t1218
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentCommandLine: "*Autoit3.exe*"
        CommandLine: "*GoogleUpdate.exe*"
    condition: selection
fields:
     - ParentCommandLine
     - CommandLine
level: High
