title: Write Protect For Storage Disabled
id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
description: Looks for changes to registry to disable any write-protect property for storage devices. This could be a precursor to a ransomware attack and has been an observed technique used by cypherpunk group.
status: experimental
author: Sreeman
date: 2021/06/11
modified: 2022/08/05
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains|all:
            - 'reg add'
            - '\system\currentcontrolset\control'
            - 'write protection'
            - '0'
        CommandLine|contains:
            - 'storage'
            - 'storagedevicepolicies'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion
    - attack.t1562
