title: Launch DirLister Executable
id: b4dc61f5-6cce-468e-a608-b48b469feaa2
status: experimental
description: Detect use of DirLister.exe
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1083/T1083.md
author: frack113
date: 2022/08/20
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - OriginalFileName: 'DirLister.exe'
        - Image|endswith: '\dirlister.exe'
    condition: selection
falsepositives:
    - Legitimate use
level: medium
tags:
    - attack.discovery
    - attack.t1083
