title: RDP SecurityLayer Registry Value Tampering
id: d081deb8-d09a-492d-b32c-6597e68a9b3d
related:
    - id: 13bda3c1-5474-4e9b-983e-83e6ede83b08 # Registry
      type: similar
status: experimental
description: |
    Detects changes to the SecurityLayer RDP registry value, used to enable, weaken, or disable authentication methods on RDP connections.
    The SecurityLayer value specifies how servers and clients authenticate each other before a remote desktop connection is established.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/dd526047b8c399c312fee47d1e6fb531164da54d/atomics/T1112/T1112.yaml#L790
    - https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
    - https://blog.talosintelligence.com/understanding-the-phobos-affiliate-structure/
    - https://learn.microsoft.com/en-us/windows-hardware/customize/desktop/unattend/microsoft-windows-terminalservices-rdp-winstationextensions-securitylayer
author: TropChaud
date: 2025-10-21
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1112
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - Image|endswith: '\reg.exe'
        - OriginalFileName: 'reg.exe'
    selection_cli:
        CommandLine|contains: 'add'
        CommandLine|contains|all:
            - '\CurrentControlSet\Control\Terminal Server\WinStations\RDP-Tcp'
            - 'SecurityLayer'
    selection_dword_disable:
        CommandLine|contains:
            - '0'
            - '1'
    filter_main_enable_ssl:
        CommandLine|contains: '02'
    condition: all of selection_* and not 1 of filter_main_*
falsepositives:
    - Legitimate changes to the SecurityLayer value setting
level: medium
