title: Indirect Command Execution through provlaunch.exe
id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
related:
    - id: f7d31a1c-3902-4a6e-bccd-9a5f85e4b3ee
      type: similar
status: experimental
description: Detect suspicious execution of provlaunch.exe for indirect execution of arbitrary commands.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Swachchhanda Shrawan Poudel
date: 2023/08/02
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\provlaunch.exe'
        - OriginalFileName: 'provlaunch'
        - Description: 'Provisioning package runtime command launching tool'
    condition: selection
falsepositives:
    - Depends on the administrators activity
level: high