title: Vulnerable AnyDesk Application Detection
id: d99713be-839a-4812-b79f-3918b36a24a8
status: experimental
description: This use case is designed to detect the presence and usage of the AnyDesk application with version less than 8.0.8 in your environment. AnyDesk is a remote desktop software that allows users to connect to computers remotely. While it has legitimate uses, it can also be exploited for malicious activities such as unauthorized access or data exfiltration.
references:
    - https://www.bleepingcomputer.com/news/security/anydesk-says-hackers-breached-its-production-servers-reset-passwords/
author: Sai Prashanth Pulisetti
date: 2024/02/06
tags:
    - attack.execution
    - attack.initial_access
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: anydesk.exe
        FileVersion|startswith: '7.'
    filter1:
        CommandLine|contains: --uninstall
        Image|endswith: AnyDeskUninst*.exe
        FileVersion|contains: '8.0.8''
    condition: selection and not filter1
falsepositives:
    - Administrative Usage
level: medium
