title: Suspicious DIR Execution
id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
status: experimental
description: Use dir to collect information
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1217/T1217.md
author: frack113
date: 2021/12/13
logsource:
    category: process_creation
    product: windows
detection:
    dir:
        CommandLine|contains|all:
            - 'dir '
            - ' /s'
            - ' /b'
    condition: dir
falsepositives:
    - Unknown
level: low
tags:
    - attack.discovery
    - attack.t1217