title: GfxDownloadWrapper.exe Downloads File from Suspicious URL
id: eee00933-a761-4cd0-be70-c42fe91731e7
status: test
description: Detects when GfxDownloadWrapper.exe downloads file from non standard URL
author: Victor Sergeev, oscd.community
references:
  - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/GfxDownloadWrapper.yml
date: 2020/10/09
modified: 2021/11/27
logsource:
  category: process_creation
  product: windows
detection:
  image_path:
    Image|endswith: '\GfxDownloadWrapper.exe'
  cmd_known_url:
    CommandLine|contains: 'gameplayapi.intel.com'
  same_parent:
    ParentImage|endswith: '\GfxDownloadWrapper.exe'
  condition: image_path and not cmd_known_url and not same_parent
fields:
  - CommandLine
falsepositives:
  - Unknown
level: medium
tags:
  - attack.command_and_control
  - attack.t1105
