title: Potentially Suspicious CMD LNK Execution
id: c7bab145-36bd-4089-9964-b14b7cc5d121
status: experimental
description: Detects
references:
    - https://thedfirreport.com/2023/08/28/html-smuggling-leads-to-domain-wide-ransomware/
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/29
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\explorer.exe'
    selection_child_cmd_img:
        Image|endswith: '\cmd.exe'
    selection_child_cmd_cli:
        - CommandLine|contains|all:
            - '/c'
            - '..\'
        - CommandLine|contains|all:
            - ''
    condition: selection
falsepositives:
    - Unlikely
level: high
