title: Credential Guard Disabled
id: c17d47b7-dcd6-4109-87eb-d1817bd4cbc9
related:
    - id: 73921b9c-cafd-4446-b0c6-fdb0ace42bc0
      type: similar
status: experimental
description: |
    Detects attempts to disable Windows Credential Guard by modifying registry keys to set their values to 0.
    Credential Guard uses virtualization-based security to isolate secrets so that only privileged system software can access them.
    Adversaries may disable Credential Guard to gain access to sensitive credentials stored in the system, such as NTLM hashes and Kerberos tickets, which can be used for lateral movement and privilege escalation.
references:
    - https://woshub.com/disable-credential-guard-windows/
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-26
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
              - '\reg.exe'
        - OriginalFileName:
              - 'PowerShell.EXE'
              - 'pwsh.dll'
              - 'reg.exe'
    selection_cli:
        CommandLine|contains:
            - 'add'
            - 'New-ItemProperty '
            - 'Set-ItemProperty '
            - 'si '
    selection_key_base:
        CommandLine|contains:
            - 'CurrentControlSet\Control\DeviceGuard'
            - 'CurrentControlSet\Control\LSA'
            - 'Software\Policies\Microsoft\Windows\DeviceGuard'
    selection_key_specific:
        CommandLine|contains:
            - 'EnableVirtualizationBasedSecurity'
            - 'RequirePlatformSecurityFeatures'
            - 'LsaCfgFlags'
    selection_value:
        CommandLine|contains: '0'
    filter_main_enable:
        CommandLine|contains:
            - '01'
            - '0x1'
    condition: all of selection_* not 1 of filter_main_*
falsepositives:
    - Legitimate administrative actions for troubleshooting, compatibility, or software installation purposes
level: medium