title: Possible BOINC Software (UC-Berkeley Signature)
id: 0090b851-3543-42db-828c-02fee986ff0b
status: test
description: Detects the use of software that is signed by the University of California, Berkeley.  This indicates it may be related to BOINC software and can be used maliciously if unauthorized.
references:
    - https://boinc.berkeley.edu/
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
author: Matt Anderson (Huntress)
date: 2024/07/15
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1553
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Description: 'University of California, Berkeley'
    condition: selection and not filter
falsepositives:
    - This software can used for legitimate purposes when installed intentionally.
level: informational
