title: Reg Add Suspicious Path To AppDataLow
id: b7e2a8d4-74bb-4b78-adc9-3f92af2d4829
status: experimental
description: Detects when an adversary uses the 'AppDataLow' subkeys as a place to store data as seen in the URSNIF phishing campaign
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.001/T1562.001.md
author: frack113
date: 2022/08/19
modified: 2022/08/20
logsource:
    category: process_creation
    product: windows
detection:
    selection_reg:
        - Image|endswith: '\reg.exe'
        - OriginalFileName: 'reg.exe'
    selection_path:
        CommandLine|contains:
            - '\Software\AppDataLow\Software\Microsoft\'
            - '\Software\Policies\Microsoft\Windows\OOBE'
            - '\Software\Policies\Microsoft\Windows NT\CurrentVersion\Winlogon'
    condition: all of selection_*
falsepositives:
    - Legitimate use
level: medium
tags:
  - attack.defense_evasion
  - attack.t1112
  - attack.t1562.001
