title: SharpEvtMute EvtMuteHook Load
id: bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c
status: experimental
description: Detects the use of SharpEvtHook, a tool to tamper with Windows event logs
references:
   - https://github.com/bats3c/EvtMute
author: Florian Roth
date: 2022/09/07
tags:
   - attack.defense_evasion
   - attack.t1562.002
logsource:
   product: windows
   category: process_creation
detection:
   selection:
      - Image|endswith: '\SharpEvtMute.exe'
      - Description: 'SharpEvtMute'
      - CommandLine|contains:
            - '--Filter "rule '
            - '--Encoded --Filter \"'
   condition: selection
falsepositives:
   - Unknown
level: high
