title: Add User to Local Administrators
id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
related:
    - id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
      type: similar
status: experimental
description: Detects suspicious command line that adds an account to the local administrators/administrateurs group
references:
    - https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
author: Florian Roth, Nasreddine Bencherchali
date: 2022/08/12
modified: 2022/09/09
tags:
    - attack.persistence
    - attack.t1098
logsource:
    category: process_creation
    product: windows
detection:
    selection_main:
        - CommandLine|contains|all:
            - 'localgroup '
            - ' /add'
        - CommandLine|contains|all:
            - 'Add-LocalGroupMember '
            - ' -Group '
    selection_group:
        CommandLine|contains:
            - ' administrators '
            - ' administrateur' # Typo without an 'S' so we catch both
    condition: all of selection_*
falsepositives:
    - Administrative activity
level: medium
