title: PowerShell Web Download and Execution
id: 85b0b087-eddf-4a2b-b033-d771fa2b9775
status: experimental
description: Detects suspicious ways to download files or content and execute them using PowerShell
author: Florian Roth
date: 2022/03/24
modified: 2022/09/02
tags:
    - attack.execution
    - attack.t1059
references:
    - https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains:
            - '.DownloadString('
            - '.DownloadFile('
            - 'Invoke-WebRequest '
    execution:
        CommandLine|contains:
            - 'IEX('
            - 'IEX ('
            - 'I`EX'
            - 'IE`X'
            - 'I`E`X'
            - '| IEX'
            - '|IEX '
            - 'Invoke-Execution'
            - ';iex $'
    condition: selection and execution
falsepositives:
    - Scripts or tools that download files and execute them
level: high
