title: Serpent backdoor payload execution via scheduled task
id: d5eb7432-fda4-4bba-a37f-ffa74d9ed639
description: 
    - Detects the new post-exploitation execution technique of the Serpent backdoor. According to Proofpoint, 
      one of the commands that the backdoor ran was via creating a temporary scheduled task using an unusual method. It creates a fictitious
      windows event and a trigger in which once the event is created, it executes the payload. 
status: experimental
date: 2022/03/21
author: \@kostastsale
references:
    - https://www.proofpoint.com/us/blog/threat-insight/serpent-no-swiping-new-backdoor-targets-french-entities-unique-attack-chain
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image: 
          - '*\cmd.exe'
          - '*\powershell.exe'

        CommandLine|contains|all:
          - '/create'
          - '/ec'
          - '[System/EventID='
          - '/tn run'
          - '/so'
          - '/delete'
    condition: selection1
falsepositives:
    - Unlikely
level: high
tags:
    - attack.execution
    - attack.T1059.006
    - attack.persistence
    - attack.T1053.005
