title: PsExec Service Execution
id: fdfcbd78-48f1-4a4b-90ac-d82241e368c5
status: experimental
description: Detects launching suspicious processes from PSExec service
references:
    - https://www.youtube.com/watch?v=ro2QuZTIMBM
author: Romaissa Adjailia
date: 2022/07/21
tags:
    - attack.execution 
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image: 'C:\Windows\PSEXESVC.exe'
        - OriginalFileName: 'psexesvc.exe'
    condition: selection
falsepositives:
    - Legitimate administrative tasks
level: medium
