title: Winscp CLI Command To Open Connexion
id: c1477deb-37cf-4439-9ffb-44499acb89d0
status: experimental
description: Use Winscp command cli option to open a connexion
references:
    - https://blogs.blackberry.com/en/2024/07/akira-ransomware-targets-the-latam-airline-industry
author: frack113
date: 2024/07/30
tags:
    - attack.exfiltration
    - attack.t1048
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\WinSCP.exe'
        - OriginalFileName: 'winscp.exe'
    selection_cmd:
        CommandLine|contains|windash: '-command'
        CommandLine|contains: 'open '
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
