title: Ursnif Redirection Of Discovery Commands
id: 7aaa5739-12fc-41aa-b98b-23ec27d42bdf
description: Detects the redirection of Ursnif discovery commands as part of the initial execution of the malware.
status: experimental
date: 2023/07/16
author: \@kostastsale
references:
    - 
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains|all:
            - '/C '
            - ' >> *\appdata\local\temp\*.bin'
        Image|endswith:
            - '\cmd.exe'
        ParentImage|endswith:
            - '\explorer.exe'
    condition: selection1
falsepositives:
    - Unlikely
level: high
tags:
    - attack.execution
    - attack.T1059