title: Executable Run Itself
id: bafd07c6-3ea5-454a-b4be-058fbb073de7
status: experimental
description: Detects an executable that executes himself
references:
    - https://www.joesandbox.com/analysis/1605063/0/html
author: frack113
date: 2025-02-04
tags:
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|fieldref: ParentImage
    condition: selection
falsepositives:
    - Unknown
level: medium
