title: UAC Bypass Using IDiagnostic Profile
id: 4b60e6f2-bf39-47b4-b4ea-398e33cfe253
status: experimental
description: Detects the "IDiagnosticProfileUAC" UAC bypass technique
author: Nasreddine Bencherchali
date: 2022/07/03
references:
    - https://github.com/Wh04m1001/IDiagnosticProfileUAC
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\DllHost.exe'
        ParentCommandLine|contains: ' /Processid:{2C21EA7-2EB8-4B55-9249-AC243DA8C666}'
        IntegrityLevel:
          - 'High'
          - 'System'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1548.002
