title: Enable Windows Recall
id: 817f252c-5143-4dae-b418-48c3e9f63728
status: experimental
description: |
    Adversaries may enable Windows Recall as part of post-exploitation discovery and collection activities.
    This rule assumes that Recall is already explicitly disabled on the host, and subsequently enabled by the adversary.
    Windows Recall can be enabled by deleting the existing DisableAIDataAnalysis key, or setting its value to 0.
references:
    - https://learn.microsoft.com/en-us/windows/client-management/manage-recall
    - https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsai#disableaidataanalysis
related:
    - id: 5dfc1465-8f65-4fde-8eb5-6194380c6a62
      type: similar
    - id: 75180c5f-4ea1-461a-a4f6-6e4700c065d4
      type: similar
author: Sajid Nawaz Khan
date: 2024/06/02
tags:
    - attack.collection
    - attack.T1113
logsource:
    category: process_creation
    product: windows
detection:
    # HKEY_CURRENT_USER\Software\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
    # HKEY_LOCAL_MACHINE\SOFTWARE\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
    selection_1:
        CommandLine|contains|all:
            - 'reg'
            - 'add'
            - 'Software\Policies\Microsoft\Windows\WindowsAI'
            - '/v'
            - 'DisableAIDataAnalysis'
            - '/d'
            - '0'
    selection_2:
        CommandLine|contains|all:
            - 'reg'
            - 'delete'
            - 'Software\Policies\Microsoft\Windows\WindowsAI'
            - '/v'
            - 'DisableAIDataAnalysis'
    condition: 1 of selection_*
falsepositives:
    - Legitimate use/activation of Windows Recall
level: experimental