title: Application Whitelisting Bypass via DLL Loaded by odbcconf.exe
id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
status: test
description: Detects defence evasion attempt via odbcconf.exe execution to load DLL
author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
    - https://twitter.com/Hexacorn/status/1187143326673330176
    - https://redcanary.com/blog/raspberry-robin/
date: 2019/10/25
modified: 2021/11/27
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        Image|endswith: '\odbcconf.exe'
        CommandLine|contains:
            - '-f'
            - 'regsvr'
    selection_2:
        ParentImage|endswith: '\odbcconf.exe'
        Image|endswith: '\rundll32.exe'
    condition: 1 of selection_*
falsepositives:
    - Legitimate use of odbcconf.exe by legitimate user
level: medium
tags:
    - attack.defense_evasion
    - attack.t1218.008
