title: Unusual svchost Command Line Parameter
id: 
related:
    - id: be58d2e2-06c8-4f58-b666-b99f6dc3b6cd
      type: similar
    - id: e4a6b256-3e47-40fc-89d2-7a477edd6915
      type: similar
status: test
description: |
    This rule alerts when svchost.exe is executed with unusual command line parameters based on known good patterns. 
    This could point at a file masquerading as svchost or a process injection or hollowing of a legitimate svchost instance. 
references:
    - https://cardinalops.com/blog/the-art-of-anomaly-hunting-patterns-detection/
    - https://www.security.com/threat-intelligence/blackbyte-exbyte-ransomware
    - https://cloud.google.com/blog/topics/threat-intelligence/apt41-initiates-global-intrusion-campaign-using-multiple-exploits/
    - https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064518/Carbanak_APT_eng.pdf
author: Liran Ravich
date: 2025-07-28
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1036.005
    - attack.t1055
    - attack.t1055.012
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\svchost.exe'
    filter_cmd:
        CommandLine|re: '-k\s\w+((\s?(-p|-s))|$)'
    condition: selection and not filter_cmd
falsepositives:
    - Unlikely
level: high
