title: Suspicious Calculator Usage
id: 737e618a-a410-49b5-bec3-9e55ff7fbc15
status: test
description: Detects suspicious use of 'calc.exe' with command line parameters or in a suspicious directory, which is likely caused by some PoC or detection evasion
author: Florian Roth
references:
    - https://twitter.com/ItsReallyNick/status/1094080242686312448
date: 2019/02/09
modified: 2022/08/04
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - CommandLine|contains: '\calc.exe '
        - Image|endswith: '\calc.exe'
    filter:
        Image|startswith:
            - 'C:\Windows\System32\'
            - 'C:\Windows\SysWOW64\'
            - 'C:\Windows\WinSxS\'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1036
