title: Potential Commandline Obfuscation Using Unicode Characters
id: e0552b19-5a83-4222-b141-b36184bb8d79
related:
    - id: 2c0d2d7b-30d6-4d14-9751-7b9113042ab9
      type: obsoletes
status: test
description: |
    Detects potential commandline obfuscation using unicode characters.
    Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit.
references:
    - https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http
author: frack113, Florian Roth (Nextron Systems)
date: 2022/01/15
modified: 2024/07/22
tags:
    - attack.defense_evasion
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection_spacing_modifiers:
        CommandLine|contains: # spacing modifier letters that get auto-replaced
            - 'ˣ' # 0x02E3
            - '˪' # 0x02EA
            - 'ˢ' # 0x02E2
    selection_unicode_slashes: # forward slash alternatives
        CommandLine|contains:
            - '∕' # 0x22FF
            - '⁄' # 0x206F
    selection_unicode_hyphens: # hyphen alternatives
        CommandLine|contains:
            - '―' # 0x2015
            - '—' # 0x2014
    selection_other:
        CommandLine|contains:
            - '¯'
            - '®'
            - '¶'
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
