title: Suspicious PowerShell Child Processes
id: e4b6d2a7-d8a4-4f19-acbd-943c16d90647
status: experimental
description: Detects suspicious child processes spawned by PowerShell
references:
    - https://twitter.com/ankit_anubhav/status/1518835408502620162
author: Florian Roth, Tim Shelton
date: 2022/04/26
modified: 2023/01/05
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\powershell_ise.exe'
        Image|endswith:
            - '\sh.exe'
            - '\bash.exe'
            - '\schtasks.exe'
            - '\certutil.exe'
            - '\bitsadmin.exe'
            - '\wscript.exe'
            - '\cscript.exe'
            - '\scrcons.exe'
            - '\regsvr32.exe'
            - '\hh.exe'
            - '\wmic.exe'
            - '\mshta.exe'
            - '\rundll32.exe'
            - '\forfiles.exe'
            - '\scriptrunner.exe'
    filter_amazon:
        ParentCommandLine|contains: '\Program Files\Amazon\WorkspacesConfig\Scripts\'  # AWS Workspaces
        CommandLine|contains: '\Program Files\Amazon\WorkspacesConfig\Scripts\'  # AWS Workspaces
    condition: selection and not 1 of filter_*
falsepositives:
    - Unknown
level: high
