title: Suspicious Conhost.exe as Parent 
id: 79a32f39-22e4-471c-bf67-9eb4525d5d1f
status: experimental
description: Detection use of conhost.exe as proxy
references:
    - https://twitter.com/Wietze/status/1511397781159751680
author: frack113
date: 2022/04/05
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\conhost.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium

