title: Run from a Zip File
id: 1a70042a-6622-4a2b-8958-267625349abf
status: experimental
description: Payloads may be compressed, archived, or encrypted in order to avoid detection
author: frack113
date: 2021/12/26
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-4---execution-from-compressed-file
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains: '.zip\'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.impact
    - attack.t1485
