title: Proc Creation Win Qemu Tunnel Execution
id: 22c8a7c9-444c-4560-92f0-aba892dd4e09
status: experimental
description: Detects Qemu tunnel in a Windows envrionment.
references:
    - https://securelist.com/network-tunneling-with-qemu/111803/
author: Muhammad Faisal (@faisalusuf)
date: 2024/03/08
tags:
    - attack.command_and_control
    - attack.t1090
    - attack.t1572
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - '-m 1M' # VM with just 1MB of ram is insufficient this is a suspicious flag
            - '-netdev user,id=*,restrict=off ' #How to capture id = it could be a random string. restrict=off is important to capture.
            - '-netdev socket,id=*,connect=*'
            - '-netdev hubport '
            - '-nographic' #This is also a key detection no one invoke without UI from console usually its a flag.
    filter:
        CommandLine|contains:
            -  ' -cdrom ' # Normal usage cases
            -  ' type=virt '
            -  ' -blockdev '
    condition: selection and not filter
falsepositives:
    - Legitimate usage of Qemu.
level: medium
