title: HackTool - Stracciatella
id: 7a4d9232-92fc-404d-8ce1-4c92e7caf539
status: experimental
description: Detects hacktool 'Stracciatella' - OpSec-safe Powershell runspace from within C#
references:
    - https://github.com/mgeeky/Stracciatella
author: pH-T (Nextron Systems)
date: 2023/04/17
modified: 2023/04/17
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_base:
        - Image|endswith: '\Stracciatella.exe'
        - OriginalFileName: '\Stracciatella.exe'
        - Description: 'Stracciatella'
        - Hashes|contains: 'SHA256=9ae7c4a4e1cfe9b505c3a47e66551eb1357affee65bfefb0109d02f4e97c06dd'
        - sha256: '9ae7c4a4e1cfe9b505c3a47e66551eb1357affee65bfefb0109d02f4e97c06dd'
    condition: selection_base
falsepositives:
    - Very unlikely
level: high
