title: AMSI Bypass via PowerShell Patch
id: 42faab9c-6f9b-4f61-93cb-05bb59dc5ec0
status: experimental
description: Detects PowerShell commands attempting to bypass AMSI by patching AmsiScanBuffer.
author: '(vVv-Keys)'
date: 2025-06-21
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - 'AmsiScanBuffer'
      - 'Reflection'
      - 'Bypass'
      - 'VirtualProtect'
      - 'Add-Type'
  condition: selection
fields:
  - CommandLine
  - ParentImage
  - Image
  - User
falsepositives:
  - Rare in production; possible in red team simulations or malware analysis labs
level: high
tags:
  - attack.defense-evasion
  - attack.t1562.001
references:
  - https://attack.mitre.org/techniques/T1562/001/
  - https://posts.specterops.io/bypassing-amsi-and-etw-using-powershell-d05c598d1e4
  - https://github.com/Rasta-mouse/AmsiScanBufferBypass
