title: Wevtutil Recon
id: beaa66d6-aa1b-4e3c-80f5-e0145369bfaf
status: experimental
description: Detects usage of the wevtutil utility to perform reconnaissance
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
author: Nasreddine Bencherchali
date: 2022/09/09
tags:
    - attack.discovery
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli:
        Image|endswith: '\wevtutil.exe'
        CommandLine|contains:
            - ' qe '
            - ' query-events '
    selection_logs:
        CommandLine|contains:
            # Add more event log channels that are interesting for attackers
            - 'Microsoft-Windows-TerminalServices-LocalSessionManager/Operational'
            - 'Microsoft-Windows-Terminal-Services-RemoteConnectionManager/Operational'
    condition: all of selection_*
falsepositives:
    - Legitmate usage of the utility by administrators to query the event log
level: medium
