title: Remote Access Tool - ScreenConnect Backstage Mode Anomaly 2
id: 51544ca6-51ab-48de-97e9-b1317707760c
related:
    - id: d1a401ab-8c47-4e86-a7d8-2460b6a53e4a
      type: derived
    - id: 7b582f1a-b318-4c6a-bf4e-66fe49bf55a5
      type: derived
status: experimental
description: Detects suspicious grand child processes started by the ScreenConnect client service.
references:
    - https://www.mandiant.com/resources/telegram-malware-iranian-espionage
    - https://docs.connectwise.com/ConnectWise_Control_Documentation/Get_started/Host_client/View_menu/Backstage_mode
author: Florian Roth (Nextron Systems)
date: 2022/02/25
modified: 2023/03/05
tags:
    - attack.command_and_control
    - attack.t1219
logsource:
    product: windows
    category: process_creation
    definition: 'Requirements: To make use of this rule, GrandParentImage field enrichment needs to be available for process creation events'
detection:
    selection:
        GrandParentImage|endswith: '\ScreenConnect.ClientService.exe'
        ParentImage|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
        Image|endswith:
            - '\cmd.exe'
            - '\curl.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\wevtutil.exe'
    condition: selection
falsepositives:
    - Unlikely
level: high
