title: Esentutl Gather Credentials
id: 7df1713a-1a5b-4a4b-a071-dc83b144a101
status: test
description: Conti recommendation to its affiliates to use esentutl to access NTDS dumped file. Trickbot also uses this utilities to get MSEdge info via its module pwgrab.
references:
    - https://twitter.com/vxunderground/status/1423336151860002816
    - https://attack.mitre.org/software/S0404/
    - https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/
author: sam0x90
date: 2021/08/06
modified: 2024/02/27
tags:
    - attack.credential_access
    - attack.t1003
    - attack.t1003.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\esentutl.exe'
        - OriginalFileName: 'esentutl.exe'
    selection_flags:
        CommandLine|contains:
            - ' /p'
            - ' -p'
    condition: all of selection_*
fields:
    - User
    - CommandLine
    - ParentCommandLine
    - CurrentDirectory
falsepositives:
    - To be determined
level: medium
