title: IIS Native-Code Module Command Line Installation
id: 9465ddf4-f9e4-4ebd-8d98-702df3a93239
status: test
description: Detects suspicious IIS native-code module installations via command line
author: Florian Roth
references:
  - https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
  - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
date: 2019/12/11
modified: 2022/01/07
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\appcmd.exe'
    CommandLine|contains|all:
      - 'install'
      - 'module'
      - '/name:'
  condition: selection
falsepositives:
  - Unknown as it may vary from organisation to organisation how admins use to install IIS modules
level: medium
tags:
  - attack.persistence
  - attack.t1505.003
