title: Discovery of Svchost with Loaded rdpcorets.dll
id: 34275eb8-fa19-436b-b959-3d9ecd53fa1f
status: experimental
description: Detects the enumeration of svchost.exe process with loaded rdpcorets.dll to extract plaintext RDP credentials by enumerating its process ID and dumping memory.
references:
    - https://www.n00py.io/2021/05/dumping-plaintext-rdp-credentials-from-svchost-exe/
    - https://pentestlab.blog/tag/svchost/
author: Swachchhanda Shrawan Poudel
date: 2024/01/31
tags:
    - attack.t1003
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\tasklist.exe'
        CommandLine|contains:
            - '/m'
            - '-m'
        CommandLine|endswith: 'rdpcorets.dll'
    condition: selection
falsepositives:
    - Any legitimate process attempting the discovery of Svchost with Loaded rdpcorets.dll.
level: informational
