title: Lolbin Runexehelper Use As Proxy
id: cd71385d-fd9b-4691-9b98-2b1f7e508714
status: experimental
description: Detect use of runexehelper.exe as proxy to launch another program
references:
    - https://twitter.com/0gtweet/status/1206692239839289344
    - https://lolbas-project.github.io/lolbas/Binaries/Runexehelper/
author: frack113
date: 2022/12/29
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\runexehelper.exe'
    condition: selection
fields:
    - CommandLine
    - CurrentDirectory 
    - ParentCommandLine
    - USer
falsepositives:
    - Legit usage of scripts
level: medium
