title: ProtocolHandler.exe Downloaded Suspicious File
id: 104cdb48-a7a8-4ca7-a453-32942c6e5dcb
status: experimental
description: Emulates attack via documents through protocol handler in Microsoft Office. On successful execution you should see Microsoft Word launch a blank file.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/ProtocolHandler/
author: frack113
date: 2021/07/13
modified: 2022/12/31
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\protocolhandler.exe'
        - OriginalFileName: 'ProtocolHandler.exe'
    selection_cli_1:
        CommandLine|contains|all:
            - '"ms-word'
            - '.docx"'
    selection_cli_2:
        CommandLine|contains: ' http' #cover http and https
    condition: selection_img and 1 of selection_cli_*
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: medium
