title: Execution Of Other File Type Than .exe
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
status: experimental
description: Checks whether the image specified in a process creation event doesn't refer to an .exe file (caused by process ghosting or other unorthodox methods to start a process)
author: Max Altgelt
date: 2021/12/09
modified: 2021/12/13
references:
    - https://pentestlaboratories.com/2021/12/08/process-ghosting/
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    image_exe:
        Image|endswith: '.exe'
    filter:
        Image: null
        Image|startswith: 'C:\Windows\Installer\MSI'
    condition: not image_exe and not filter
falsepositives:
    - unknown
level: high
