title: HackTool - Certipy
id: 6938366d-8954-4ddc-baff-c830b3ba8fcd
status: experimental
description: Detects hacktool 'Certipy' - Tool for Active Directory Certificate Services enumeration and abuse
references:
    - https://github.com/ly4k/Certipy
author: pH-T (Nextron Systems)
date: 2023/04/17
modified: 2023/04/17
tags:
    - attack.discovery
    - attack.t1590.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_base:
        - Image|endswith: '\Certipy.exe'
        - OriginalFileName: '\Certipy.exe'
        - Description: 'Certipy'
    selection_base_cli:
        CommandLine|contains:
            - ' find '
            - ' req '
            - ' auth '
            - ' shadow '
            - ' forge '
    selection_cli:
        CommandLine|contains:
            - ' -dc-ip '
            - ' -target'
            - ' -pfx '
            - ' -username '
            - ' -ca-pfx '
    condition: selection_base or (selection_base_cli and selection_cli)
falsepositives:
    - Very unlikely
level: high
