title: Credential Acquisition via Registry Hive Dumping
id: 4d6c9da1-318b-4edf-bcea-b6c93fa98fd0
status: experimental
description: Detects Credential Acquisition via Registry Hive Dumping
author: Tim Rauch
references:
    - https://www.elastic.co/guide/en/security/current/credential-acquisition-via-registry-hive-dumping.html
date: 2022/10/04
logsource:
    category: process_creation
    product: windows
tags:
    - attack.credential_access
    - attack.t1003
detection:
    selection_1:
        Image|endswith: '\reg.exe'
        CommandLine|contains:
            - ' save '
            - ' export '
    selection_2:
        CommandLine|contains:
            - 'hklm\sam'
            - 'hklm\security'
    condition: all of selection_*
level: high
