title: Suspicious Stop Windows Service
id: ce72ef99-22f1-43d4-8695-419dcb5d9330
related:
    - id: eb87818d-db5d-49cc-a987-d5da331fbd90
      type: derived
description: Detects the usage of one of the the commands to stop services such as 'net', 'sc'...etc in order to stop critical or important windows services such as AV, Backup...etc. As seen being used in some ransomware scripts
status: experimental
author: Nasreddine Bencherchali
references:
    - https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus/Genshin%20Impact%20Figure%2010.jpg
    - https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html
date: 2022/09/01
tags:
    - attack.defense_evasion
    - attack.t1489
logsource:
    category: process_creation
    product: windows
detection:
    selection_sc_net_img:
        - OriginalFileName:
            - 'sc.exe'
            - 'net.exe'
            - 'net1.exe'
        - Image|endswith:
            - '\sc.exe'
            - '\net.exe'
            - '\net1.exe'
    selection_sc_net_cli:
        CommandLine|contains: ' stop '
    selection_pwsh:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains: 'Stop-Service '
    services:
        CommandLine|contains:
            - 'VSS'
            - 'HealthTLService'
            - 'ThreatLockerService'
            - '"Veritas System Recovery"'
            - 'EPlntegrationService'
            - 'EPRedline'
            - '"Client Agent 7.60"'
            - 'SQLAgent$SVSTEM_BGC'
            - '"Sophos Device Control Service"'
            - '"Zoolz 2 Service"'
            - '"Sophos AutoUpdate Service"'
            - '"Sophos System Protection Service"'
            - 'POVFSService'
            - 'MSSQLFDLauncherSTPSAMA'
            - '"Symantec System Recovery"'
            - 'Antivirus'
            - '"Sophos Health Service"'
            - 'MSSQLFDLauncherSTPS'
            - 'AcrSch2Svc'
            - 'MSSQLSSVSTEM_BGC'
            - 'MSSQLFDLauncherSPROFXENGAGEMENT'
            - 'SQLAgentSTPS'
            - '"Sophos Message Router"'
            - 'MSSQLFDLauncher$S8SMONITORING'
            - 'MySQL80'
            - 'MSSQLSECWDB2'
            - 'MSSQLWEEAMSQL2008R2'
            - '"Sophos Clean Service"'
            - '"Sophos Web Control Service"'
            - 'EhttpSry'
            - 'MSOLAPSTPSAMA'
            - '"Veeam Backup Catalog Data Service"'
            - 'MSSQLSSBSMONITORIMG'
            - 'AcronisAgent'
            - 'MySQLS7'
            - 'UTODetect'
            - 'MSSQLFOLauncherSSVSTEM_BGC'
            - 'MSSQLSBKUPEXEC'
            - 'SQLAgentSPRACTTICEBGC'
            - '"Sophos MCS Client"'
            - 'BackupExeclobEngine'
            - 'SQLAgentSVEEAMSQL2008R2'
            - '143Svc'
            - '"SQLsafe Backup Service"'
            - 'SQLAgentSCXDB'
            - '"Sophos Safestore Service"'
            - 'svcienericHost'
            - 'MSSQLSTPSAMA'
            - 'SQLAgentSCITRIX_METAFRAME'
            - 'WeanClOudSve'
            - '"Sophos File Scanner Service"'
            - '"Sophos Agent"'
            - 'M8EndpointAgent'
            - 'mSSQLSFRACTICEMGT'
            - 'SQLAgentSTPSAMA'
            - 'McAfeeframework'
            - '"Enterprise Client Service"'
            - 'SQLAgentSSBSMONITORING'
            - 'MSSQLSVEEAMSQL2012'
            - 'SQ1SafeOLRService'
            - 'VeeamEnterpriseHanagerSvc'
            - 'SQLAgentSSQL EXPRESS'
            - 'MSSQ!I.SPROFXENGAGEMEHT'
            - 'IMANSVC'
            - 'ARSM'
            - 'MSSQLFOLavocher'
            - 'MSExchangeMIA'
            - 'TruekeyScheduler'
            - 'MSSQ0SOPHOS'
            - '"SQL Backups"'
            - 'MSSQLSTPS'
            - 'Weems JY'
            - 'MSSQ0SHAREPOINT'
            - 'mfevto'
            - 'msftesq1SPROO'
            - 'wozyprobackup'
            - 'MSSQLSSQL_2008'
            - 'MSSQLSSQLEXPRESS'
            - 'MSSQLSPRACTTICEBGE'
            - 'VeeamRISTSvc'
            - 'HMS'
            - '"Sophos MCS Agent"'
            - '"Acronis VSS Provider"'
            - 'MSSQLSVIEAMSQL2008112'
            - 'HISSQLFDLauncherSSHAREPOINIT'
            - '"SQLsafe Filter Service"'
            - 'MSSQLSPROO'
            - 'SQLAgentSPROO'
            - 'MSOLAPSTPS'
            - 'VeemaDep/oySvc'
            - '"SQL Server (MSSQLSERVER)"'
            - '"SQL Server (SQLEXPRESS)'
            - 'BackupExecAgentAccelerator'
            - 'McAfeeEngineService'
            - 'BackupExecAgentBrowser'
            - 'McAfeeFramework'
            - 'BackupExecDeviceMediaService'
            - 'McAfeeFrameworkMcAfeeFramework'
            - 'BackupExecJobEngine'
            - 'McTaskManager'
            - 'BackupExecManagementService'
            - 'mfemms'
            - 'BackupExecRPCService'
            - 'mfevtp'
            - 'BackupExecVSSProvider'
            - 'MMS'
            - 'bedbg'
            - 'mozyprobackup'
            - 'DCAgent'
            - 'MsDtsServer'
            - 'MsDtsServer100'
            - 'MsDtsServer110'
            - 'EraserSvc11710'
            - 'MSExchangeES'
            - 'EsgShKernel'
            - 'MSExchangeIS'
            - 'FA_Scheduler'
            - 'MSExchangeMGMT'
            - 'IISAdmin'
            - 'MSExchangeMTA'
            - 'IMAP4Svc'
            - 'MSExchangeSA'
            - 'macmnsvc'
            - 'MSExchangeSRS'
            - 'masvc'
            - 'MSOLAP$SQL_2008'
            - 'MBAMService'
            - 'MSOLAP$SYSTEM_BGC'
            - 'MBEndpointAgent'
            - 'MSOLAP$TPS'
            - 'McShield'
            - 'MSSQLSERVER'
            - 'MSSQL$ECWDB2'
            - 'MSSQLServerADHelper100'
            - 'MSSQL$PRACTICEMGT'
            - 'MSSQLServerOLAPService'
            - 'MSSQL$PRACTTICEBGC'
            - 'MySQL57'
            - 'MSSQL$PROFXENGAGEMENT'
            - 'ntrtscan'
            - 'MSSQL$SBSMONITORING'
            - 'OracleClientCache80'
            - 'MSSQL$SHAREPOINT'
            - 'PDVFSService'
            - 'MSSQL$SQL_2008'
            - 'POP3Svc'
            - 'MSSQL$SYSTEM_BGC'
            - 'ReportServer'
            - 'MSSQL$TPS'
            - 'ReportServer$SQL_2008'
            - 'MSSQL$TPSAMA'
            - 'ReportServer$SYSTEM_BGC'
            - 'ReportServer$TPS'
            - 'MSSQL$VEEAMSQL2012'
            - 'ReportServer$TPSAMA'
            - 'MSSQLFDLauncher'
            - 'RESvc'
            - 'MSSQLFDLauncher$PROFXENGAGEMENT'
            - 'sacsvr'
            - 'MSSQLFDLauncher$SBSMONITORING'
            - 'MSSQLFDLauncher$SHAREPOINT'
            - 'SamSs'
            - 'MSSQLFDLauncher$SQL_2008'
            - 'SAVAdminService'
            - 'MSSQLFDLauncher$SYSTEM_BGC'
            - 'SAVService'
            - 'MSOLAP$TPSAMA'
            - 'MSSQLFDLauncher$TPS'
            - 'MSSQL$BKUPEXEC'
            - 'MSSQLFDLauncher$TPSAMA'
            - 'Smcinst'
            - 'SQLTELEMETRY$ECWDB2'
            - 'SmcService'
            - 'SQLWriter'
            - 'SMTPSvc'
            - 'SstpSvc'
            - 'SNAC'
            - 'svcGenericHost'
            - 'SntpService'
            - 'swi_filter'
            - 'sophossps'
            - 'swi_service'
            - 'SQLAgent$BKUPEXEC'
            - 'swi_update_64'
            - 'SQLAgent$ECWDB2'
            - 'TmCCSF'
            - 'SQLAgent$PRACTTICEBGC'
            - 'tmlisten'
            - 'SQLAgent$PRACTTICEMGT'
            - 'TrueKey'
            - 'SQLAgent$PROFXENGAGEMENT'
            - 'TrueKeyScheduler'
            - 'SQLAgent$SBSMONITORING'
            - 'TrueKeyServiceHelper'
            - 'SQLAgent$SHAREPOINT'
            - 'SQLAgent$SQL_2008'
            - 'UI0Detect'
            - 'SQLAgent$SYSTEM_BGC'
            - 'SQLAgent$TPS'
            - 'VeeamBackupSvc'
            - 'SQLAgent$TPSAMA'
            - 'VeeamBrokerSvc'
            - 'SQLAgent$VEEAMSQL2012'
            - 'VeeamCatalogSvc'
            - 'SQLBrowser'
            - 'VeeamCloudSvc'
            - 'SDRSVC'
            - 'SQLSafeOLRService'
            - 'SepMasterService'
            - 'SQLSERVERAGENT'
            - 'ShMonitor'
            - 'SQLTELEMETRY'
            - 'VeeamDeploymentService'
            - 'NetMsmqActivator'
            - 'VeeamDeploySvc'
            - 'EhttpSrv'
            - 'VeeamEnterpriseManagerSvc'
            - 'ekrn'
            - 'VeeamMountSvc'
            - 'ESHASRV'
            - 'VeeamNFSSvc'
            - 'MSSQL$SOPHOS'
            - 'VeeamRESTSvc'
            - 'SQLAgent$SOPHOS'
            - 'VeeamTransportSvc'
            - 'AVP'
            - 'W3Svc'
            - 'klnagent'
            - 'MSSQL$SQLEXPRESS'
            - 'WRSVC'
            - 'SQLAgent$SQLEXPRESS'
            - 'wbengine'
            - 'MSSQL$VEEAMSQL2008R2'
            - 'kavfsslp'
            - 'SQLAgent$VEEAMSQL2008R2'
            - 'VeeamHvIntegrationSvc'
            - 'KAVFSGT'
            - 'swi_update'
            - 'KAVFS'
            - 'SQLAgent$CXDB'
            - 'mfefire'
            - 'SQLAgent$CITRIX_METAFRAME'
            - '“SQL Backups”'
            - '“avast! Antivirus”'
            - 'MSSQL$PROD'
            - 'aswBcc'
            - '“Zoolz 2 Service”'
            - '“Avast Business Console Client Antivirus Service”'
            - 'MSSQLServerADHelper'
            - 'mfewc'
            - 'SQLAgent$PROD'
            - 'Telemetryserver'
            - 'msftesql$PROD'
            - 'WdNisSvc'
            - 'WinDefend'
            - 'MCAFEETOMCATSRV530'
            - 'MCAFEEEVENTPARSERSRV'
            - 'MSSQLFDLauncher$ITRIS'
            - 'MSSQL$EPOSERVER'
            - 'MSSQL$ITRIS'
            - 'SQLAgent$EPOSERVER'
            - 'SQLAgent$ITRIS'
            - 'SQLTELEMETRY$ITRIS'
            - 'SentinelHelperService'
            - 'MsDtsServer130'
            - 'LogProcessorService'
            - 'SSISTELEMETRY130'
            - 'EPUpdateService'
            - 'MSSQLLaunchpad$ITRIS'
            - 'TmPfw'
            - 'BITS'
            - 'SentinelAgent'
            - 'BrokerInfrastructure'
            - 'EPProtectedService'
            - 'epag'
            - 'epredline'
            - 'EPIntegrationService'
            - 'EPSecurityService'
    condition: services and (all of selection_sc_net* or selection_pwsh)
falsepositives:
    - Administrator or tools shutting down the services due to upgrade or removal purposes. If you experience some FP please consider adding filters to the parent process launching this command and not removing the entry
level: high
