title: Hypervisor-protected Code Integrity (HVCI) Disabled via REG.EXE
id: 6225c53a-a96e-4235-b28f-8d7997cd96eb
related:
    - id: 8b7273a4-ba5d-4d8a-b04f-11f2900d043a
      type: similar
status: experimental
description: |
    Detects the disabling of Hypervisor-protected Code Integrity (HVCI) via the use of the REG.EXE command-line utility.
    HVCI helps protect the kernel and system processes from tampering by malicious code.
    Disabling HVCI could allow attackers to execute unsigned kernel-mode code, potentially leading to kernel-level rootkits or EDR bypass techniques.
references:
    - https://www.sophos.com/en-us/blog/sharpening-the-knife-gold-blades-strategic-evolution
    - https://learn.microsoft.com/en-us/windows/security/hardware-security/enable-virtualization-based-protection-of-code-integrity
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-22
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\reg.exe'
        - OriginalFileName: 'reg.exe'
    selection_cli_key:
        - CommandLine|contains|all:
              - '\Control\DeviceGuard\Scenarios\HypervisorEnforcedCodeIntegrity'
              - 'Enabled'
        - CommandLine|contains|all:
              - '\Control\DeviceGuard\'
              - 'EnableVirtualizationBasedSecurity'
        - CommandLine|contains|all:
              - '\Microsoft\Windows\DeviceGuard\'
              - 'HypervisorEnforcedCodeIntegrity'
    selection_cli_value:
        CommandLine|contains|all:
            - 'add'
            - '0'
    filter_main_enable:
        CommandLine|contains:
            - '0x000000001'  # Legitimate enabling of HVCI
            - '0x1'
    condition: all of selection_* and not 1 of filter_main_*
falsepositives:
    - Legitimate system administration tasks that require disabling HVCI for troubleshooting purposes when certain drivers or applications are incompatible with it.
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_reg_disable_hvci/info.yml
