title: Raspberry Robin Dot Ending File
id: a35c97c8-d9c4-4c89-a3e7-533dc0bcb73a
status: experimental
description: Detects commandline containing reference to files ending with a ".". This scheme has been seen used by raspberry-robin
author: Nasreddine Bencherchali
references:
    - https://twitter.com/MichalKoczwara/status/1553634816016498688
date: 2022/10/28
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|re: "\\.[a-zA-Z0-9]{1,6}\\.[ |\"|']{0,1}"
    filter:
        # This filter is used to exclude double extension files
        CommandLine|re: "\\.[a-zA-Z0-9]{1,6}\\.[a-zA-Z0-9]{1}"
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
tags:
    - attack.execution
