title: Suspicious PowerShell Sub Processes
id: e4b6d2a7-d8a4-4f19-acbd-943c16d90647
description: Detects suspicious sub processes spawned by PowerShell
status: experimental
author: Florian Roth, Tim Shelton
date: 2022/04/26
modified: 2022/07/14
references:
    - https://twitter.com/ankit_anubhav/status/1518835408502620162
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\powershell_ise.exe'
        Image|endswith:
            - '\sh.exe'
            - '\bash.exe'
            - '\schtasks.exe'
            - '\certutil.exe'
            - '\bitsadmin.exe'
            - '\wscript.exe'
            - '\cscript.exe'
            - '\scrcons.exe'
            - '\regsvr32.exe'
            - '\hh.exe'
            - '\wmic.exe'
            - '\mshta.exe'
            - '\rundll32.exe'
            - '\forfiles.exe'
            - '\scriptrunner.exe'
    falsepositive:
        ParentCommandLine|contains: '\Program Files\Amazon\WorkspacesConfig\Scripts\'  # AWS Workspaces
        CommandLine|contains: '\Program Files\Amazon\WorkspacesConfig\Scripts\'  # AWS Workspaces
    condition: selection and not falsepositive
falsepositives:
    - Unknown
level: high
