title: Enabling RDP Service via Reg.exe
id: 0d5675be-bc88-4172-86d3-1e96a4476536
status: experimental
description: Detects the execution of reg.exe and subsequent command line arguments for enabling RDP service on the host by tampering with the 'CurrentControlSet\Control\Terminal Server' subkeys
author: '@Kostastsale, @TheDFIRReport, slightly modified by pH-T'
references:
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
date: 2022/02/12
modified: 2022/08/06
logsource:
    product: windows
    category: process_creation
detection:
    selection_cli:
        Image|endswith: '\reg.exe'
        CommandLine|contains|all:
            - ' add '
            - '\SYSTEM\CurrentControlSet\Control\Terminal Server'
            - 'REG_DWORD'
            - ' /f'
    selection_values_1:
        CommandLine|contains|all:
            - 'Licensing Core'
            - 'EnableConcurrentSessions'
    selection_values_2:
        CommandLine|contains:
            - 'WinStations\RDP-Tcp'
            - 'MaxInstanceCount'
            - 'fEnableWinStation'
            - 'TSUserEnabled'
            - 'TSEnabled'
            - 'TSAppCompat'
            - 'IdleWinStationPoolCount'
            - 'TSAdvertise'
            - 'AllowTSConnections'
            - 'fSingleSessionPerUser'
    condition: selection_cli and 1 of selection_values_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.lateral_movement
    - attack.t1021.001
    - attack.t1112
