title: TieringEngineService Suspicious Execution
id: 
status: experimental
description: Detects execution or parent-child relationships involving TieringEngineService.exe under SYSTEM context
references:
    - https://github.com/Nightmare-Eclipse/RedSun
author: '@unresolvedhost'
date: 2026-04-16
tags:
  - attack.execution
  - attack.privilege_escalation
logsource:
  product: windows
  category: process_creation
detection:
  selection_sysmon:
    EventID: 1
    Image|endswith: '\TieringEngineService.exe'
    User: 'NT AUTHORITY\SYSTEM'
  selection_sysmon_original:
    EventID: 1
    OriginalFileName: 'TieringEngineService.exe'
    User: 'NT AUTHORITY\SYSTEM'
  selection_sysmon_parent:
    EventID: 1
    ParentImage|endswith: '\TieringEngineService.exe'
    ParentUser: 'NT AUTHORITY\SYSTEM'
  selection_security:
    EventID: 4688
    Image|endswith: '\TieringEngineService.exe'
  selection_security_parent:
    EventID: 4688
    ParentImage|endswith: '\TieringEngineService.exe'
    User|endswith: '$'
  condition: selection_sysmon or selection_sysmon_original or selection_sysmon_parent or selection_security or selection_security_parent
level: high
falsepositives:
  - N/A

