title: Suspicious Regsvr32 Execution With Image Extension
id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
status: experimental
description: utilizes REGSVR32.exe to execute this DLL masquerading as a Image file
references:
    - https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
    - https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
tags:
    - attack.defense_evasion
    - attack.t1218.010 
author: frack113
date: 2021/11/29
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\regsvr32.exe'
        CommandLine|endswith: '.jpg' # can add other 
    condition: selection
falsepositives:
    - Unknown
level: high
