title: Potentially Suspicious Findstr.EXE Argument Execution
id: 4fe074b4-b833-4081-8f24-7dcfeca72b42
related:
    - id: ccb5742c-c248-4982-8c5c-5571b9275ad3
      type: obsoletes
    - id: fe63010f-8823-4864-a96b-a7b4a0f7b929
      type: derived
status: experimental
description: Detects execution of "findstr" searching for common names of security tools
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/987e3ca988ae3cff4b9f6e388c139c05bf44bbb8/atomics/T1518.001/T1518.001.md#atomic-test-1---security-software-discovery
author: frack113
date: 2023/10/20
tags:
    - attack.discovery
    - attack.t1518.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\findstr.exe'
        - OriginalFileName: 'FINDSTR.EXE'
    selection_cli:
        CommandLine|endswith:
            # Note: Add additional CLI to increase and enhance coverage
            - ' virus'
            - ' cb'
            - ' defender'
            - ' cylance'
            - ' mc'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
