title: VulnScan - Pingcastle Execution
id: 971b70f7-ed99-4e8b-98f2-2fc0bab8f40e
status: experimental
description: Detects use of pingcastle,Ping Castle is a tool designed to assess quickly the Active Directory security level.
references:
    - https://github.com/vletoux/pingcastle
    - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
author: frack113
date: 2023/10/30
tags:
    - attack.reconnaissance
    - attack.t1595
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\PingCastle.exe'
        - OriginalFileName: PingCastle.exe
        - Description: 'Ping Castle'
        - Product: 'Ping Castle'
        - Company: 'Ping Castle'
    condition: selection
falsepositives:
    - Unknown
level: high
