title: Change Evtx Location Used Wevtutil
id: e6b11ea9-919a-413a-92bd-0976b42bd3b8
status: experimental
description: Detects change location evtx used wevtutil
author: D3F7A5105
date: 2023/01/03
references:
    - https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
tags:
    - attack.defense_evasion
    - attack.t1562.002
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        Image|endswith: \wevtutil.exe
        CommandLine|contains|all:
            - wevtutil
            - /lfn
            - .evtx
    filter_cmd:
        CommandLine|contains: \Windows\System32\winevt\Logs
    condition: selection_cmd and not filter_cmd
falsepositives:
     - Admin activity
     - Backup activity
level: medium
