title: PUA - Cloudflared Quick Tunnel Execution
id: 222129f7-f4dc-4568-b0d2-22440a9639ba
status: experimental
description: |
      Detects creation of an ad-hoc Cloudflare Quick Tunnel, which can be used to tunnel local services such as HTTP, RDP, SSH and SMB.
      The free TryCloudflare Quick Tunnel will generate a random subdomain on trycloudflare[.]com, following a call to api[.]trycloudflare[.]com.
      The tool has been observed in use by threat groups including Akira ransomware.
references:
    - https://developers.cloudflare.com/cloudflare-one/connections/connect-networks/do-more-with-tunnels/trycloudflare/
    - https://github.com/cloudflare/cloudflared
    - https://www.intrinsec.com/akira_ransomware/
related:
    - id: 7050bba1-1aed-454e-8f73-3f46f09ce56a
      type: similar
    - id: 9a019ffc-3580-4c9d-8d87-079f7e8d3fd4
      type: similar
tags:
    - attack.command_and_control
    - attack.t1090.001
author: Sajid Nawaz Khan
date: 2023/12/14
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith:
            - '\cloudflared.exe'
            - '\cloudflared-windows-386.exe'
            - '\cloudflared-windows-amd64.exe'
    # Accounts for the cloudflared binaries being renamed
    # `tunnel` is optional, but has been included to reduce the possibility of parameter collision when not observed with known binary names
    selection_params1:
        CommandLine|contains|all:
            - '.exe '
            - 'tunnel'
    selection_params2:
        CommandLine|contains:
            - '--url'
            - '--no-autoupdate'
    condition:  (selection_img or selection_params1) and 1 of selection_params2
falsepositives:
    - Legitimate usage of Cloudflare Quick Tunnel
level: high