title: Potential Executable Run Itself As Scrificial Process
id: bafd07c6-3ea5-454a-b4be-058fbb073de7
status: experimental
description: | 
    Detects an executable that executes himself.
    The most common technique is to launch it in suspend mode so that you can inject into it.
references:
    - https://www.joesandbox.com/analysis/1605063/0/html
author: frack113
date: 2025-02-04
tags:
    - attack.defense-evasion
    - attack.t1055
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|fieldref: ParentImage
    condition: selection
falsepositives:
    - Unknown
level: medium
