title: PowerShell Web Download and Execution
id: 6e897651-f157-4d8f-aaeb-df8151488385
status: experimental
description: Detects suspicious ways to download files or content using PowerShell
author: Florian Roth
date: 2022/03/24
references:
   - https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/main/Download-Cradles.cmd
logsource:
   product: windows
   category: process_creation
detection:
   selection:
      CommandLine|contains:
         - '.DownloadString('
         - '.DownloadFile('
   execution:
      CommandLine|contains:
         - 'IEX('
         - 'IEX ('
         - 'I`EX'
         - 'IE`X'
         - 'I`E`X'
         - 'Invoke-Execution'
         - ';iex $'
   condition: selection and execution
falsepositives:
   - Scripts or tools that download files and execute them
level: high
