title: Wscript Shell Run In CommandLine
id: 2c28c248-7f50-417a-9186-a85b223010ee
status: experimental
description: Detects the presence of the keywords "Wscript", "Shell" and "Run" in the command, which could indicate a suspicious activity
author: Nasreddine Bencherchali
date: 2022/08/31
references:
    - http://blog.talosintelligence.com/2022/08/modernloader-delivers-multiple-stealers.html
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 'Wscript.'
            - '.Shell'
            - '.Run'
    condition: selection
falsepositives:
    - Rare legitimate inline scripting by some administrators
level: high
