title: Use of Squirrel.exe
id: 45239e6a-b035-4aaf-b339-8ad379fcb67e
status: experimental
description: The "Squirrel.exe" binary that is part of multiple software (Slack, Teams, Discord...etc) can be used as a LOLBIN
author: Nasreddine Bencherchali
related:
    - id: fa4b21c9-0057-4493-b289-2556416ae4d7
      type: derived
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/
date: 2022/06/09
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\squirrel.exe'
    selection_cli:
        CommandLine|contains:
            - ' --download '
            - ' --update '
            - ' --updateRollback='
    selection_http:
        CommandLine|contains: 'http'
    condition: all of selection*
falsepositives:
  - See rule (fa4b21c9-0057-4493-b289-2556416ae4d7) for possible FPs
level: medium
tags:
    - attack.defense_evasion
    - attack.execution
