title: HackTool - WinPwn Execution
id: d557dc06-62e8-4468-a8e8-7984124908ce
related:
    - id: 851fd622-b675-4d26-b803-14bc7baa517a
      type: similar
status: experimental
description: Detects command line parameters used by WinPwn, a tool for Windows and Active Directory reconnaissance and exploitation.
author: Swachchhanda Shrawan Poudel
date: 2023/10/30
references:
    - https://github.com/S3cur3Th1sSh1t/WinPwn
    - https://www.publicnow.com/view/EB87DB49C654D9B63995FAD4C9DE3D3CC4F6C3ED?1671634841
    - https://reconshell.com/winpwn-tool-for-internal-windows-pentesting-and-ad-security/
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1082/T1082.md
    - https://grep.app/search?q=winpwn&filter[repo][0]=redcanaryco/atomic-red-team
tags:
    - attack.discovery
    - attack.t1046
    - attack.t1082
    - attack.t1518
    - attack.credential_access
    - attack.t1552.001
    - attack.t1555
    - attack.t1555.003
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1548.002
    - attack.execution
    - attack.t1106
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell_commandlets:
        CommandLine|contains: 'WinPwn.ps1' # also covers 'Offline_Winpwn.ps1'
    selection_flags:
        CommandLine|contains:
            - '-noninteractive'
            - '-consoleoutput'
            - '-command'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
