title: Vulnerable VSPC Product Detected
id: d57243d7-950f-4840-b5db-bd04cc229229
status: experimental
description: Detects potential exploitation attempts of the Veeam Service Provider Console vulnerability.
author: SaiPrashanth Pulisetti
date: 2024/05/10
tags:
    - attack.persistence
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        Product: 'Veeam Service Provider Console'
    selection_ver:
        FileVersion|startswith:
            - '4.0'
            - '5.0'
            - '6.0'
            - '7.0'
            - '8.0'
    condition: selection_img and selection_ver
falsepositives:
    - Unknown
level: high
