title: Suspicious Tasklist Discovery Command
id: 63332011-f057-496c-ad8d-d2b6afb27f96
status: experimental
description: Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1057/T1057.md#atomic-test-2---process-discovery---tasklist
author: frack113
date: 2021/12/11
logsource:
    category: process_creation
    product: windows
detection:
    tasklist:
        - CommandLine|contains: tasklist
        - Image: C:\Windows\System32\tasklist.exe
    condition: tasklist
falsepositives:
    - Administrator, hotline ask to user
level: low
tags:
    - attack.discovery
    - attack.t1057
