title: Mavinject Inject DLL Into Running Process
id: 4f73421b-5a0b-4bbf-a892-5a7fb99bea66
status: experimental
author: frack113
date: 2021/07/12
modified: 2022/07/11
description: Injects arbitrary DLL into running process specified by process ID. Requires Windows 10.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.004/T1056.004.md
    - https://posts.specterops.io/mavinject-exe-functionality-deconstructed-c29ab2cf5c0e
tags:
    - attack.defense_evasion
    - attack.collection
    - attack.t1218.013
    - attack.t1056.004
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli:
        CommandLine|contains|all:
            - ' /INJECTRUNNING'
            - '.dll' # space some time in the end
    selection_img:
        - OriginalFileName:
            - 'mavinject32.exe'
            - 'mavinject64.exe'
        - Image|endswith:  # Event 4688 doesn't have the OriginalFileName field
            - '\mavinject32.exe'
            - '\mavinject64.exe'
    condition: all of selection_*
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: medium
