title: NTLM Coercion Via Certutil.exe
id: 6c6d9280-e6d0-4b9d-80ac-254701b64916
description: Detects possible NTLM coercion via certutil using the 'syncwithWU' flag
status: experimental
author: Nasreddine Bencherchali
date: 2022/09/01
references:
    - https://github.com/LOLBAS-Project/LOLBAS/issues/243
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\certutil.exe'
        - OriginalFileName: 'CertUtil.exe'
    selection_cli:
        CommandLine|contains|all:
            - ' -syncwithWU '
            - ' \\\\'
    condition: all of selection*
tags:
    - attack.defense_evasion
    - attack.t1218
falsepositives:
    - Unknown
level: high
