title: Suspicious Extexport Execution
id: fb0b815b-f5f6-4f50-970f-ffe21f253f7a
status: experimental
description: Extexport.exe loads dll and is execute from other folder the original path
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extexport/
tags:
    - attack.defense_evasion
    - attack.t1218
author: frack113
date: 2021/11/26
logsource:
    category: process_creation
    product: windows
detection:
    lolbas:
        CommandLine|contains: Extexport.exe
    condition: lolbas 
falsepositives:
    - Unknown
level: medium
