title: Accessing WinAPI Via CommandLine
id: ba3f5c1b-6272-4119-9dbd-0bc8d21c2702
related:
    - id: 03d83090-8cba-44a0-b02f-0b756a050306
      type: derived
status: experimental
description: Detects the use of WinAPI Functions via the commandline as seen used by threat actors via the tool winapiexec
author: Nasreddine Bencherchali
date: 2022/09/06
references:
    - https://twitter.com/m417z/status/1566674631788007425
tags:
    - attack.execution
    - attack.t1106
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - ' WaitForSingleObject '
            - ' QueueUserApc '
            - ' RtlCreateUserThread '
            - ' OpenProcess '
            - ' VirtualAlloc '
            - ' VirtualFree '
            - ' WriteProcessMemory '
            - ' CreateUserThread '
            - ' CloseHandle '
            - ' GetDelegateForFunctionPointer '
            - ' CreateThread '
            - ' memcpy '
            - ' LoadLibrary '
            - ' GetModuleHandle '
            - ' GetProcAddress '
            - ' VirtualProtect '
            - ' FreeLibrary '
            - ' ReadProcessMemory '
            - ' CreateRemoteThread '
            - ' AdjustTokenPrivileges '
            - ' WriteInt32 '
            - ' OpenThreadToken '
            - ' PtrToString '
            - ' FreeHGlobal '
            - ' ZeroFreeGlobalAllocUnicode '
            - ' OpenProcessToken '
            - ' GetTokenInformation '
            - ' SetThreadToken '
            - ' ImpersonateLoggedOnUser '
            - ' RevertToSelf '
            - ' GetLogonSessionData '
            - ' CreateProcessWithToken '
            - ' DuplicateTokenEx '
            - ' OpenWindowStation '
            - ' OpenDesktop '
            - ' MiniDumpWriteDump '
            - ' AddSecurityPackage '
            - ' EnumerateSecurityPackages '
            - ' GetProcessHandle '
            - ' DangerousGetHandle '
            - ' kernel32 '
            - ' Advapi32 '
            - ' msvcrt '
            - ' ntdll '
            - ' user32 '  # FP with chocolatey
            - ' secur32 '
    condition: selection
falsepositives:
    - Unknown
level: high
