title: Renamed BOINC Client
id: 30d07da2-83ab-45d8-ae75-ec7c0edcaffc
status: test
description: Detects the use of BOINC software that has a process name other than "BOINC.exe".
references:
    - https://boinc.berkeley.edu/
    - https://www.virustotal.com/gui/file/91e405e8a527023fb8696624e70498ae83660fe6757cef4871ce9bcc659264d3/details
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
author: Matt Anderson (Huntress)
date: 2024/07/15
tags:
    - attack.defense_evasion
    - attack.t1553
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: 'BOINC.exe'
    filter:
        Image|endswith: 'BOINC.exe'
    condition: selection and not filter
falsepositives:
    - Unknown
level: medium
