title: Suspicious Command Line with Teams Application related objects pathes
id: 25cde13e-8e20-4c29-b949-4e795b76f16f
status: test
description: 'Detects an access to authentication tokens and accounts of Microsoft Teams desktop application.'
author: '@SerkinValery'
references:
  - https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
  - https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens
date: 2022/09/16
modified: 2022/09/16
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - '\Microsoft\Teams\Cookies'
      - '\Microsoft\Teams\Local Storage\leveldb'
  filter:
    Image|contains: '\Microsoft\Teams\current\Teams.exe'
  condition: selection and not filter
falsepositives:
  - Unknown
level: high
tags:
  - attack.credential_access
  - attack.t1528