title: Schtasks Creation Or Modification With SYSTEM Privileges
id: 89ca78fd-b37c-4310-b3d3-81a023f83936
status: experimental
description: Detects the creation or update of a scheduled task to run with "NT AUTHORITY\SYSTEM" privileges
author: Nasreddine Bencherchali
references:
    - https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern
date: 2022/07/28
logsource:
    product: windows
    category: process_creation
detection:
    selection_root:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains:
            - ' /change '
            - ' /create '
    selection_run:
        CommandLine|contains:
            - '/ru '
    selection_user:
        CommandLine|contains:
            - 'NT AUT'
            - ' SYSTEM '
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.execution
    - attack.persistence
    - attack.t1053.005
