title: PowerShell Base64 Encoded Shellcode
id: 2d117e49-e626-4c7c-bd1f-c3c0147774c8
status: stable
description: Detects Base64 encoded Shellcode
author: Florian Roth
references:
    - https://twitter.com/cyb3rops/status/1063072865992523776
date: 2018/11/17
modified: 2022/07/07
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains: 'AAAAYInlM'
    selection2:
        CommandLine|contains:
            - 'OiCAAAAYInlM'
            - 'OiJAAAAYInlM'
    condition: all of selection*
falsepositives:
    - Unknown
level: critical
tags:
    - attack.defense_evasion
    - attack.t1027
