title: CL_LoadAssembly.ps1 Proxy Execution
id: c57872c7-614f-4d7f-a40d-b78c8df2d30d
description: Detects the use of a Microsoft signed script to execute commands and bypassing AppLocker.
status: experimental
references:
    - https://bohops.com/2018/01/07/executing-commands-and-bypassing-applocker-with-powershell-diagnostic-scripts/
    - https://lolbas-project.github.io/lolbas/Scripts/CL_LoadAssembly/
author: frack113
date: 2022/05/21
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - '\CL_LoadAssembly.ps1'
            - 'LoadAssemblyFromPath '
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion
    - attack.t1216
