title: HackTool - Certify
id: 762f2482-ff21-4970-8939-0aa317a886bb
status: experimental
description: Detects hacktool 'Certify' - Tool for Active Directory certificate abuse
references:
    - https://github.com/GhostPack/Certify
author: pH-T (Nextron Systems)
date: 2023/04/17
modified: 2023/04/17
tags:
    - attack.discovery
    - attack.t1590.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_base:
        - Image|endswith: '\Certify.exe'
        - OriginalFileName: '\Certify.exe'
        - Description: 'Certify'
    selection_base_cli:
        CommandLine|contains:
            - '.exe cas '
            - '.exe find '
            - '.exe pkiobjects '
            - '.exe request '
            - '.exe download '
    selection_cli:
        CommandLine|contains:
            - 'vulnerable '
            - 'template'
            - 'altname'
            - 'domain'
            - 'path'
            - ' /ca:'
    condition: selection_base or (selection_base_cli and selection_cli)
falsepositives:
    - Very unlikely
level: high
