title: DefenderCheck Usage
id: f0ca6c24-3225-47d5-b1f5-352bf07ecfa7
status: experimental
description: Detects the use of DefenderCheck, a tool to evaluate the signatures used in Microsoft Defender. It can be used to figure out the strings / byte chains used in Microsoft Defender to detect a tool and thus used for AV evasion.
author: Florian Roth
references:
    - https://github.com/matterpreter/DefenderCheck
date: 2022/08/30
tags:
    - attack.defense_evasion
    - attack.t1027.005
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\DefenderCheck.exe'
        - Description: 'DefenderCheck'
    condition: selection
falsepositives:
    - Unlikely
level: high
