title: Use of TTDInject.exe
id: b27077d6-23e6-45d2-81a0-e2b356eea5fd
status: experimental
description: Used by Windows 1809 and newer to Debug Time Travel (Underlying call of tttracer.exe)
author: frack113
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/
date: 2022/05/16
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    - Image|endswith: ttdinject.exe
    - OriginalFileName: TTDInject.EXE
  condition: selection
falsepositives:
  - Legitimate use
level: medium
tags:
  - attack.defense_evasion
  - attack.t1127 
