title: Use of VisualUiaVerifyNative.exe
id: 49be8799-7b4d-4fda-ad23-cafbefdebbc5
status: experimental
description: VisualUiaVerifyNative.exe is a Windows SDK that can be used for AWL bypass and is listed in Microsoft's recommended block rules.
author: 'Christopher Peacock @SecurePeacock, SCYTHE @scythe_io'
references:
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/VisualUiaVerifyNative/
  - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules
  - https://bohops.com/2020/10/15/exploring-the-wdac-microsoft-recommended-block-rules-visualuiaverifynative/
  - https://github.com/MicrosoftDocs/windows-itpro-docs/commit/937db704b9148e9cee7c7010cad4d00ce9c4fdad
date: 2022/06/01
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    - Image|endswith: VisualUiaVerifyNative.exe
    - OriginalFileName: VisualUiaVerifyNative.exe
  condition: selection
falsepositives:
  - Legitimate testing of Microsoft UI parts.
level: medium
tags:
  - attack.defense_evasion
  - attack.t1218
