title: Powershell Defender Disable Scan Feature
id: 1ec65a5f-9473-4f12-97da-622044d6df21
status: experimental
description: Detects requests to disable Microsoft Defender features using PowerShell commands
references:
    - https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps
    - https://www.virustotal.com/gui/file/d609799091731d83d75ec5d1f030571af20c45efeeb94840b67ea09a3283ab65/behavior/C2AE
    - https://www.virustotal.com/gui/search/content%253A%2522Set-MpPreference%2520-Disable%2522/files
tags:
    - attack.defense_evasion
    - attack.t1562.001
author: Florian Roth
date: 2022/03/03
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains: 
            - 'Add-MpPreference '
            - 'Set-MpPreference '
    selection2:
        CommandLine|contains:
            - 'DisableRealtimeMonitoring '
            - 'DisableIOAVProtection '
            - 'DisableBehaviorMonitoring '
            - 'DisableBlockAtFirstSeen '
    selection3:
        CommandLine|contains:
            - '$true'
            - ' 1 '
    encoded_command:
        CommandLine|base64offset|contains:
            - 'DisableRealtimeMonitoring '
            - 'DisableIOAVProtection '
            - 'DisableBehaviorMonitoring '
            - 'DisableBlockAtFirstSeen '
            - 'disablerealtimemonitoring '
            - 'disableioavprotection '
            - 'disablebehaviormonitoring '
            - 'disableblockatfirstseen '
    condition: all of selection* or encoded_command
falsepositives:
    - Possible Admin Activity
    - Other Cmdlets that may use the same parameters
level: high
