title: Winnti Pipemon Characteristics
id: 73d70463-75c9-4258-92c6-17500fe972f2
status: stable
description: Detects specific process characteristics of Winnti Pipemon malware reported by ESET
references:
    - https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/
author: Florian Roth (Nextron Systems), oscd.community
date: 2020/07/30
modified: 2021/11/27
tags:
    - attack.defense_evasion
    - attack.t1574.002
    - attack.g0044
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli:
        CommandLine|contains: 'setup0.exe -p'
    selection_cmd_1:
        CommandLine|contains: 'setup.exe'
    selection_cmd_2:
        CommandLine|endswith:
            - '-x:0'
            - '-x:1'
            - '-x:2'
    condition: selection_cli or all of selection_cmd_*
falsepositives:
    - Legitimate setups that use similar flags
level: critical
