title: Nslookup PowerShell Download Cradle - ProcessCreation
id: 1b3b01c7-84e9-4072-86e5-fc285a41ff23
related:
    - id: 72671447-4352-4413-bb91-b85569687135
      type: obsoletes
status: experimental
description: Detects suspicious powershell download cradle using nslookup. This cradle uses nslookup to extract payloads from DNS records
references:
    - https://twitter.com/Alh4zr3d/status/1566489367232651264
author: Nasreddine Bencherchali
date: 2022/09/05
modified: 2022/12/12
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection_cli:
        CommandLine|contains|all:
            - 'powershell .'
            - 'nslookup'
            - ' -q=txt '
    selection_img:
        ParentImage|endswith: '\powershell.exe'
        Image|contains: '\nslookup.exe'
        CommandLine|contains:
            - ' -q=txt '
            - ' -querytype=txt '
    condition: 1 of selection_*
falsepositives:
    - Unlikely
level: high
