title: PowerShell Download from URL
id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
status: test
description: Detects a Powershell process that contains download commands in its command line string
author: Florian Roth, oscd.community, Jonhnathan Ribeiro
date: 2019/01/16
modified: 2022/07/14
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains|all:
            - 'new-object'
            - 'net.webclient).'
            - 'download'
        CommandLine|contains:
            - 'string('
            - 'file('
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: medium
tags:
    - attack.execution
    - attack.t1059.001
