title: Browser Started with Remote Debugging
id: b3d34dc5-2efd-4ae3-845f-8ec14921f449
status: experimental
description: Detects browsers starting with the '--remote-debugging' flag. Which is a technique often used to perform browser injection attacks
author: pH-T
references:
    - https://yoroi.company/wp-content/uploads/2022/05/EternityGroup_report_compressed.pdf
date: 2022/07/27
logsource:
    category: process_creation
    product: windows
detection:
    selection_chrome_based:
        CommandLine|contains:
            - ' --remote-debugging-address='
            - ' --remote-debugging-port='
    selection_firefox:
        Image|endswith: '\firefox.exe'
        CommandLine|contains: ' -start-debugger-server '
    condition: 1 of selection*
falsepositives:
    - Unknown
level: medium
tags:
    - attack.credential_access
    - attack.t1185
