title: Suspicious Visual Studio Code Tunnel
id: c565ef1e-ee14-49f2-b9dd-4a8e00bac268
status: experimental
description: Detects Visual Studio Code tunnel that can be used as a reverse shell 
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
    - https://learn.microsoft.com/en-us/azure/developer/dev-tunnels/security
tags:
    - attack.command_and_control
    - attack.t1071.001
author: ipfyx (blog post),citron_ninja (rule)
date: 2023/09/28
logsource:                 
    category: process_creation 
    product: windows            
detection:
    selection_exe_null:
        Company: null
        Description: null
        OriginalFileName: null
        Product: null
    selection_exe_sysmon:
        Company: '-'
        Description: '-'
        OriginalFileName: '-'
        Product: '-'
    selection_cli:
        CommandLine|contains: '.exe '
        CommandLine|endswith: ' tunnel'
    condition: 1 of selection_exe_* and selection_cli
falsepositives:
    - Legitimate use of Visual Studio Code tunnel
level: medium
