title: Exports Registry Key To a File
id: f0e53e89-8d22-46ea-9db5-9d4796ee2f8a
status: test
description: Detects the export of the target Registry key to a file.
author: Oddvar Moe, Sander Wiebing, oscd.community
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
date: 2020/10/07
modified: 2022/07/07
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\regedit.exe'
        CommandLine|contains:
            - ' /E '
            - ' -E '
    filter_1:   # filters to avoid intersection with critical keys rule
        CommandLine|contains:
            - 'hklm'
            - 'hkey_local_machine'
    filter_2:
        CommandLine|endswith:
            - '\system'
            - '\sam'
            - '\security'
    condition: selection and not all of filter_*
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Legitimate export of keys
level: low
tags:
    - attack.exfiltration
    - attack.t1012
