title: Missing Space Characters in Command Lines
id: a16980c2-0c56-4de0-9a79-17971979efdd
status: experimental
description: Detects Windows command lines that miss a space before or after the /c flag when running a command using the cmd.exe. This could be a sign of obfuscation of a fat finger problem (typo by the developer).
author: Florian Roth
references:
    - https://twitter.com/cyb3rops/status/1562072617552678912
date: 2022/08/23
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection1:  # missing space before the /c
        CommandLine|contains:
            - 'cmd.exe/c'
            - '\cmd/c'  # just cmd/c would be prone to false positives 
    selection2: # special cases verified via Virustotal Enterprise search
        CommandLine|contains:
            - '/cwhoami'
            - '/cpowershell'
            - '/cschtasks'
            - '/cbitsadmin'
            - '/ccertutil'
    selection3:  # missing space after the /c
        CommandLine|contains:
            - 'cmd.exe /c'
            - 'cmd /c'
    filter1:
        CommandLine|contains:
            - 'cmd.exe /c '
            - 'cmd /c '
    condition: 1 of selection* and not 1 of filter*
falsepositives:
    - Unknown
level: high
