title: Set Suspicious Files as System Files Using Attrib
id: efec536f-72e8-4656-8960-5e85d091345b
related:
    - id: bb19e94c-59ae-4c15-8c12-c563d23fe52b
      type: derived
status: experimental
description: Detects usage of attrib with "+s" option to set suspcious files as system files
author: Nasreddine Bencherchali
references:
    - https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4
    - https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0
date: 2022/06/28
logsource:
    category: process_creation
    product: windows
detection:
    selection_basic:
        Image|endswith: \attrib.exe
        CommandLine|contains: ' +s'
    selection_paths:
        CommandLine|contains:
            - ' %' # Custom Environment variable
            - '\Users\Public'
            - '\AppData\Local\Temp\'
            - '\ProgramData\'
            - '\Downloads\'
    selection_ext:
        CommandLine|contains:
            - '.bat'
            - '.ps1'
            - '.vbe'
            - '.vbs'
            - '.exe'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1564.001