title: Suspicious Nmap Execution
id: f6ecd1cf-19b8-4488-97f6-00f0924991a3
status: test
description: Adversaries may attempt to get a listing of services running on remote hosts, including those that may be vulnerable to remote software exploitation
references:
    - https://nmap.org/
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-3---port-scan-nmap-for-windows
author: frack113
date: 2021/12/10
modified: 2022/12/25
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        OriginalFileName: nmap.exe
    condition: selection
falsepositives:
    - Network administrator computer
level: high
