title: PowerShell Web Download
id: 6e897651-f157-4d8f-aaeb-df8151488385
status: experimental
description: Detects suspicious ways to download files or content using PowerShell
author: Florian Roth
date: 2022/03/24
references:
    - https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        # Marker
        CommandLine|contains:
            - '.DownloadString('
            - '.DownloadFile('
    condition: selection
falsepositives:
    - Scripts or tools that download files
level: medium
