title: Net WebClient Casing Anomalies
id: c86133ad-4725-4bd0-8170-210788e0a7ba
status: experimental
description: Detects PowerShell command line contents that include a suspicious anormal casing in the Net.Webclient (e.g. nEt.WEbCliEnT) string as used in obfuscation techniques
author: Florian Roth
references:
  - https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/
date: 2022/05/24
tags:
  - attack.execution
  - attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  encoded:
    Image|endswith: '\powershell.exe'
  selection:
    CommandLine|contains:
        - 'TgBlAFQALgB3AEUAQg'
        - '4AZQBUAC4AdwBFAEIA'
        - 'OAGUAVAAuAHcARQBCA'
        - 'bgBFAHQALgB3AGUAYg'
        - '4ARQB0AC4AdwBlAGIA'
        - 'uAEUAdAAuAHcAZQBiA'
        - 'TgBFAHQALgB3AGUAYg'
        - '4ARQB0AC4AdwBlAGIA'
        - 'OAEUAdAAuAHcAZQBiA'
        - 'bgBlAFQALgB3AGUAYg'
        - '4AZQBUAC4AdwBlAGIA'
        - 'uAGUAVAAuAHcAZQBiA'
        - 'TgBlAFQALgB3AGUAYg'
        - '4AZQBUAC4AdwBlAGIA'
        - 'OAGUAVAAuAHcAZQBiA'
        - 'bgBFAFQALgB3AGUAYg'
        - '4ARQBUAC4AdwBlAGIA'
        - 'uAEUAVAAuAHcAZQBiA'
        - 'bgBlAHQALgBXAGUAYg'
        - '4AZQB0AC4AVwBlAGIA'
        - 'uAGUAdAAuAFcAZQBiA'
        - 'bgBFAHQALgBXAGUAYg'
        - '4ARQB0AC4AVwBlAGIA'
        - 'uAEUAdAAuAFcAZQBiA'
        - 'TgBFAHQALgBXAGUAYg'
        - '4ARQB0AC4AVwBlAGIA'
        - 'OAEUAdAAuAFcAZQBiA'
        - 'bgBlAFQALgBXAGUAYg'
        - '4AZQBUAC4AVwBlAGIA'
        - 'uAGUAVAAuAFcAZQBiA'
        - 'TgBlAFQALgBXAGUAYg'
        - '4AZQBUAC4AVwBlAGIA'
        - 'OAGUAVAAuAFcAZQBiA'
        - 'bgBFAFQALgBXAGUAYg'
        - '4ARQBUAC4AVwBlAGIA'
        - 'uAEUAVAAuAFcAZQBiA'
        - 'bgBlAHQALgB3AEUAYg'
        - '4AZQB0AC4AdwBFAGIA'
        - 'uAGUAdAAuAHcARQBiA'
        - 'TgBlAHQALgB3AEUAYg'
        - '4AZQB0AC4AdwBFAGIA'
        - 'OAGUAdAAuAHcARQBiA'
        - 'bgBFAHQALgB3AEUAYg'
        - '4ARQB0AC4AdwBFAGIA'
        - 'uAEUAdAAuAHcARQBiA'
        - 'TgBFAHQALgB3AEUAYg'
        - '4ARQB0AC4AdwBFAGIA'
        - 'OAEUAdAAuAHcARQBiA'
        - 'bgBlAFQALgB3AEUAYg'
        - '4AZQBUAC4AdwBFAGIA'
        - 'uAGUAVAAuAHcARQBiA'
        - 'TgBlAFQALgB3AEUAYg'
        - '4AZQBUAC4AdwBFAGIA'
        - 'OAGUAVAAuAHcARQBiA'
        - 'bgBFAFQALgB3AEUAYg'
        - '4ARQBUAC4AdwBFAGIA'
        - 'uAEUAVAAuAHcARQBiA'
        - 'TgBFAFQALgB3AEUAYg'
        - '4ARQBUAC4AdwBFAGIA'
        - 'OAEUAVAAuAHcARQBiA'
        - 'bgBlAHQALgBXAEUAYg'
        - '4AZQB0AC4AVwBFAGIA'
        - 'uAGUAdAAuAFcARQBiA'
        - 'TgBlAHQALgBXAEUAYg'
        - '4AZQB0AC4AVwBFAGIA'
        - 'OAGUAdAAuAFcARQBiA'
        - 'bgBFAHQALgBXAEUAYg'
        - '4ARQB0AC4AVwBFAGIA'
        - 'uAEUAdAAuAFcARQBiA'
        - 'TgBFAHQALgBXAEUAYg'
        - '4ARQB0AC4AVwBFAGIA'
        - 'OAEUAdAAuAFcARQBiA'
        - 'bgBlAFQALgBXAEUAYg'
        - '4AZQBUAC4AVwBFAGIA'
        - 'uAGUAVAAuAFcARQBiA'
        - 'TgBlAFQALgBXAEUAYg'
        - '4AZQBUAC4AVwBFAGIA'
        - 'OAGUAVAAuAFcARQBiA'
        - 'bgBFAFQALgBXAEUAYg'
        - '4ARQBUAC4AVwBFAGIA'
        - 'uAEUAVAAuAFcARQBiA'
        - 'TgBFAFQALgBXAEUAYg'
        - '4ARQBUAC4AVwBFAGIA'
        - 'OAEUAVAAuAFcARQBiA'
        - 'bgBlAHQALgB3AGUAQg'
        - '4AZQB0AC4AdwBlAEIA'
        - 'uAGUAdAAuAHcAZQBCA'
        - 'TgBlAHQALgB3AGUAQg'
        - '4AZQB0AC4AdwBlAEIA'
        - 'OAGUAdAAuAHcAZQBCA'
        - 'bgBFAHQALgB3AGUAQg'
        - '4ARQB0AC4AdwBlAEIA'
        - 'uAEUAdAAuAHcAZQBCA'
        - 'TgBFAHQALgB3AGUAQg'
        - '4ARQB0AC4AdwBlAEIA'
        - 'OAEUAdAAuAHcAZQBCA'
        - 'bgBlAFQALgB3AGUAQg'
        - '4AZQBUAC4AdwBlAEIA'
        - 'uAGUAVAAuAHcAZQBCA'
        - 'TgBlAFQALgB3AGUAQg'
        - '4AZQBUAC4AdwBlAEIA'
        - 'OAGUAVAAuAHcAZQBCA'
        - 'bgBFAFQALgB3AGUAQg'
        - '4ARQBUAC4AdwBlAEIA'
        - 'uAEUAVAAuAHcAZQBCA'
        - 'TgBFAFQALgB3AGUAQg'
        - '4ARQBUAC4AdwBlAEIA'
        - 'OAEUAVAAuAHcAZQBCA'
        - 'bgBlAHQALgBXAGUAQg'
        - '4AZQB0AC4AVwBlAEIA'
        - 'uAGUAdAAuAFcAZQBCA'
        - 'TgBlAHQALgBXAGUAQg'
        - '4AZQB0AC4AVwBlAEIA'
        - 'OAGUAdAAuAFcAZQBCA'
        - 'bgBFAHQALgBXAGUAQg'
        - '4ARQB0AC4AVwBlAEIA'
        - 'uAEUAdAAuAFcAZQBCA'
        - 'TgBFAHQALgBXAGUAQg'
        - '4ARQB0AC4AVwBlAEIA'
        - 'OAEUAdAAuAFcAZQBCA'
        - 'bgBlAFQALgBXAGUAQg'
        - '4AZQBUAC4AVwBlAEIA'
        - 'uAGUAVAAuAFcAZQBCA'
        - 'TgBlAFQALgBXAGUAQg'
        - '4AZQBUAC4AVwBlAEIA'
        - 'OAGUAVAAuAFcAZQBCA'
        - 'bgBFAFQALgBXAGUAQg'
        - '4ARQBUAC4AVwBlAEIA'
        - 'uAEUAVAAuAFcAZQBCA'
        - 'TgBFAFQALgBXAGUAQg'
        - '4ARQBUAC4AVwBlAEIA'
        - 'OAEUAVAAuAFcAZQBCA'
        - 'bgBlAHQALgB3AEUAQg'
        - '4AZQB0AC4AdwBFAEIA'
        - 'uAGUAdAAuAHcARQBCA'
        - 'TgBlAHQALgB3AEUAQg'
        - '4AZQB0AC4AdwBFAEIA'
        - 'OAGUAdAAuAHcARQBCA'
        - 'bgBFAHQALgB3AEUAQg'
        - '4ARQB0AC4AdwBFAEIA'
        - 'uAEUAdAAuAHcARQBCA'
        - 'TgBFAHQALgB3AEUAQg'
        - '4ARQB0AC4AdwBFAEIA'
        - 'OAEUAdAAuAHcARQBCA'
        - 'bgBlAFQALgB3AEUAQg'
        - '4AZQBUAC4AdwBFAEIA'
        - 'uAGUAVAAuAHcARQBCA'
        - 'TgBlAFQALgB3AEUAQg'
        - '4AZQBUAC4AdwBFAEIA'
        - 'OAGUAVAAuAHcARQBCA'
        - 'bgBFAFQALgB3AEUAQg'
        - '4ARQBUAC4AdwBFAEIA'
        - 'uAEUAVAAuAHcARQBCA'
        - 'TgBFAFQALgB3AEUAQg'
        - '4ARQBUAC4AdwBFAEIA'
        - 'OAEUAVAAuAHcARQBCA'
        - 'TgBlAHQALgBXAEUAQg'
        - '4AZQB0AC4AVwBFAEIA'
        - 'OAGUAdAAuAFcARQBCA'
        - 'bgBFAHQALgBXAEUAQg'
        - '4ARQB0AC4AVwBFAEIA'
        - 'uAEUAdAAuAFcARQBCA'
        - 'TgBFAHQALgBXAEUAQg'
        - '4ARQB0AC4AVwBFAEIA'
        - 'OAEUAdAAuAFcARQBCA'
        - 'bgBlAFQALgBXAEUAQg'
        - '4AZQBUAC4AVwBFAEIA'
        - 'uAGUAVAAuAFcARQBCA'
        - 'TgBlAFQALgBXAEUAQg'
        - '4AZQBUAC4AVwBFAEIA'
        - 'OAGUAVAAuAFcARQBCA'
        - 'bgBFAFQALgBXAEUAQg'
        - '4ARQBUAC4AVwBFAEIA'
        - 'uAEUAVAAuAFcARQBCA'
  condition: selection
falsepositives:
  - Unknown
level: high
