title: Parent in Public Folder Suspicious Process
id: 69bd9b97-2be2-41b6-9816-fb08757a4d1a
status: test
description: This rule detects suspicious processes with parent images located in the C:\Users\Public folder
references:
    - https://redcanary.com/blog/blackbyte-ransomware/
author: Florian Roth (Nextron Systems)
date: 2022/02/25
modified: 2022/11/18
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1564
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|startswith: 'C:\Users\Public\'
        CommandLine|contains:
            - 'powershell'
            - 'cmd.exe /c '
            - 'cmd.exe /r '
            - 'cmd.exe /k '
            - 'cmd /c '
            - 'cmd /r '
            - 'cmd /k '
            - 'wscript.exe'
            - 'cscript.exe'
            - 'bitsadmin'
            - 'certutil'
            - 'mshta.exe'
    condition: selection
fields:
    - ComputerName
    - User
    - CommandLine
falsepositives:
    - Unknown
level: high
