title: Suspicious Extrac32 Alternate Data Stream Execution 
id: 4b13db67-0c45-40f1-aba8-66a1a7198a1e
status: experimental
description: Extract data from cab file and hide it in an alternate data stream
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
tags:
    - attack.defense_evasion
    - attack.t1564.004 
author: frack113
date: 2021/11/26
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - extrac32.exe
            - .cab
        CommandLine|re: ':[^\\\\]'
    condition: selection 
falsepositives:
    - Unknown
level: medium
