title: Use of Scriptrunner.exe
id: 64760eef-87f7-4ed3-93fd-655668ea9420
status: experimental
description: The "ScriptRunner.exe" binary can be abused to porxy execution through it and bypass possible whitelisting
author: Nasreddine Bencherchali
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Scriptrunner/
date: 2022/07/01
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\ScriptRunner.exe'
        - OriginalFileName: 'ScriptRunner.exe'
    selection_cli:
        CommandLine|contains: ' -appvscript '
    condition: all of selection*
falsepositives:
  - Legitimate use when App-v is deployed
level: medium
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
