title: Suspicious Memory Dump Execution
id: 129966c9-de17-4334-a123-8b58172e664d
description: Detects when a user bypasses Defender and dumps LSASS by renaming procdump.exe to dump64.exe
status: experimental
author: Austin Songer @austinsonger, Florian Roth
date: 2021/11//26
references:
    - https://twitter.com/mrd0x/status/1460597833917251595
logsource:
      product: windows
      category: process_creation
detection: 
    selection:
        Image|endswith: '\dump64.exe'
    procdump_flags:
        CommandLine|contains:
            - ' -ma '
            - 'accpeteula'
    filter:
        Image|contains: '\Installer\Feedback\dump64.exe'
    condition: ( selection and not filter ) or ( selection and procdump_flags )
tags:
    - attack.credential_access
    - attack.t1003.001
level: high
falsepositives:
    - Unlikely
