title: Possible Excel DCOM Lateral Movement
id: 
status: experimental
description: Detects suspicious child processes of Excel which could be an indicator of lateral movement leveraging an Excel DCOM object. 
references:
    - https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922
author: Aaron Stratton
date: 2023/10/31
tags:
    - attack.T1021.003
    - attack.lateral_movement
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\excel.exe'
    selection_child:
        - OriginalFileName:
          - 'foxprow.exe'
          - 'schdplus.exe'
          - 'winproj.exe'
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
