title: Launch WebBrowserPassView Executable
id: d0dae994-26c6-4d2d-83b5-b3c8b79ae513
status: experimental
description: Detect use of WebBrowserPassView.exe
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1555.003/T1555.003.md
author: frack113
date: 2022/08/20
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Description: 'Web Browser Password Viewer'
        - Image|endswith: '\WebBrowserPassView.exe'
    condition: selection
falsepositives:
    - Legitimate use
level: medium
tags:
    - attack.credential_access
    - attack.t1555.003
