title: Modifies the Registry From a ADS
id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
status: experimental
description: Detects the import of an alternate data stream with regini.exe, regini.exe can be used to modify registry keys.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regini/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini
tags:
    - attack.t1112
    - attack.defense_evasion
author: Eli Salem, Sander Wiebing, oscd.community
date: 2020/10/12
modified: 2022/05/09
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\regini.exe'
        - OriginalFileName: 'REGINI.EXE'
    selection_re:
        CommandLine|re: ':[^ \\\\]'
    condition: selection and selection_re
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Unknown
level: high
