title: Create Symbolic Link From osk.exe to cmd.exe
id: e9b61244-893f-427c-b287-3e708f321c6b
status: experimental
description: Detects creation of a link from accessiblity executable with cmd.exe to provide elevated command prompt from login screen without logging in.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1546.008/T1546.008.md
author: frack113
date: 2022/12/11
tags:
    - attack.credential_access
    - attack.t1546.008
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'Cmd.exe'
    selection_cli:
        CommandLine|contains|all:
            - 'mklink'
            - '\System32\osk.exe'
            - '\System32\cmd.exe'
    condition: all of selection_* 
falsepositives:
    - Unknown
level: high
