title: Headless Browser Accessing Mockbin Service
id: 1818236d-dd26-4986-b309-108b8b33ac06
status: test
description: Detects execution of chromium based browser in headless mode to download files from Mockbin or Mocky service, a behavior believed to be linked to the APT28 Group.
references:
    - https://medium.com/@simone.kraus/critical-engergy-infrastructure-facility-in-ukraine-attack-b15638f6a402
	- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.003/T1564.003.md#atomic-test-2---headless-browser-accessing-mockbin
	- https://research.splunk.com/endpoint/869ba261-c272-47d7-affe-5c0aa85c93d6/
author: Sittikorn S
date: 2023/09/26
tags:
    - attack.command_and_control
    - attack.t1090
	- attack.defense_evasion
	- attack.t1564.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd:
        Image|endswith:
            - '\brave.exe'
            - '\chrome.exe'
            - '\msedge.exe'
            - '\opera.exe'
            - '\vivaldi.exe'
        CommandLine|contains|all:
            - '--headless'
            - '--disable-gpu'
    selection_site:
        CommandLine|contains:
	    - 'mockbin.org'
     	    - 'mocky.io'
    condition: selection_cmd and selection_site
falsepositives:
    - Unknown
level: medium
