title: Operator Bloopers Cobalt Strike Modules
status: experimental
id: 4f154fb6-27d1-4813-a759-78b93e0b9c48
description: Detects use of Cobalt Strike module commands accidentally entered in the CMD shell
author: _pete_0, TheDFIRReport
references:
    - https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
    - https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
    - https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/
date: 2022/05/06
modified: 2022/05/06
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\cmd.exe'
        CommandLine|startswith:
            - 'cmd.exe'
            - 'c:\windows\system32\cmd.exe'
        CommandLine|contains:
            - Invoke-UserHunter
            - Invoke-ShareFinder
            - Invoke-Kerberoast
            - Invoke-SMBAutoBrute
            - Invoke-Nightmare
            - zerologon
            - av_query
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: high
tags:
    - attack.execution
    - attack.t1059.003
