title: Detect_execute_proxied_payload_with_Microsoft_signed_binary_to_bypass_WDAC_policies
id: e733959b-e761-4eda-bcf2-588e321c0515
status: experimental
description: Detect AWL bypass Execute arbitrary C# code embedded in a XOML file
references: 
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wfc/
tags:
  - attack.t1127
author: Meshal Aljohani
logsource:
 category: process_creation
 product: windows
detection:
 wfc_path:
   Image|endswith:
   - 'wfc.exe'
   - 'fsi.exe'
   - 'fsianycpu.exe'
 cmd_cont:
   CommandLine|contains:
   - 'xomal'
   - 'path'
   - 'to'
   - 'test'
   - 'exe'
   - 'wfc'
   - 'fsscript'
   - 'Get-Process'
   - 'ProcessName'
 condition: wfc_path AND cmd_cont   
fields:
  - CommandLine
  - ParentImage
falsepositives:
 - Unknown
level: high
