title: WMIExec VBS Script
id: 966e4016-627f-44f7-8341-f394905c361f
status: test
description: Detects wmiexec vbs version execution by wscript or cscript
author: Florian Roth
references:
    - https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
date: 2017/04/07
modified: 2022/09/08
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith:
            - '\cscript.exe'
            - '\wscript.exe'
        CommandLine|contains|all:
            - '.vbs'
            - '/shell'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unlikely
level: high
tags:
    - attack.execution
    - attack.g0045
    - attack.t1059.005
