title: NTDS.dit or SYSTEM Hive Access Using WBADMIN.EXE
id: 8b93a509-1cb8-42e1-97aa-ee24224cdc15
status: experimental
description: Extract or Restore NTDS.dit and SYSTEM hive with wbadmin cli tools
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
author: frack113
date: 2024/04/20
tags:
    - attack.credential_access
    - attack.t1003.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\wbadmin.exe'
        - OriginalFileName: 'WBADMIN.EXE'
    selection_path:
        CommandLine|contains:
            - '\Windows\NTDS\NTDS.dit'
            - '\config\SYSTEM'
    condition: all of selection_*
falsepositives:
    - Legitimate use by the administrator
level: medium
