title: Reg Disable Security Service
id: 5e95028c-5229-4214-afae-d653d573d0ec
description: Detects a suspicious reg.exe invocation that looks as if it would disable an important security service
status: experimental
references:
    - https://twitter.com/JohnLaTwC/status/1415295021041979392
author: Florian Roth, John Lambert (idea)
date: 2021/07/14
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_reg:
        CommandLine|contains|all:
            - 'reg'
            - 'add'
            - ' /d 4'
            - ' /v Start'
    selection_services:
        CommandLine|contains:
            - '\Sense '
            - '\WinDefend'
            - '\MsMpSvc'
            - '\NisSrv'
            - '\WdBoot '
            - '\WdNisDrv'
            - '\WdNisSvc'
            - '\wscsvc '
            - '\SecurityHealthService'
            - '\wuauserv'
            - '\UsoSvc '
    condition: selection_reg and selection_services
falsepositives:
    - Unknown
    - Other security solution installers
level: high
