title: WMIC Unquoted Services Path Lookup
id: 68bcd73b-37ef-49cb-95fc-edc809730be6
status: experimental
description: Detects wmic known recon method to look for unquoted service paths, often used by pentest and attackers enum scripts
author: Nasreddine Bencherchali
references:
    - https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
    - https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
date: 2022/06/20
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - OriginalFileName: 'wmic.exe'
        - Image|endswith: '\WMIC.exe'
    selection_cli:
        CommandLine|contains|all:
            - ' service '
            - ' get '
        CommandLine|contains:
            - name
            - displayname
            - pathname
            - startmode
    condition: all of selection*
falsepositives:
    - Unknown
level: medium
tags:
    - attack.execution
    - attack.t1047
