title: Execute Arbitrary Binaries Using GUP Utility
id: d65aee4d-2292-4cea-b832-83accd6cfa43
status: experimental
description: Detects execution of the Notepad++ updater (gup) to launch other commands or executables
author: Nasreddine Bencherchali
references:
    - https://twitter.com/nas_bench/status/1535322445439180803
date: 2022/06/10
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\gup.exe'
        Image|endswith: '\explorer.exe'
    filter:
        Image|endswith: '\explorer.exe'
        CommandLine|contains: '\Notepad++\notepad++.exe'
    condition: selection and not filter
falsepositives:
    - Other parent binaries using GUP not currently identified
level: high
tags:
    - attack.execution
