title: Suspicious aspnet_compiler.exe Execution
id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
status: experimental
description: Execute C# code with the Build Provider and proper folder structure in place.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
tags:
    - attack.defense_evasion
    - attack.t1127
author: frack113
date: 2021/11/24
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|contains|all:
            - C:\Windows\Microsoft.NET\Framework
            - aspnet_compiler.exe
    condition: selection
falsepositives:
    - Unknown
level: medium
