title: Suspicious XOR Encoded PowerShell Command Line
id: bb780e0c-16cf-4383-8383-1e5471db6cf9
status: test
description: Detects suspicious powershell process which includes bxor command, alternative obfuscation method to b64 encoded commands.
author: Sami Ruohonen, Harish Segar (improvement), Tim Shelton
date: 2018/09/05
modified: 2022/12/16
tags:
    - attack.defense_evasion
    - attack.t1059.001
    - attack.t1140
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    selection_metadata:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        - OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
        - Description: 'Windows PowerShell'
        - Product: 'PowerShell Core 6'
    selection_cli:
        CommandLine|contains:
            - 'bxor'
            - '-join '
            - '-join'''
            - '-join"'
            - '-join`'
            - 'char'
    filter_amazon:
        ParentImage: 'C:\Program Files\Amazon\SSM\ssm-document-worker.exe'
    filter_powershell_script:
        CommandLine|contains|all:
            # Script part of Amazon SSM worker (But the parent is empty - see example linked below)
            # Example: https://github.com/SigmaHQ/sigma/pull/3717#issue-1455440560
            - 'function Convert-GuidToCompressedGuid'
            - 'ValueFromPipelineByPropertyName'
            - '::ParseExact('
            - 'KB[000000-999999]'
    condition: all of selection_* and not 1 of filter_*
falsepositives:
    - Unknown
level: medium
