title: Launch TruffleSnout Executable
id: 69ca006d-b9a9-47f5-80ff-ecd4d25d481a
status: experimental
description: Detect use of TruffleSnout.exe
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
    - https://github.com/dsnezhkov/TruffleSnout
author: frack113
date: 2022/08/20
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - OriginalFileName: 'TruffleSnout.exe'
        - Image|endswith: '\TruffleSnout.exe'
    condition: selection
falsepositives:
    - Legitimate use
level: medium
tags:
    - attack.discovery
    - attack.t1482
