title: User Discovery Via Get-ADUser Cmdlet
id: c2993223-6da8-4b1a-88ee-668b8bf315e9
status: experimental
description: Detects usage of the Get-ADUser cmdlet to collect user information
author: Nasreddine Bencherchali
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
date: 2022/09/09
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        - OriginalFileName:
            - 'PowerShell.EXE'
            - 'pwsh.dll'
    selection_cli:
        CommandLine|contains|all:
            - 'Get-ADUser '
            - ' -Filter \*'
    condition: all of selection_*
falsepositives:
    - Legitimate admin scripts may use the same technique, it's better to exclude specific computers or users who execute these commands or scripts often
level: medium
tags:
    - attack.discovery
    - attack.t1033
