title: Suspicious CLSID Folder Name In Suspicious Locations
id: 90b63c33-2b97-4631-a011-ceb0f47b77c3
status: experimental
description: Detects usage of a CLSID folder name located in a suspicious location from the commandline as seen being used in IcedID
references:
    - https://twitter.com/Kostastsale/status/1565257924204986369
author: Nasreddine Bencherchali
date: 2022/09/01
modified: 2022/12/15
tags:
    - attack.defense_evasion
    - attack.t1027
logsource:
    category: process_creation
    product: windows
detection:
    # Uncomment this section and remove the filter if you want the rule to be more specific to processes
    #selection_img:
    #    Image|endswith:
    #        - '\rundll32.exe'
    selection_folder:
        CommandLine|contains:
            # Add more suspicious or unexpected paths
            - '\AppData\Roaming\'
            - '\AppData\Local\Temp\' # This could generate some FP with some installers creating folders with CLSID
    selection_clsid:
        CommandLine|contains|all:
            - '\{'
            - '}\'
    filter:
        Image|contains|all:
            - '\{'
            - '}\'
    filter_null:
        Image: null
    filter_driver_inst:  # DrvInst.exe "4" "0" "C:\Users\venom\AppData\Local\Temp\{a0753cc2-fcea-4d49-a787-2290b564b06f}\nvvhci.inf" "9" "43a2fa8e7" "00000000000001C0" "WinSta0\Default" "00000000000001C4" "208" "c:\program files\nvidia corporation\installer2\nvvhci.{eb7b4460-7ec9-42d6-b73f-d487d4550526}"
        Image: 'C:\Windows\System32\drvinst.exe'
    condition: all of selection_* and not 1 of filter*
falsepositives:
    - Some FP is expected with some installers
level: medium
