title: RDP Session Hijacking
status: experimental
description: Detects RDP Session Hijacking on Windows systems
reference: https://twitter.com/Moti_B/status/909449115477659651
author: juju4
tags:
    - attack.execution
    - attack.t1076
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: 'tscon.exe'
        IntegrityLevel: 'SYSTEM'
    condition: selection
fields:
    - Image
    - IntegrityLevel
falsepositives:
    - Penetration tests
    - Administrative activity
level: medium
