title: Reflective DLL Injection via PowerShell
id: dd74bbe0-6e27-4b01-bc3e-0b9abb4334e2
status: experimental
description: Detects use of PowerShell for reflective DLL injection based on presence of common memory manipulation APIs.
author: Skyler “Keys” Piatiak (vVv-Keys)
date: 2025-06-19
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: ['\\powershell.exe']
    CommandLine|contains:
      - VirtualAlloc
      - CreateThread
      - Add-Type
      - DllImport
      - kernel32.dll
      - WriteProcessMemory
  condition: selection
fields:
  - CommandLine
  - Image
falsepositives:
  - Legitimate system automation scripts
  - Red team simulation tools like Cobalt Strike or Empire
level: high
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1055.001
  - sigma-contrib.vVv-Keys
references:
  - https://attack.mitre.org/techniques/T1055/001/
  - https://www.elastic.co/security-labs/analyzing-reflective-dll-injection
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.reflective_loader
