action: global
title: SILENTTRINITY
status: experimental
description: Detect SILENTTRINITY stager use
references:
  - https://github.com/byt3bl33d3r/SILENTTRINITY
author: Aleksey Potapov, oscd.community
date: 2019/10/22
tags:
  - attack.execution
detection:
  condition: selection
falsepositives:
  - unknown
level: high
---
logsource:
  category: process_creation
  product: windows
  service: sysmon
detection:
  selection:
    Description: '*st2stager*'
---
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 7
    Description: '*st2stager*'
