title: DCOM Excel Execution
id: 6a5d969f-c808-4cfb-a490-9bbe58b31d89
description: Detects Excel application started via the DCOMLaunch service and through automation.
status: experimental
date: 2020/09/17
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
tags:
    - attack.lateral_movement
    - attack.t1021.003
references:
    - https://www.mdsec.co.uk/2020/09/i-like-to-move-it-windows-lateral-movement-part-2-dcom/
    - https://twitter.com/Mordor_Project/status/1307070347850772481
    - https://twitter.com/MDSecLabs/status/1306610061242925056
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentCommandLine|contains: DcomLaunch
        OriginalFileName: Excel.exe
        CommandLine|Contains: automation
    condition: selection
falsepositives:
    - Unknown
level: critical
