title: Proxy Execution via Wuauclt
id: af77cf95-c469-471c-b6a0-946c685c4798
description: Detects the use of the Windows Update Client binary (wuauclt.exe) to proxy execute code.
status: experimental
date: 2020/10/12
modified: 2021/05/10
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), Florian Roth
tags:
    - attack.defense_evasion
    - attack.t1218
references:
    - https://dtm.uk/wuauclt/
logsource:
    category: process_creation
    product: windows
detection:
    selection_one:
        - Image|contains: wuauclt
        - OriginalFileName: wuauclt.exe
    selection_two:
        CommandLine|contains|all: 
            - 'UpdateDeploymentProvider'
            - '.dll'
            - 'RunHandlerComServer'
    filter:
        CommandLine|contains: 
            - ' /UpdateDeploymentProvider UpdateDeploymentProvider.dll '
            - ' wuaueng.dll '
    condition: selection_one and selection_two and not filter
falsepositives:
    - Unknown
level: critical
