title: Renamed ProcDump
id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
status: experimental
description: Detects the execution of a renamed ProcDump executable often used by attackers or malware
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
author: Florian Roth
date: 2019/11/18
modified: 2021/04/29
tags:
    - attack.defense_evasion
    - attack.t1036 # an old one
    - attack.t1036.003
logsource:
    product: windows
    category: process_creation
detection:
    selection1:
        OriginalFileName: 'procdump'
    filter1:
        Image|endswith: 
            - '\procdump.exe'
            - '\procdump64.exe'
    selection2:
        CommandLine|contains|all: 
            - ' -ma '
            - ' -accepteula '
    filter2:
        CommandLine|contains: 
            - '\procdump.exe'
            - '\procdump64.exe'
    condition: ( selection1 and not filter1 ) or ( selection2 and not filter2 )
falsepositives:
    - Procdump illegaly bundled with legitimate software
    - Weird admins who renamed binaries
level: critical
