title: Sysmon driver unload
status: experimental
author: Kirill Kiryanov, oscd.community
description: Detect possible Sysmon driver unload 
date: 2019/10/23
modified: 2019/11/07
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\fltmc.exe'
        CommandLine|contains|all:
            - 'unload'
            - 'sys'
    condition: selection
falsepositives: Unknown
level: high
fields:
    - CommandLine
    - Details
