action: global
title: SILENTTRINITY Stager Execution
status: experimental
description: Detects SILENTTRINITY stager use
references:
    - https://github.com/byt3bl33d3r/SILENTTRINITY
author: Aleksey Potapov, oscd.community
date: 2019/10/22
modified: 2020/09/06
tags:
    - attack.command_and_control
detection:
    selection:
        Description|contains: 'st2stager'
    condition: selection
falsepositives:
    - unknown
level: high
---
id: 03552375-cc2c-4883-bbe4-7958d5a980be
logsource:
    category: process_creation
    product: windows
---
id: 75c505b1-711d-4f68-a357-8c3fe37dbf2d
logsource:
    category: image_load
    product: windows
