title: TAIDOOR RAT DLL Load
id: d1aa3382-abab-446f-96ea-4de52908210b
status: experimental
description: Detects specific process characteristics of Chinese TAIDOOR RAT malware load
references:
    - https://us-cert.cisa.gov/ncas/analysis-reports/ar20-216a
author: Florian Roth
date: 2020/07/30
tags:
    - attack.execution
    - attack.t1055.001
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - 'dll,MyStart'
            - 'dll MyStart'
    selection2:
        CommandLine|endswith:
            - ' MyStart'
    condition: 1 of them
falsepositives:
    - Unknown
level: critical
