title: Process Start From Suspicious Folder
id: dca91cfd-d7ab-4c66-8da7-ee57d487b35b
status: experimental
description: Detects process start from rare or uncommon folders like temporary folder or folders that usually don't contain executable files
references:
    - Malware sandbox results
author: frack113
date: 2022/02/11
logsource:
    category: process_creation
    product: windows
detection:
    image:
        Image|contains:
            - '\Desktop\'
            - '\Temp\'
            - '\Temporary Internet'
    condition: image
falsepositives:
    - unknown
level: low
tags:
    - attack.execution
    - attack.t1204
