title: Odbcconf.exe efensive counter measures evasion via  odbcconf.exe 
description: Defence evasion via  odbcconf.exe loading DLL specified in target .RSP file
status: experimental
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Odbcconf.yml
author: Beyu Denis, oscd.community
date: 2019/10/25
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\odbcconf.exe'
        CommandLine: '* -f *.rsp'
    condition: selection
level: medium
falsepositives:
    - Unknown