title: Bypass UAC via Fodhelper.exe
description: Identifies use of Fodhelper.exe to bypass User Account Control. Adversaries use this technique to execute privileged processes.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Tony Lambert)
date: 2019/10/24
tags:
    - attack.privilege_escalation
    - attack.t1088
detection:
    selection:
        ParentImage:
            - "*\fodhelper.exe"
    condition: selection
falsepositives:
    - unlikely
level: high
logsource:
    category: process_creation
    product: windows
