title: BlueMushroom DLL Load
status: experimental
description: Detects a suspicious DLL loading from AppData Local path as described in BlueMushroom report
references:
    - 'https://www.virusbulletin.com/conference/vb2019/abstracts/apt-cases-exploiting-vulnerabilities-region-specific-software'
tags:
    - attack.defense_evasion
    - attack.t1117
author: Florian Roth
date: 2019/10/02
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*\regsrv32*\AppData\Local\*,*'
    condition: selection
falsepositives:
    - Unlikely
level: critical
