title: Password Cracking with Hashcat
id: 39b31e81-5f5f-4898-9c0e-2160cfc0f9bf
status: experimental
description: Execute Hashcat.exe with provided SAM file from registry of Windows and Password list to crack against
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat
author: frack113
date: 2021/12/27
logsource:
    category: process_creation
    product: windows
detection:
    hashcat_basic:
        Image|endswith: \hashcat.exe 
    hashcat_option:
        CommandLine|contains|all:
            - '-a '
            - '-m '
            - '-r '
    condition: 1 of hashcat_*
falsepositives:
    - unknown
level: high
tags:
    - attack.credential_access
    - attack.t1110.002