title: Password Provided In Command Line Of Net.exe
id: d4498716-1d52-438f-8084-4a603157d131
status: experimental
description: Detects a when net.exe is called with a password in the command line
references:
    - Internal Research
author: Tim Shelton (HAWK.IO)
date: 2021/12/09
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image: C:\Windows\System32\net.exe
    selection2:
        Command|re: 'net(.exe)*\s+use\s+[a-zA-Z]\:\s+\\\\[^\s]+\s+\/USER:\s*[^\s]+\s+([^\s]+)'
    condition: all of selection*
falsepositives:
    - Unknown
level: high
