title: Suspicious Code Page Switch
status: experimental
description: Detects a code page switch in command line or batch scripts to a rare language
author: Florian Roth
date: 2019/10/14
references:
    - https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
    - https://twitter.com/cglyer/status/1183756892952248325
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\chcp.com'
        CommandLine: 
            - '* 936'  # Chinese
            - '* 1256' # Arabic
            - '* 1258' # Vietnamese
            - '* 855'  # Russian
            - '* 866'  # Russian
            - '* 864'  # Arabic
    condition: selection
fields:
    - ParentCommandLine
falsepositives:
    - Administrative activity of foreign staff
level: medium
