title: Procdump Usage
id: 03795938-1387-481b-9f4c-3f6241e604fe
description: Detects uses of the SysInternals Procdump utility
status: experimental
references:
    - Internal Research
author: Florian Roth
date: 2021/08/16
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
            - '\procdump.exe'
            - '\procdump64.exe'
    selection2:
        CommandLine|contains|all:
            - ' -ma '
            - '.exe'
    condition: selection1 or selection2
falsepositives:
    - Legitimate use of procdump by a developer or administrator
level: medium
