title: MS Teams Download and Execute
id: aa3a6f94-890e-4e22-b634-ffdfd54792cb
status: experimental
description: Detects the use of MS Teams Living off the Land download and execute
author: Tim Shelton
date: 2022/01/12
modified: 2022/01/12
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\Microsoft\Teams\Update.exe'
        CommandLine|contains: '--processStart'
    condition: selection
fields:
    - Image
    - CommandLine
falsepositives:
    - unknown
level: high
references:
    - https://twitter.com/misconfig/status/1481198346379436035
