title: Javaw Spawning Suspicious Powershell Commands
id: a0ec945f-2328-40e9-96f6-27dadf72861b
status: experimental
description: Detects Javaw spawning suspicious powershell commands. This has been observed as possible post-exploitation activity of Cleo software.
author: Chad Hudson, Matt Anderson
references:
    - https://www.huntress.com/blog/threat-advisory-oh-no-cleo-cleo-software-actively-being-exploited-in-the-wild
date: 2024-12-09
tags:
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage|endswith: '\javaw.exe'
        Image|endswith: '\cmd.exe'
    cmdline:
        CommandLine|contains:
            - ' -nop'
            - ' -noni'
            - ' -NonInteractive'
            - ' -w hidden '
            - ' -windowstyle hidden*'
            - '(New-Object Net.WebClient).Download*'
            - ' -enc '
            - ' -EncodedCommand '
    powershell:
        CommandLine|contains: powershell
    condition: selection and cmdline and powershell
falsepositives:
    - Legitimate software may also use these commands
level: high
