title: Suspicious Csi.exe Usage 
id: 40b95d31-1afc-469e-8d34-9a3a667d058e
description: Csi.exe is a signed binary from Microsoft that comes with Visual Studio and provides C# interactive capabilities. It can be used to run C# code from a file passed as a parameter in command line. Early version of this utility provided with Microsoft “Roslyn” Community Technology Preview was named 'rcsi.exe'
status: experimental
author: Konstantin Grishchenko, oscd.community
date: 2020/10/17
modified: 2021/05/11
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Csi.yml
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Rcsi.yml
    - https://enigma0x3.net/2016/11/21/bypassing-application-whitelisting-by-using-rcsi-exe/
    - https://twitter.com/Z3Jpa29z/status/1317545798981324801
tags:
    - attack.execution
    - attack.t1072
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    basic:
        - Image|endswith: '\csi.exe'
        - Image|endswith: '\rcsi.exe'
    renamed:    
        - OriginalFileName: 'csi.exe'
        - OriginalFileName: 'rcsi.exe'
    selection:    
        Company: 'Microsoft Corporation'
    condition: (basic or renamed) and selection
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine    
falsepositives:
    - Legitimate usage by software developers 
level: medium
