title: Create Remote Process via WMIC
description: Detects suspicious process created by WMIC remotely
status: experimental
reference: 
    - https://car.mitre.org/wiki/CAR-2016-03-002
author: juju4
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*\wmic.exe*'
            - '* process call create *'
            - '* /node:*'
    condition: selection
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
level: medium
