title: Suspicious Csc.exe Source File Folder 
description: Detects a suspicious execution of csc.exe, which uses a source in a suspicious folder (e.g. AppData)
status: experimental
references:
    - https://securityboulevard.com/2019/08/agent-tesla-evading-edr-by-removing-api-hooks/
    - https://app.any.run/tasks/c6993447-d1d8-414e-b856-675325e5aa09/
author: Florian Roth
date: 2019/08/24
tags:
    - attack.defense_evasion
    - attack.t1500
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\csc.exe'
        CommandLine: '*\AppData\*'
    condition: selection
falsepositives:
    - Unkown
level: high
