title: Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)
description: Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)
status: experimental
references:
  - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm
author: Thomas Patzke
tags:
  - attack.credential_access
  - attack.t1003
detection:
  selection:
    CommandLine: '*\ntdsutil.exe *'
  condition: selection
falsepositives:
  - NTDS maintenance
level: high
logsource:
  category: process_creation
  product: windows
