title: Bypassing Application Whitelisting by using dnx.exe
status: experimental
description:  Execute C# code located in the consoleapp folder
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Csi.yml
    - https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/
author: Beyu Denis
date: 2019/10/26
tags:
    - attack.persistence
level: medium
logsource:
    category: process_creation
    product: windows
detection:
  selection:
    Image: '*\dnx.exe'
  condition: selection
falsepositives:
    - Unknown
