title: Execution via Diskshadow.exe 
id: 0c2f8629-7129-4a8a-9897-7e0768f13ff2
status: experimental
description: Detects using Diskshadow.exe to execute arbitrary code in text file
references:
    - https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
tags:
    - attack.execution
    - attack.t1218
author: Ivan Dyachkov, oscd.community
date: 2020/10/07  
logsource:
    category: process_creation 
    product: windows            
    definition: 'Requirements: Sysmon ProcessCreation logging must be activated and Windows audit msut Include command line in process creation events'
detection:
    selection:
        Image|endswith: '\diskshadow.exe'
        CommandLine|contains:
            - '/s'
            - '-s'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - False postitve can be if administrators use diskshadow tool in their infrastructure as a main backup tool with scripts.
level: high
