title: BYPASSING APPLICATION WHITELISTING WITH BGINFO
status: experimental
description: Execute VBscript code that is referenced within the *.bgi file.
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Bginfo.yml
    - https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/
author: Beyu Denis
date: 2019/10/26
tags:
    - attack.persistence
    - attack.T1218
level: medium
logsource:
    category: process_creation
    product: windows
detection:
  selection:
    Image: '*\bginfo.exe'
    CommandLine: '* /popup /nolicprompt'
  condition: selection
falsepositives:
    - Unknown

