title: Suspicious Bitsadmin Job via PowerShell
status: experimental
description: Detect download of BITS jobs via PowerShell.
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/ec5180c9-721a-460f-bddc-27539a284273.html
author: Endgame, JHasenbusch (ported to sigma for oscd.community)
date: 2018/30/11
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1197
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*powershell.exe *Start-BitsTransfer*'
    condition: selection
falsepositives:
    - Unknown
level: medium
