title: SAM Dumping via Reg.exe
status: experimental
description: Identifies usage of reg.exe to export registry hives which contain the SAM and LSA secrets.
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/aed95fc6-5e3f-49dc-8b35-06508613f979.html
author: Endgame, JHasenbusch (ported to sigma for oscd.community)
date: 2018/30/11
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image: '*\reg.exe'
        CommandLine: 
            - '* save *'
            - '* export *'
    selection2:
        CommandLine:
            - '*hklm*'
            - '*hkey_local_machine*'
    selection3:
        CommandLine:
            - '*\\sam *'
            - '*\\security *'
            - '*\\system *'
    condition: selection1 and selection2 and selection3
falsepositives:
    - Unknown
level: low
