title: Imports Registry key from a file
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
status: experimental
description: Imports the specified file to the registry.
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8
tags:
    - attack.t1112
    - attack.defense_evasion
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/07
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\regedit.exe'
        CommandLine|contains:
            - ' /i '
            - '.reg'
    filter:
        CommandLine|contains:
                - ' /e '
                - ' /a '
                - ' /c '
    condition: selection and not filter
fieds:
    - ParentImage
    - CommandLine
falsepositives:
    - Legitimate import of keys
level: medium