title: Possible Applocker Bypass
description: Detects execution of executables that can be used to bypass Applocker whitelisting
status: experimental
references:
    - https://github.com/subTee/ApplicationWhitelistBypassTechniques/blob/master/TheList.txt
    - https://room362.com/post/2014/2014-01-16-application-whitelist-bypass-using-ieexec-dot-exe/
    - https://twitter.com/monoxgas/status/895045566090010624
    - https://twitter.com/0rbz_/status/912530504871759872
    - https://twitter.com/KyleHanslovan/status/914800377580503040
    - https://gist.github.com/api0cradle/8cdc53e2a80de079709d28a2d96458c2
    - https://github.com/api0cradle/UltimateAppLockerByPassList/blob/master/README.md
    - https://www.hexacorn.com/blog/2017/10/04/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline-part-2/
    - https://www.hexacorn.com/blog/2017/10/22/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline-part-3/
    - https://twitter.com/mattifestation/status/930821225311555584
author: juju4
tags:
    - attack.defense_evasion
    - attack.t1118
    - attack.t1121
    - attack.t1127
    - attack.t1170
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*\msdt.exe*'
            - '*\installutil.exe*'
            - '*\regsvcs.exe*'
            - '*\regasm.exe*'
            - '*\regsvr32.exe*'
            - '*\msbuild.exe*'
            - '*\ieexec.exe*'
            - '*\mshta.exe*'
            # higher risk of false positives
#            - '*\cscript.EXE*'
            - '*\SyncAppvPublishingServer.exe*'
            - '*\pcalua.exe*-a*'
            - '*\scriptrunner.exe*-appvscript*'
            - '*\sqldumper.exe*'
            - '*\hh.exe*'
            - '*\AppVLP.exe*'
            - '*\bginfo.exe*.bgi*'
            - '*\presentationhost.exe*'
            - '*\cdb.exe*'
            - '*\dnx.exe*'
            - '*\rcsi.exe*'
            - '*\csi.exe*'
            - '*\control.exe*'
            - '*\msxsl.exe*'
            - '*\cmstp.exe*'
            - '*\xwizard.exe*'
            - '*\fsi.exe*'
            - '*\odbcconf.exe*'
            - '*\odbcad32.exe*'
            - '*\WinMail.exe*'
            - '*\java.exe*-agentlib*'
            - '*\java.exe*-agentpath*'
            - '*\stubapp.exe*-i*'
            - '*\stordiag.exe**'
    condition: selection
falsepositives:
    - False positives depend on scripts and administrative tools used in the monitored environment
    - Using installutil to add features for .NET applications (primarly would occur in developer environments)
level: low
