title: ODBCCONF execution dll
status: experimental
author: Kirill Kiryanov, oscd.community
description: Detect possible execution by odbcconf
date: 2019/10/23
references: 
  - https://twitter.com/Hexacorn/status/1187143326673330176
fields:
  - CommandLine
  - Details
falsepositives: Unknown
level: high
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage: '*\odbcconf.exe'
    CommandLine: '*\rundll32*'
  selection1:
    Image: '*\rundll32.exe'
    CommandLine: '*exe'
  condition: selection and selection1
