title: Impacket Lateralization Detection
id: 10c14723-61c7-4c75-92ca-9af245723ad2
status: experimental
description: Detects wmiexec/dcomexec/atexec/smbexec from Impacket framework
references:
  - https://github.com/SecureAuthCorp/impacket/blob/master/examples/wmiexec.py
  - https://github.com/SecureAuthCorp/impacket/blob/master/examples/atexec.py
  - https://github.com/SecureAuthCorp/impacket/blob/master/examples/smbexec.py
  - https://github.com/SecureAuthCorp/impacket/blob/master/examples/dcomexec.py
author: Ecco
date: 2019/09/03
logsource:
  category: process_creation
  product: windows
detection:
  selection_other:
    ParentImage:
      - '*\wmiprvse.exe'
      - '*\mmc.exe'
      - '*\explorer.exe'
      - '*\services.exe'
    CommandLine:
      - '*cmd.exe* /Q /c * \\\\127.0.0.1\\*&1*'
  selection_atexec:
    ParentCommandLine:
      - '*svchost.exe -k netsvcs'
      - taskeng.exe*
    CommandLine:
      - cmd.exe /C *Windows\\Temp\\*&1
  condition: (1 of selection_*)
fields:
  - CommandLine
  - ParentCommandLine
tags:
  - attack.lateral_movement
  - attack.t1175
  - attack.t1047
falsepositives:
  - pentesters
level: critical
