title: Uninstall Sysinternals Sysmon 
id: 6a5f68d1-c4b5-46b9-94ee-5324892ea939
status: experimental
description: Uninstall Sysinternals Sysmon for Defense Evasion
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-11---uninstall-sysmon
author: frack113
date: 2022/01/12
logsource:
    category: process_creation
    product: windows
detection:
    sysmon:
        Image|endswith: 
            - \Sysmon64.exe
            - \Sysmon.exe
        CommandLine|contains: '-u'
    condition: sysmon
falsepositives:
    - unknown
level: high
tags:
    - attack.defense_evasion
    - attack.t1562.001