action: global
title: SyncAppvPublishingServer Execution to Bypass Powershell Restriction
description: Detects SyncAppvPublishingServer process execution which usually utilized by adversaries to bypass PowerShell execution restrictions.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
author: 'Ensar Şamil, @sblmsrsn, OSCD Community'
date: 2020/10/05
tags:
    - attack.defense_evasion
    - attack.t1218
detection:
    condition: selection
falsepositives:
    - App-V clients
level: medium
---
id: fde7929d-8beb-4a4c-b922-be9974671667
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\SyncAppvPublishingServer.exe'
---
id: 9f7aa113-9da6-4a8d-907c-5f1a4b908299
logsource:
    product: windows
    service: powershell
detection:
    selection:
        - 'SyncAppvPublishingServer.exe'