title: Application Whitelisting bypass via dxcap.exe
status: experimental
description: Detects execution of of Dxcap.exe
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Dxcap.yml
    - https://twitter.com/harr0ey/status/992008180904419328
author: Beyu Denis, oscd.community
date: 2019/10/26
modified: 2019/11/04
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
level: medium
logsource:
    category: process_creation
    product: windows
detection:
  selection:
    Image: '*\dxcap.exe'
    CommandLine|contains|all:
        - '-c'
        - '.exe'
  condition: selection
falsepositives:
    - Legitimate execution of dxcap.exe by legitimate user
