title: Invoke-Obfuscation WMIC LAUNCHER
id: 802bc991-83da-421c-a092-4abf83b70148
description: Detects Obfuscated Powershell via WMIC LAUNCHER
status: experimental
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
references:
    - https://github.com/Neo23x0/sigma/issues/1009 #(Task 22)
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - CommandLine|re: '(?i).*wmic(?:\.exe)?(?:\s+)?(?:"|')?process(?:"|')?.*call.*create.*powershell'
    condition: selection
falsepositives:
    - Unknown
level: medium 