title: Execute Code with Pester.bat
id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for testing) 
status: experimental
references:
    - https://twitter.com/Oddvarmoe/status/993383596244258816
author: Julia Fomina, oscd.community
date: 2020/10/07
tags:
    - attack.defense_evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    selection_powershell:
        Image|endswith: '\poweshell.exe'
        CommandLine|contains|all:
            - 'Pester'
            - 'Get-Help*;'
    selection_cmd:
        Image|endswith: '\cmd.exe'
        CommandLine|contains: 'Pester.bat*;'
    selection_cmd_help:
        CommandLine|contains:
            - '/help'
            - '/?'
            - '-?'
    condition: selection_powershell or (selection_cmd and selection_cnd_help)
level: medium
falsepositives:
    - Legitimate use of Pester for writing tests for Powershell scripts and modules
