title: Processes created by MMC
status: experimental
description: Processes started by MMC could be a sign of lateral movement.
references:
    - https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
tags:
    - attack.lateral_movement
    - attack.t1175
    - car.2013-02-003
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage: '*\mmc.exe'
    exclusion:
        Image: 
            - 'C:\Windows\System32\mmc.exe'
            - 'C:\Windows\System32\certreq.exe'
    condition: selection and not exclusion
fields:
    - Image
    - CommandLine
    - ParentCommandLine
level: medium
