title: WinRM Spawning Process
id: 08acc8ae-d65a-44b2-9d12-3cd319772d30
status: experimental
description: Detects WinRM (wsmprovhost.exe) spawning suspicious process. This rule is related to potential exploitation of CVE-2021-31166 which is a kernel-mode device driver http.sys vulnerability
references:
    - https://www.zerodayinitiative.com/blog/2021/5/17/cve-2021-31166-a-wormable-code-execution-bug-in-httpsys
author: Sittikorn S
date: 2021/06/22
tags:
    - attack.privilege_escalation
    - attack.t1190
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        ParentImage|endswith: 
            - '\wsmprovhost.exe'
        Image|contains:
            - '\cmd.exe'
            - '\sh.exe'
            - '\bash.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\schtasks.exe'
            - '\certutil.exe'
            - '\whoami.exe'
            - '\bitsadmin.exe'
            - '\scp.exe'
    condition: selection
falsepositives:
    - Legitimate WinRM usage
level: high
