title: PurpleSharp Indicator
id: ff23ffbc-3378-435e-992f-0624dcf93ab4
status: experimental
description: Detect
author: Florian Roth
date: 2021/06/18
modified: 2021/07/06
references:
    - https://github.com/mvelazc0/PurpleSharp
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains:
            - xyz123456.exe
            - PurpleSharp
    selection2:
        OriginalFileName: 
            - 'PurpleSharp.exe'
    condition: selection1 or selection2
falsepositives:
    - Unlikely
level: critical
tags:
    - attack.t1587
    - attack.resource_development