title: COM Hijack via Registry CLSID
id: f1aa7b7a-2815-4cc3-9c17-keys-com-hijack
description: Detects potential COM hijacking via suspicious CLSID entries pointing to attacker-controlled binaries
status: experimental
author: Skyler “Keys” Piatiak (@vVv-Keys)
date: 2025/06/19
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    TargetObject|contains:
      - 'Software\\Classes\\CLSID\\'
    Details|endswith:
      - '.exe'
      - '.dll'
    Details|contains:
      - 'Users\\'
      - 'Temp\\'
      - 'AppData\\'
  condition: selection
falsepositives:
  - Misconfigured but legitimate COM entries
level: high
tags:
  - attack.persistence
  - attack.t1546.015
  - sigma-contrib
