title: OpenWith.exe executes specified binary
status: experimental
description: The OpenWith.exe executes other binary
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Openwith.yml
    - https://twitter.com/harr0ey/status/991670870384021504
author: Beyu Denis, oscd.community (rule), harr0ey (idea)
date: 2019/10/12
tags:
    - attack.persistence
    - attack.t1218
level: critical
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*OpenWith.exe'
        CommandLine: '*/c*'
    condition: selection
falsepositives:
    - Unknown

