title: Proxy execution via explorer.exe
id: 9eb271b9-24ae-4cd4-9465-19cfc1047f3e
description: Attackers can use explorer.exe for evading defense mechanisms
author: 'Furkan CALISKAN, @caliskanfurkan_, OSCD Community'
status: experimental
date: 10/02/2020
references:
    - https://twitter.com/bohops/status/1276356245541335048
    - https://twitter.com/CyberRaiju/status/1273597319322058752
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
            - \explorer.exe
        CommandLine|contains:
            - /root
    selection2:
        Image|endswith:
            - \explorer.exe
        ParentImage|endswith:
            - \cmd.exe
        CommandLine|contains:
            - explorer.exe
    condition: selection1 or selection2
falsepositives:
    - Unknown
level: medium
