title: Command-Line Creation of a RAR file
description: Identifies use of various commands to query a remote system’s time. This technique may be used before executing a scheduled task or to discover the time zone of a target system.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame)
date: 2019/10/24
tags:
    - attack.discovery
    - attack.t1124
detection:
    selection1:
        Image:
            - '*net.exe'
        CommandLine:
            - '* time *'
    selection2:
        CommandLine:
            - '*\\\*'
    condition: selection1 and selection2
falsepositives:
    - legit admin usage
level: high
logsource:
    category: process_creation
    product: windows
