title: Environment Discovery Using AdFind
id: 72be847f-9c5c-47c6-9cfe-510f5947075e
description: Detects the use of the AdFind tool for discovery purposes
author: Jonhnathan Ribeiro
references:
    - https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/master/fin6/Emulation_Plan/Phase1.md
    - http://www.joeware.net/freetools/tools/adfind/
date: 2020/09/15
tags:
    - attack.discovery
    - attack.t1087.002
    - attack.t1018
    - attack.t1482
    - attack.t1016
    - attack.t1069.002
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains: 
          - "-f"
    selection2:
        CommandLine|contains:
          - "objectcategory=person"
          - "objectcategory=computer"
          - "objectcategory=organizationalUnit"
          - "objectcategory=subnet"
          - "objectcategory=group"
    selection3:
        CommandLine|contains:
          - "trustdmp"
    condition: selection1 and selection2 or selection3
falsepositives:
    - 'Legitimate administration activity'
level: high
