title: Command-Line Creation of a RAR file
description: Detect compression of data into a RAR file using the rar.exe utility.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame)
date: 2019/10/24
tags:
    - attack.exfiltration
    - attack.t1002
detection:
    selection:
        Image:
            - '*rar.exe'
        CommandLine:
            - '* a *'
    condition: selection
falsepositives:
    - legit creation of a rar file using cmd
level: high
logsource:
    category: process_creation
    product: windows
