title: PsExec Service Start
id: 3ede524d-21cc-472d-a3ce-d21b568d8db7
status: test
description: Detects a PsExec service start
author: Florian Roth
date: 2018/03/13
modified: 2021/11/27
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine: C:\Windows\PSEXESVC.exe
  condition: selection
falsepositives:
  - Administrative activity
level: low
tags:
  - attack.execution
  - attack.s0029
  - attack.t1569.002
