title: Non Interactive PowerShell
id: f4bbd493-b796-416e-bbf2-121235348529
description: Detects non-interactive PowerShell activity by looking at powershell.exe with not explorer.exe as a parent.
status: experimental
date: 2019/09/12
modified: 2021/05/10
author: Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)
references:
    - https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
tags:
    - attack.execution
    - attack.t1086          # an old one
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
    filter:
        ParentImage|endswith: 
            - '\explorer.exe'
            - '\CompatTelRunner.exe'
    condition: selection and not filter
falsepositives:
    - Legitimate programs executing PowerShell scripts
level: low
