title: ShimCache Flush
id: b0524451-19af-4efa-a46f-562a977f792e
status: experimental
description: Detects actions that clear the local ShimCache and remove forensic evidence
references:
    - https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
tags:
    - attack.defense_evasion
    - attack.t1112
author: Florian Roth
date: 2021/02/01
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|contains|all:
            - 'rundll32'
            - 'apphelp.dll'
            - 'ShimFlushCache'
    selection2:
        CommandLine|contains|all:
            - 'rundll32'
            - 'kernel32.dll'
            - 'BaseFlushAppcompatCache'
    condition: selection1 or selection2
fields:
    - Image
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: critical
