title: Possible App Whitelisting Bypass via WinDbg/CDB as a Shellcode Runner
id: b5c7395f-e501-4a08-94d4-57fe7a9da9d2
status: test
description: Launch 64-bit shellcode from a debugger script file using cdb.exe.
author: Beyu Denis, oscd.community
references:
  - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Cdb.yml
  - http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html
date: 2019/10/26
modified: 2021/11/27
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\cdb.exe'
    CommandLine|contains: '-cf'
  condition: selection
falsepositives:
  - Legitimate use of debugging tools
level: medium
tags:
  - attack.execution
  - attack.t1106
  - attack.defense_evasion
  - attack.t1218
  - attack.t1127
