title: Stop windows service
description: Detects a windows service to be stopped
status: experimental
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
modified: 2019/11/08
tags:
    - attack.impact
    - attack.t1489
detection:
    selection:
      - Image|endswith: '\taskkill.exe'
      - Image|endswith:
            - '\sc.exe'
            - '\net.exe'
            - '\net1.exe'
        CommandLine|contains: 'stop'
    condition: selection
falsepositives:
    - Administrator shutting down the service due to upgrade or removal purposes
level: low
logsource:
    category: process_creation
    product: windows
