title: Packet capture Windows command prompt
status: experimental
description: Detects packet capture via netsh trace functionality
references:
    - https://blogs.msdn.microsoft.com/canberrapfe/2012/03/30/capture-a-network-trace-without-installing-anything-capture-a-network-trace-of-a-reboot/
author: Kutepov Anton, oscd.community
date: 2019/10/24
tags:
    - attack.network_sniffing
    - attack.t1040
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: netsh* trace* start*           
    condition: selection    
falsepositives: 
    - Legitimate administration
level: medium
