title: Clearing Windows Event Logs with wevtutil
description: Identifies attempts to clear Windows event logs with the command wevtutil.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame)
date: 2019/10/24
tags:
    - attack.defense_evasion
    - attack.t1070
detection:
    selection:
        Image:
            - '*wevtutil.exe'
        CommandLine:
            - '* cl *'
    condition: selection
falsepositives:
    - unknown
level: high
logsource:
    category: process_creation
    product: windows
