title: WMI Backdoor Exchange Transport Agent
id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
status: experimental
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
author: Florian Roth
date: 2019/10/11
references:
    - https://twitter.com/cglyer/status/1182389676876980224
    - https://twitter.com/cglyer/status/1182391019633029120
logsource:
    category: process_creation
    product: windows
tags:
    - attack.persistence
    - attack.t1546.003
    - attack.t1084      # an old one
detection:
    selection:
        ParentImage|endswith: '\EdgeTransport.exe'
    condition: selection
falsepositives:
    - Unknown
level: critical

