title: HH.exe execution
description: Identifies usage of hh.exe executing recently modified .chm files.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Dan Beavin)
date: 2019/10/24
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1223
detection:
    selection:
        Image:
            - '*hh.exe'
        CommandLine:
            - '* .chm*'
    condition: selection
falsepositives:
    - unlike
level: high
logsource:
    category: process_creation
    product: windows
