title: Direct Run key modification
description: Detects direct Run key modification for persistence using reg.exe.
status: test
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1060/T1060.yaml
tags:
    - attack.persistence
    - attack.t1060
date: 2019/10/25
modified: 2019/10/25
author: Victor Sergeev, oscd.community
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image:
            - '*\reg.exe'
        CommandLine:
            - '*add*Microsoft\Windows\CurrentVersion\Run*'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Admin scripts
level: high