title: Suspicious Csc.exe Source File Folder 
description: Detects a suspicious execution of csc.exe, which uses a source in a suspicious folder (e.g. AppData)
status: experimental
references:
    - https://blog.talosintelligence.com/2019/08/china-chopper-still-active-9-years-later.html
author: Florian Roth
date: 2019/08/24
tags:
    - attack.defense_evasion
    - attack.t1500
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\MSBuild.exe'
        CommandLine: 
          - '*\AppData\*'
          - '*\Windows\Temp\*'
    condition: selection
falsepositives:
    - Unkown
level: high
