title: PowerShell Get-Process LSASS
id: b2815d0d-7481-4bf0-9b6c-a4c48a94b349
description: Detects a Get-Process command on lsass process, which is in almost all cases a sign of malicious activity
status: experimental
references:
    - https://twitter.com/PythonResponder/status/1385064506049630211
author: Florian Roth
date: 2021/04/23
tags:
    - attack.credential_access
    - attack.t1552.004
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'Get-Process lsass'
    condition: selection
falsepositives: 
    - Unknown
level: high
