title: Suspicious Scheduled Task Creation in Microsoft Folder
id: 17347f6c-f498-49fa-94e3-ea56a043ed8b
status: experimental
description: Detects the creation of scheduled tasks within the Microsoft Windows folder
author: Florian Roth
date: 2021/03/11
reference:
    - https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains|all: 
            - ' /create '
            - '\Microsoft\Windows\'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
tags:
    - attack.execution
    - attack.persistence
    - attack.t1053.005
falsepositives:
    - Administrative activity
    - Software installation
level: high
