title: Suspicious DLL loaded via ExtExport
id: b0ad151d-46bd-4fcc-b8ad-9bc61731cb18
status: experimental
description: ExtExport.exe is a utility that comes bundled with Internet Explorer that looks and loads DLLs.
author: Ilyas Ochkov, oscd.community
date: 2020/10/18
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Extexport.yml
    - https://hunternotes.com/hunt-on-astaroth/
    - https://isc.sans.edu/diary/Guildma+malware+is+now+accessing+Facebook+and%A0YouTube+to+keep+up-to-date/25222
    - https://labs.f-secure.com/blog/attack-detection-fundamentals-code-execution-and-persistence-lab-1/
tags:
    - attack.defense_evasion
    - attack.t1574.002
    - attack.t1218
level: medium
fields:
    - CommandLine
    - Image
    - ParentImage
    - ImageLoaded
logsource:
    category: process_creation
    product: windows
detection:
    ExtExport_run_dll_with_susp_path_1:
        Image|endswith:
            - '\ExtExport.exe'
        CommandLine|contains:   # several articles describe that ExtExport can only load this DLLs, but in fact it is not.
            - '\mozcrt19.dll'
            - '\mozsqlite3.dll'
            - '\sqlite3.dll'
            - '.dll ' # so i added this line. False positives are possible.               
        CommandLine|contains:
            - '\AppData\'
            - '\Users\'            
            - '\Temp\'
            - '\Tmp\'
    ExtExport_with_susp_image_path_1:
        Image|endswith:
            - '\ExtExport.exe'    
        Image|contains:
            - '\AppData\'
            - '\Users\'            
            - '\Temp\'
            - '\Tmp\'            	
    condition: ExtExport_run_dll_with_susp_path_1 or ExtExport_with_susp_image_path_1 or ExtExport_run_dll_with_susp_path_2 or ExtExport_with_susp_image_path_2
---
logsource:
    category: image_load
    product: windows
detection:            
    ExtExport_run_dll_with_susp_path_2:
        Image|endswith:
            - '\ExtExport.exe'      
        ImageLoaded|contains:
            - '\AppData\'
            - '\Users\'            
            - '\Temp\'
            - '\Tmp\'  
    ExtExport_with_susp_image_path_2:
        Image|endswith:
            - '\ExtExport.exe'
        Image|contains:
            - '\AppData\'
            - '\Users\'            
            - '\Temp\'
            - '\Tmp\'
