title: Suspicious netsh Dll persistence
description: Detects pesitence via netsh helper
status: test
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1060/T1060.yaml
tags:
    - attack.persistence
    - attack.t1060
date: 2019/10/25
modified: 2019/10/25
author: Victor Sergeev, oscd.community
logsource:
    category: process_creation
    product: windows   
detection:
    selection:
        Image:
            - '*\netsh.exe'
        CommandLine:
            - '*add*helper*'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unkown
level: high