title: Detect Virtualbox driver installation OR starting of VMs
status: Experimental
description: Adversaries can carry out malicious operations using a virtual instance to avoid detection.This rule is built to detect the registration of the Virtualbox driver or start of a Virtualbox VM.
references:
    -https://attack.mitre.org/techniques/T1564/006/
	-https://news.sophos.com/en-us/2020/05/21/ragnar-locker-ransomware-deploys-virtual-machine-to-dodge-security/
	-https://threatpost.com/maze-ransomware-ragnar-locker-virtual-machine/159350/
	
author: Janantha Marasinghe
date: 2020/09/26
tags:
    - attack.defense_evasion
    - attack.T1564.006
	  - attack.T1564
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains: 
            - 'VBoxRT.dll,RTR3Init'
            - 'VBoxC.dll'
			      - 'VBoxDrv.sys'
	  selection_2:
		CommandLine|contains:
            - 'startvm'
			      - 'controlvm'
  condition: selection_1 or selection_2
	
fields:
    - ComputerName
    - User
    - CommandLine
	- ParentCommandLine
falsepositives:
    - This may have false positives on hosts where Virtualbox is legitimately being used for operations
level: medium
