title: Detection of PowerShell Execution via SQL 
id: 0152550d-3a26-4efd-9f0e-54a0b28ae2f3  
status: experimental
description: PowerShell execution through builtin SQL Server "SQLPS.exe" binary. Microsoft PS logging like
  ScriptBlock logging function of PowerShell is not an option here, PS session caused by the binary won't be recorded/logged.
references:
  - https://twitter.com/pabraeken/status/993298228840992768
  - https://docs.microsoft.com/en-us/sql/tools/sqlps-utility?view=sql-server-ver15 
  - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqlps/
tags:
    - attack.execution
    - attack.t1059.001
author: Agro (@agro_sev)
date: 2020/10/10
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith: '\sqlps.exe'
    selection2:        
        ParentImage|endswith: '\sqlps.exe'
    selection3:
        OriginalFileName: '\sqlps.exe'
    condition: selection1 or selection2 or selection3
falsepositives:
    - Direct PS command execution through SQLPS.exe is uncommon.
level: medium 
