title: Devtoolslauncher.exe executes specified binary
status: experimental
description: The Devtoolslauncher.exe executes other binary
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Devtoolslauncher.yml
    - https://twitter.com/_felamos/status/1179811992841797632
author: Beyu Denis, oscd.community (rule), @_felamos (idea)
date: 2019/10/12
tags:
    - attack.persistence
    - attack.t1218
level: critical
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\devtoolslauncher.exe'
        CommandLine: '*LaunchForDeploy*'
    condition: selection
falsepositives:
    - Unknown

