title: Suspicious AdvancedRun Runas Priv User
id: fa00b701-44c6-4679-994d-5a18afa8a707
status: experimental
description: Detects the execution of AdvancedRun utitlity in the context of the TrustedInstaller or SYSTEM account 
references:
    - https://twitter.com/splinter_code/status/1483815103279603714
    - https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
    - https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/
    - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
author: Florian Roth
date: 2022/01/20
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains:
            - '/EXEFilename'
            - '/CommandLine'
    selection_runas:
        - CommandLine|contains: 
            - ' /RunAs 8 '
            - ' /RunAs 4 '
        - CommandLine|endswith: 
            - '/RunAs 8'
            - '/RunAs 4'
    condition: all of selection*
falsepositives:
    - Unknown
level: high
