title: Start From a Suspicious Folder
id: dca91cfd-d7ab-4c66-8da7-ee57d487b35b
status: experimental
description: Start from Desktop or temp folder
references:
    - Malware sandbox results
author: frack113
date: 2022/02/11
logsource:
    category: process_creation
    product: windows
detection:
    image:
        Image|contains:
            - '\Desktop\'
            - '\Temp\'
    condition: image
falsepositives:
    - unknown
level: low
tags:
    - attack.execution
    - attack.t1204
