title: Malicious payload download via Office binaries 
status: experimental
description: Downloads payload from remote server
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Powerpnt.yml
    - https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191
    - Reegun J (OCBC Bank)
author: Beyu Denis
date: 2019/10/26
tags:
    - attack.persistence
    - attack.T1105
level: medium
logsource:
    category: process_creation
    product: windows
detection:
  selection:
    Image: 
      - '*\powerpnt.exe'
      - '*\winword.exe'
    CommandLine: '* "http*'
  condition: selection
level: medium
falsepositives:
    - Unknown

