title: Windows Network Enumeration
status: stable
description: Identifies attempts to enumerate hosts in a network using the built-in Windows net.exe tool.
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html
author: Endgame, JHasenbusch (ported for oscd.community)
date: 2018/11/30
tags:
    - attack.discovery
    - attack.t1018
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: '*\net.exe'
        CommandLine: '* view*'
    filter:
        CommandLine: '*\\\\*'
    condition: selection and not filter
falsepositives:
    - unknown
level: low 
