title: Whoami Execution Anomaly
id: 8de1cbe8-d6f5-496d-8237-5f44a721c7a0
status: experimental
description: Detects the execution of whoami with suspicious parents or parameters
references:
    - https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
    - https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
author: Florian Roth
date: 2021/08/12
modified: 2021/08/26
tags:
    - attack.discovery
    - attack.t1033
    - car.2016-03-001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\whoami.exe'
    filter1:
        ParentImage|endswith: 
            - '\cmd.exe'
            - '\powershell.exe'
    filter2:
        ParentImage:
            - 'C:\Program Files\Microsoft Monitoring Agent\Agent\MonitoringHost.exe'
            - ''
    filter3:
        ParentImage: null
    selection_special:
        CommandLine|contains:
            - 'whoami -all'
            - 'whoami /all'
            - 'whoami.exe -all'
            - 'whoami.exe /all'
    condition: ( selection and not filter1 and not filter2 and not filter3 ) or selection_special
falsepositives:
    - Admin activity
    - Scripts and administrative tools used in the monitored environment
    - Monitoring activity
level: high
