title: Meterpreter or Cobalt Strike getsystem service start
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting a specific service starting
author: Teymur Kheirkhabarov
date: 2019/10/26
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
tags:
    - attack.privilege_escalation
    - attack.t1134
logsource:
    category: process_creation
    product: windows
detection:
    service_start:
        ParentImage: '*\services.exe'
    cmd_or_comspec:
        CommandLine:
            - '*cmd*'
            - '*COMSPEC*'
    getsystem_technique_1:
        CommandLine: '*/c echo * > \\.\pipe\*'      #%COMSPEC% /c echo 559891bb017 > \\.\pipe\5e120a
    getsystem_technique_2:
        CommandLine: '*rundll32*.dll,a /p:*'        #rundll32.exe C:\Users\test\AppData\Local\Temp\tmexsn.dll,a /p:tmexsn
    condition: service_start and ((cmd_or_comspec and getsystem_technique_1) or getsystem_technique_2)
falsepositives:
    - Penetration Test
    - Unknown
level: critical