title: Advanced IP Scanner 
id: bef37fa2-f205-4a7b-b484-0759bfd5f86f
status: experimental
description: Detects the use of Advanced IP Scanner. Seems to be a popular tool for ransomware groups.
references:
    - https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
    - https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
author: '@ROxPinTeddy'
date: 2020/05/12
tags:
    - attack.discovery
    - attack.t1046
logsource:
    category: process_creation
    product: windows
detection:
    selection:
       Image|contains: '\advanced_ip_scanner'
    condition: selection
falsepositives:
    - Legitimate administrative use
level: medium
