title: Reflective DLL Load via PowerShell
id: b5a774ae-2675-4269-a5f2-23a512312000
description: Detects reflective DLL injection behavior using PowerShell and Win32 API calls
status: experimental
author: Skyler “Keys” Piatiak (@vVv-Keys)
date: 2025/06/18
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'VirtualAlloc'
      - 'memcpy'
      - 'CreateThread'
      - 'kernel32'
      - 'DllImport'
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1055.001
  - sigma-contrib
