title: UAC Bypass Using ComputerDefaults
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
description: Detects the pattern of UAC Bypass using computerdefaults.exe (UACMe 59)
author: Christian Burkard
date: 2021/08/31
status: experimental
references:
    - https://github.com/hfiref0x/UACME
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        IntegrityLevel:
            - 'High'
            - 'System'
        Image: 'C:\Windows\System32\ComputerDefaults.exe'
    filter:
        ParentImage|contains:
            - ':\Windows\System32'
            - ':\Program Files'
    condition: selection and not filter
falsepositives:
    - Unknown
level: high
