title: Using Expand, Extrac32, Makecab Utilities to Copy Files
status: experimental
description: Expand.exe, Extrac32.exe, Makecab.exe expands one or more compressed update files and can also copy files. This rule detects the use this tools to copy files from/to external resources, as well as the use of alternate data streams (ADS).
author: Ilyas Ochkov, oscd.community
date: 2020/10/18
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Expand.yml
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Extrac32.yml
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Makecab.yml
tags:
    - attack.lateral_movement
    - attack.t1570
    - attack.defense_evasion
    - attack.t1564.004
level: medium
fields:
    - CommandLine
logsource:
    category: process_creation
    product: windows
detection:
    copy_from_external_srv_or_to_ADS:
        Image|endswith:
            - '\expand.exe'
            - '\extrac32.exe'
            - '\makecab.exe'
        CommandLine|re:
            - '.*( \\\\)|(\S+:[^\\\s]+).*' 	#include ' \\' or ':' and exclude ':\'
    condition: copy_from_external_srv_or_to_ADS
