title: Bloodhound Hack Tool
id: f376c8a7-a2d0-4ddc-aa0c-16c17236d962
description: Detects command line parameters used by Bloodhound hack tool
author: Florian Roth
references:
    - https://github.com/BloodHoundAD/BloodHound
date: 2019/12/20
tags:
    - attack.discovery
    - attack.t1087
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: ' -CollectionMethod All '
    condition: selection
falsepositives:
    - Other programs that use these command line option and accepts an 'All' parameter
level: critical
