title: Suspicious Execution of InstallUtil Without Log 
id: d042284c-a296-4988-9be5-f424fadcc28c
status: experimental
description: Uses the .NET InstallUtil.exe application in order to execute image without log
author: frack113
references:
    - https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/
    - https://docs.microsoft.com/en-us/dotnet/framework/tools/installutil-exe-installer-tool
date: 2022/01/23
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: \InstallUtil.exe
        Image|contains: Microsoft.NET\Framework64\
        Commandline|contains|all:
            - '/logfile= '
            - '/LogToConsole=false'
    condition: selection
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense_evasion
