title: Net.exe User Account Creation
status: experimental
description: Identifies creation of local users via the net[1].exe command.
references:
    - https://eqllib.readthedocs.io/en/latest/analytics/014c3f51-89c6-40f1-ac9c-5688f26090ab.html
author: Endgame, JHasenbusch (adapted to sigma for oscd.community)
date: 2018/30/11
tags:
    - attack.persistance
    - attack.credential_access
    - attack.1136
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '*\net*.exe * user */ad*'
    condition: selection
falsepositives:
    - Legit user creation
level: low
