title: Bypass UAC via CMSTP
description: Detect child processes of automatically elevated instances of Microsoft Connection Manager Profile Installer (cmstp.exe).
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame)
date: 2019/10/24
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1191
    - attack.t1088
detection:
    selection:
        Image:
            - "*\\cmstp.exe"
        CommandLine:
            - "* /s *"
            - "* /au *"
    condition: selection
falsepositives:
    - unlikely
level: high
logsource:
    category: process_creation
    product: windows
