title: Suspicious Use Finger.exe
id: 248f5697-2f46-4005-9bb6-b4fc643332a9
status: experimental
description: finger.exe for data exfiltration or download file
references:
    - http://hyp3rlinx.altervista.org/advisories/Windows_TCPIP_Finger_Command_C2_Channel_and_Bypassing_Security_Software.txt
author: omkar72, oscd.community
date: 2020/10/11
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.command_and_control
    - attack.t1071
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\finger.exe'
    condition: selection
falsepositives:
    - Unknown
level: medium