title: Renamed Powershell
id: 8a1304fa-bda6-4a75-991e-f1dceede7dc2
description: Detects renamed powershell
status: experimental
references:
  - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
author: Teymur Kheirkhabarov, Harish Segar (rule)
date: 2020/03/21
tags:
  - attack.execution
  - attack.t1086
logsource:
  category: process_creation
  product: windows
detection:
  selection1:
    - Description: "Windows PowerShell"
    - Product: "PowerShell Core 6"
  filter:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'

  condition: 1 of selection2 and not filter
falsepositives:
  - unknown
level: low
