title: Netsh Port Forwarding
id: 322ed9ec-fcab-4f67-9a34-e7c6aef43614
description: Detects netsh commands that configure a port forwarding
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
date: 2019/01/29
modified: 2021/01/06
tags:
    - attack.lateral_movement
    - attack.defense_evasion
    - attack.command_and_control
    - attack.t1090
status: experimental
author: Florian Roth, omkar72, oscd.community
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith: '\netsh.exe'
        CommandLine|contains|all:
            - 'interface'
            - 'portproxy'
            - 'add'
            - 'v4tov4'
    selection2:
        Image|endswith: '\netsh.exe'
        CommandLine|contains|all:
            - 'connectp'
            - 'listena'
            - 'c='
    condition: selection1 or selection2
falsepositives:
    - Legitimate administration
level: medium
