title: CrackMapExec Command Execution
id: 058f4380-962d-40a5-afce-50207d36d7e2
status: experimental
description: Detect various execution methods of the CrackMapExec pentesting framework
references:
  - https://github.com/byt3bl33d3r/CrackMapExec
tags:
  - attack.execution
  - attack.t1047
  - attack.t1053
  - attack.t1059
author: Thomas Patzke
date: 2020/05/22
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine:
      - '*cmd.exe /Q /c * 1> \\\\*\\*\\* 2>&1'
      - '*cmd.exe /C * > \\\\*\\*\\* 2>&1'
      - '*cmd.exe /C * > *\\Temp\\* 2>&1'
      - '*powershell.exe -exec bypass -noni -nop -w 1 -C "*'
      - '*powershell.exe -noni -nop -w 1 -enc *'
  condition: selection
fields:
  - ComputerName
  - User
  - CommandLine
falsepositives:
  - Unknown
level: high
