title: Suspicious service path modification
description: Detects service path modification to powershell/cmd
status: test
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1031/T1031.yaml
tags:
    - attack.persistence
    - attack.t1031
date: 2019/10/21
modified: 2019/10/21
author: Victor Sergeev, oscd.community
logsource:
    category: process_creation
    product: windows   
detection:
    selection:
        Image:
            - '*\sc.exe'
        CommandLine:
            - '*config*binpath*powershell*'
            - '*config*binpath*cmd*'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high