title: LockerGoga Ransomware
description: Detects a command that clears the WMI trace log which indicates LockaerGoga ransomware activity
references:
    - https://abuse.io/lockergoga.txt
author: Florian Roth
date: 2019/03/22
tags:
    - attack.execution
    - attack.t1064    
level: high
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine: '* cl Microsoft-Windows-WMI-Activity/Trace'
    condition: selection

