title: Delete Volume USN Journal with fsutil
description: Identifies use of the fsutil command to delete the volume USNJRNL. This technique is used by attackers to eliminate evidence of files created during post-exploitation activities.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame)
date: 2019/10/24
tags:
    - attack.defense_evasion
    - attack.t1070
detection:
    selection1:
        Image:
            - '*fsutil.exe'
        CommandLine:
            - '*usn*'
    selection2:
        CommandLine:
            - '* deletejournal*'
    condition: selection1 and selection2
falsepositives:
    - unknown
level: high
logsource:
    category: process_creation
    product: windows
