title: Application Whitelisting Bypass via COM Scriptlets (SCT) by IE4uinit.exe
id: b0ad151d-46bd-4fcc-b8ad-9bc61731cb18
status: experimental
description: ie4uinit.exe is a legitimate Windows executable (part of IE) that can run a scriptlets (SCT) from an INF files.
author: Ilyas Ochkov, oscd.community
date: 2020/10/18
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Ie4uinit.yml
    - https://bohops.com/2018/03/10/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence-part-2/
tags:
    - attack.defense_evasion
    - attack.t1218
level: medium
fields:
    - CommandLine
    - Image
    - ParentImage
logsource:
    category: process_creation
    product: windows
detection:
    run_ie4uinit_with_cmd:  # CommandLine detection
        Image|endswith:
            - '\ie4uinit.exe'
        CommandLine|contains:
            - '-basesettings'		
    legitimate_paths_image:        
        Image|endswith: 
            - '\Windows\System32\ie4uinit.exe'
            - '\Windows\SysWOW64\ie4uinit.exe'
    run_Rundll32:      # ParentImage detection (if there is no CommandLine in the event)
        Image|endswith:
            - '\rundll32.exe'
        ParentImage|endswith:
            - '\ie4uinit.exe'
    legitimate_paths_parentimage:
        ParentImage|endswith:
            - '\Windows\System32\ie4uinit.exe'
            - '\Windows\SysWOW64\ie4uinit.exe'	
    condition: (run_ie4uinit_with_cmd and not legitimate_paths_image) or (run_Rundll32 and not legitimate_paths_parentimage) or (image_name and not legitimate_paths_image)
---
logsource:
    category: image_load
    product: windows
detection:
    image_name:
        Image|endswith:
            - '\ie4uinit.exe'
    legitimate_paths_image:        
        Image|endswith:
            - '\Windows\System32\ie4uinit.exe'
            - '\Windows\SysWOW64\ie4uinit.exe'			
