title: Audio Capture via PowerShell
description: Detect attacker collecting audio via PowerShell Cmdlet.
status: experimental
author: E.M. Anhaus (orignally from Atomic Blue Detections, Endgame)
date: 2019/10/24
tags:
    - attack.collection
    - attack.t1123
detection:
    selection:
        CommandLine:
            - '* WindowsAudioDevice-Powershell-Cmdlet *'
    condition: selection
falsepositives:
    - legit audio capture
level: medium
logsource:
    category: process_creation
    product: windows
